{
  "title": "Meromorphic functions of one complex variable. A",
  "article_id": "arXiv:0801.0692",
  "subject": [
    "Complex Variables"
  ],
  "abstract": "This is an appendix to the English translation of the book by A. A. Goldberg and I. V. Ostrovskii, Distribution of values of meromorphic functions, Moscow, Nauka, 1970. An English translation of this book is to be published soon by the AMS. In this appendix we survey the results obtained on the topics of the book after 1970.",
  "content": "1.\n\n≤ \nXa∈C\n\n(3)\n\nThis was proved by Mues [122] for m\n2, provided all poles of f are simple.\n≥\nIn the general case the best known upper bound for the sum in (3) appears\nto be 4/3 [84, 161].\n\nThe Mues conjecture (3) would follow from a positive resolution of the\nGol’dberg conjecture that, for a transcendental meromorphic function f and\nk\n\n2,\n\nN (r, f )\n\n≤\n\nN(r, 1/f (k)) + o(T (r, f ))\n\n(4)\n\n→ ∞\n\nas r\n, possibly outside an exceptional set. This is in turn linked to a\nclassical result of P´olya [135] that if f has at least two distinct poles then\nf (k) has at least one zero, for all suﬃciently large k. When f has poles of\nmultiplicity at most k\n1 the inequality (4) follows from a lemma of Frank\nand Weissenborn [55] (see also [154]), so that in particular if f has only\nsimple poles then (3) is true for every positive m. A related inequality was\nproved in [53, 149]: if F = L[f ] as in (2), where the aj are small functions\ncompared to f , then either\n\n−\n\nN(r, F )\n\n≤\n\nN(r, 1/F ) + 2N(r, f ) + o(T (r, f ))\n\noutside a set of ﬁnite measure or f is a rational function in solutions of the\nhomogeneous equation L[w] = 0. This method is connected to Steinmetz’\nproof [147] of the second main theorem for small functions discussed below.\nNo further results in the direction of (4) appear to be known, although it\nwas proved by Langley in [106] that if f is meromorphic of ﬁnite order in the\n\n6\n\n≥\n\n\nplane and f (k) has ﬁnitely many zeros, for some k\nmany poles.\n\n≥\n\n2, then f has ﬁnitely\n\nExamples abound of meromorphic functions with inﬁnitely many poles\nsuch that the ﬁrst derivative has no zeros, but it was proved in [50] (see also\n[11]) that if f is transcendental and meromorphic with lim supr→∞ T (r, f )/r =\n0 then f ′ has inﬁnitely many zeros: the corresponding result with lim sup re-\nplaced by lim inf may be found in [83].\n\nWe remark that the above results have all been stated for functions mero-\nmorphic in the plane. Those which are proved only using properties of the\nNevanlinna characteristic admit in some cases generalisation to functions of\nsuﬃciently rapid growth in a disk [71] or a half-plane [110]. Some related\nresults for functions of slower growth in the disc appear in [143, 145].\n\nAn old conjecture of Nevanlinna was that one can replace constants ak in\nthe second main theorem by meromorphic functions ak(z) with the property\nT (r, ak) = o(T (r, f )). Such functions ak are usually called “small targets”.\nFor the case of an entire function f such a generalization was obtained by\nChuang Chi Tai in 1964. Much later, the second main theorem without the\nramiﬁcation term, was proved for meromorphic functions by Osgood, who\nused methods from number theory [129, 130, 131]. A substantial simpli-\nﬁcation of Osgood’s proof was made by Steinmetz [147], who also used a\nbeautiful idea of Frank and Weissenborn [55]. Osgood and Steinmetz proved\nthat\n\nq\n\nN(r, (f\n\nak)−1)\n\n−\n\n(q\n\n−\n\n≥\n\n2 + o(1))T (r, f ),\n\nXk=1\n\noutside of the usual exceptional set. The proof in [147] is simple and elegant;\nand uses only manipulations with Wronski determinants and the classical\nlemma on the logarithmic derivative. This makes it suitable for generaliza-\ntions to holomorphic curves [130, 131, 137]. However, this version of the\nsecond main theorem does not take ramiﬁcation into account. Simple exam-\nples like f (z) = ez + z where δ(\nT (r, f )\nshow that one cannot include the term N1. However, the following form of\nthe second main theorem holds with small targets:\n\n, f ) = δ(z, f ) = 1 and N1(r, f )\n\n∞\n\n∼\n\nq\n\nN(r, (f\n\nak)−1)\n\n−\n\n≥\n\n−\n\n(q\n\n2 + o(1))T (r, f ),\n\nXk=1\nak)−1) is the usual function counting zeros of f\n\nwhere N (r, (f\na disre-\ngarding multiplicity. This result was recently obtained by Yamanoi [160]. In\n\n−\n\n−\n\n7\n\n\n[159] he separately treats the case of rational functions ak when the proof is\ntechnically simpler. Yamanoi’s proof is very complicated, and it will be hard\nto generalize to holomorphic curves. Surprisingly, it uses Ahlfors’s theory of\ncovering surfaces (and also algebraic geometry, moduli spaces of curves, and\ncombinatorics). The idea to bring Ahlfors’s theory to this context has its ori-\ngin in the work of Sauer [139] who obtained a partial result for rational small\ntargets. One application of Yamanoi’s generalization of the second main the-\norem is the following. Suppose that f and g are meromorphic functions in\nC satisfying a relation of the form (1). If the genus of the curve F (u, v) = 0\nis greater than 1, then T (r, f ) + T (r, g) = O(φ(r)). This was conjectured by\nEremenko in 1982, and the important special case that φ(r) = ln r, that is\nF is a polynomial in all three variables, was proved by Zaidenberg in 1990.\nNow we turn to the classic setting. The estimate in the lemma on the\n\nlogarithmic derivative was improved by Gol’dberg and Grinstein [66]:\n\nm(r, f ′/f )\n\nln+\n\n{\n\n≤\n\nT (ρ, f )(1\n\n(r/ρ))−1\n\n}\n\n−\n\n+ const,\n\nwhere the constant depends on f . Vojta’s analogy (see comments to Chap-\nter I) stimulated new interest in reﬁned estimates for the logarithmic deriva-\ntive, as well as for the error term\n\nq\n\nS(r, f ) =\n\nm(r, aj, f ) + N1(r, f )\n\nXj=1\n\n2T (r, f )\n\n−\n\nin the second main theorem. Miles [118] derived from Gol’dberg’s and Grin-\nstein’s estimate the following. Let ψ be a continuous non-decreasing function\nsuch that\n\n∞\n\ndt\ntψ(t)\n\n1\nZ\n\n<\n\n.\n\n∞\n\nThen for every meromorphic function f we have\n\nm(r, f ′/f )\n\n≤\n\nln+ ψ(T (r, f )) + O(1),\n\noutside an exceptional set of ﬁnite logarithmic measure. The strongest results\non the error term S(r, f ) belong to Hinkkanen [85], for example:\n\nS(r, f )\n\n≤\n\nln+ ψ(T (r, f )) + O(1),\n\noutside an exceptional set of ﬁnite logarithmic measure, where φ is as before.\nIf one replaces ψ by tψ(t), then both results will hold outside an exceptional\n\n8\n\n\nset of ﬁnite measure. All presently known results on the error terms in one-\ndimensional Nevanlinna theory are collected in the book [18].\n\nNo analog of the second main theorem holds without an exceptional set\nof r’s. This can be seen from the result of Hayman [72]: Let\nbe closed\nsets of zero logarithmic capacity, and φ and ψ arbitrary unbounded increasing\nfunctions. Then there exist an entire function f and a sequence rk → ∞\nsuch\nthat N(rk, a, f )\n\nEk, while T (rk, f ) > ψ(rk).\n\nφ(rk) ln rk for all a\n\nEk}\n\n{\n\n≤\n\n∈\n\nChapter IV.\n\nThe result of Hayman we just cited shows that the set EV (f ) of Valiron\nexceptional values, which always has zero capacity, can contain any Fσ set of\nzero capacity, but a complete description of possible sets EV (f ) is not known.\nFor meromorphic functions f of ﬁnite order, Hyllengren [96] obtained a\nvery precise description of the sets EV (f ). Let us say that a set E satisﬁes\nthe H-condition if there exist a sequence (an) of complex numbers and η > 0\nsuch that every point of E belongs to inﬁnitely many discs\n<\n. For every meromorphic function f of ﬁnite order, and\nexp(\nC for which ∆(a, f ) > x\nevery x\nsatisﬁes the H-condition, and vise versa, for every set E satisfying the H-\ncondition, there exist an entire function f and a number x\n(0, 1) such that\nE. Notice that the H-condition is much stronger\n∆(a, f ) > x, for all a\nthan the condition of zero capacity.\n\n(0, 1), the set EV (x, f ) of those a\n\nexp(ηn))\n\nan|\n\nw :\n\n−\n\n−\n\nw\n\n∈\n\n∈\n\n∈\n\n∈\n\n{\n\n}\n\n|\n\nThe ﬁrst example of an entire function of ﬁnite order whose deﬁciency\ndepends on the choice of the origin was constructed by Miles [116]. The order\nof this function was very large. Then Gol’dberg, Eremenko and Sodin [65]\nconstructed such examples with any given order greater than 5. (For entire\nfunctions of order less than 3/2, deﬁciencies are independent of the choice of\nthe origin.)\n\nChapter V.\n\nPut L(r, f ) = ln µ(r, f )/ ln M(r, f ), where µ(r, f ) = min\n\nCorollary 3 on p. 232 says that lim supr→∞ L(r, f )\n2[λ] replaced by\nshowed that the same holds with\nenough. For functions of inﬁnite order, he proved\n\n−\n\n−\n\nz\n\n{|\n\nf (z) :\n\n.\n}\n[2λ]. Hayman [70]\n≥ −\n2.19 ln ρ when ρ is large\n\n= r\n\n|\n\n|\n\nL(r, f )\n\nlim sup\nr→∞\n\nln ln ln M(r, f ) ≥ −\n\n2.19.\n\n9\n\n\n−\n\nHe also constructed examples of entire functions of large ﬁnite order for\nwhich lim supr→∞ L(r, f ) <\n1. Then Fryntov [56], answering a question\nof Hayman, constructed entire functions of any given order ρ > 1 with the\nsame property. Drasin [29] constructed entire functions of order one, maximal\ntype, with the property M(r, f )µ(r, f )\n0. This may be contrasted with a\nremarkable theorem of Hayman [73] which says that if f is an entire function\nof order one and normal type, and M(r, f )µ(r, f ) is bounded, then f (z) =\nc exp(az) for some constants c and a.\n\n→\n\nf (z)\n\nThus for an entire function of order at least one, µ(r, f ) can decrease at a\nhigher rate than that of increase of M(r, f ). The situation changes dramati-\non an unbounded connected\ncally if we consider the rate of decrease of\nset. Hayman and Kjellberg [78] proved that for every entire function f and\nevery K > 1 all components of the set\nare\nbounded.\n\n{\nTheorem 1.3′ has been the subject of many deep generalizations. First\nwe mention the famous “spread relation” of Baernstein [2] [4] conjectured by\nEdrei in [34]: If f is a meromorphic function of lower order λ, then for every\nǫ > 0 there are arbitrary large values of r such that the set of arguments θ\nwhere\n\n> 1 has measure at least\n\n+ K ln M(\n\nf (reiθ)\n\n, f ) < 0\n\nz : ln\n\nf (z)\n\n}\n\nz\n\n|\n\n|\n\n|\n\n|\n\n|\n\n|\n\n|\n\n|\n\nmin\n\n4\nλ\n\n\n\n\narcsin\n\nδ(\n\n, f )\n∞\n2\n\ns\n\n, 2π\n\nǫ.\n\n−\n\n\n\n\n(5)\n\nSimilar sharp estimates of the measure of the set where\n\n\n\n\n\nwere given in [1].\n\nf (reiθ)\n\nln\n\n|\n\n|\n\n> αT (r, f )\n\nFryntov, Rossi and Weitsman [57, 58] proved that under the assumptions\nf (reiθ)\n> 1 must contain an arc of length\nof the spread conjecture, the set\n(5). See also [3] for the sharp lower estimate of the length of the arcs in the\nset\n\n{\nExtremal functions for the spread relation and its generalizations were\n\n> α ln M(r, f )\n\nf (reiθ\n\nθ : ln\n\n}\n\n|\n\n|\n\n|\n\n|\n\n.\n\nstudied extensively, [5, 36, 37, 142].\n\nThe new methods introduced by Baernstein [2], [4] are based on the use\nof subharmonic functions, and especially, on a new type of maximal function,\nthe so-called “star-function”, which turned out to be very useful in solving a\nwide variety of extremal problems of function theory. An account of Baern-\nstein’s star function and its main applications is contained in the monograph\n[79].\n\n10\n\n\nOne important application of the spread relation is the sharp estimate\nof the sum of deﬁciencies of a meromorphic function of lower order λ\n1\n[35]. If a meromorphic function f of lower order λ has at least two deﬁcient\nvalues, then\n\n≤\n\nδ(a, f )\n\n≤ (\n\nXa∈C\n\n1\n2\n\n−\n−\n\ncos πλ,\nsin πλ,\n\n0 < λ\n≤\n1/2 < λ\n\n1/2\n1.\n\n≤\n\n,\n\nThe sharp estimate of the sum of deﬁciencies of a meromorphic function in\nterms of its order or lower order λ is still not established for λ > 1. The\nconjectured extremal functions are described in [32].\n\nThe results of\n\n2 show that neither Nevanlinna nor Borel exceptional\n§\nvalues need be asymptotic values. On the other hand, Picard exceptional\nvalues are asymptotic. A natural question arises, whether any condition of\nsmallness of N(r, a, f ) in comparison with T (r, f ) will imply that a is an\nasymptotic value. The basic result belongs to the intersection of the papers\n[16], [74], and [38]. Let f be a meromorphic function of lower order λ\n. If\nthe order of N(r, a, f ) is strictly less than min\nthen a is an asymptotic\nvalue. Example 3 on p. 249 shows that this condition is sharp, if only the\nlower order of f is taken into account. In [38], a weaker suﬃcient condition\nfor a to be an asymptotic value is given, that uses both the order and lower\norder of f . Hayman [74] gives the following reﬁned condition: if\n\n1/2, λ\n\n≤ ∞\n\n{\n\n}\n\nT (r, f )\n\n∞\n\n1\n2\n\n−\n\nr1/2\n\nr\nZ\n\nt−3/2N(t, a, f )dt\n\n,\n\n→ ∞\n\nthen a is an asymptotic value.\n\nThe problem on p. 285 of optimal estimation of κ(f ) for functions of\nlower order greater than 1 is still open, even for entire functions. It has been\nsolved only for entire functions with zeros on a ray [94].\n\nThe best estimates known at this time for entire and meromorphic func-\ntions with ﬁxed λ > 1 are contained in [119, 120]. They are derived from the\nfollowing sharp inequality which is obtained by the Fourier method:\n\nlim sup\n\nN(r, 0) + N(r,\n\nm2(r, f )\n\n)\n\n∞\n\nsup\nλ∗≤λ≤ρ∗\n\n≥\n\n√2|\n\nsin πλ\n\n|\nπλ (\n\n1 +\n\nsin 2πλ\n\n2πλ )\n\n−1/2\n\n,\n\nwhere m2 is the L2-norm,\n\nm2\n\n2(r, f ) =\n\n2π\n\n1\n2π Z\n\n0\n\n(ln\n\n|\n\nf (reiθ)\n\n)2dθ,\n\n|\n\n11\n\n\nand λ∗ and ρ∗ are the order and lower order in the sense of P´olya, [31] (see\nalso comments to Chapter II).\n\nIn 1929, F. Nevanlinna [127] found that meromorphic functions of ﬁnite\n\norder satisfying N1(r, f )\na) 2ρ is an integer, 2ρ\nb) all deﬁcient values are asymptotic, and\nc) all deﬁciencies are rational numbers with denominators at most 2ρ,\n\n0 have the following properties:\n\n≡\n\n≥\n\n2,\n\nand their sum equals 2.\n\nIt was natural to conjecture that one of the conditions\n\nor\n\nN1(r, f ) = o(T (r, f )),\n\nδ(a, f ) = 2\n\nXa∈C\n\n(6)\n\n(7)\n\nimplies the properties a), b) and c). Notice, that by the second main theorem,\n(7) implies (6) for functions of ﬁnite order.\n\nIt turns out that a strong form of this conjecture holds:\nSmall Ramification Theorem. If f is a meromorphic function of\n\nﬁnite lower order with the property (6) then a), b) and c) hold, and:\n\nT (r, f ) = rρℓ(r),\n\n(8)\n\nwhere ℓ is a slowly varying function in the sense of Karamata.\n\nAs a corollary we obtain that conditions (6) and (7) for functions of ﬁnite\n\nlower order are equivalent.\n\nThis result has a long history which begins with theorems of Pﬂuger and\nEdrei and Fuchs establishing the case of entire functions (see Corollary 2 on\np. 315). Weitsman [158] proved that (7) implies that the number of deﬁcient\nvalues is at most 2ρ. Then Drasin [27], [28] proved that for functions of ﬁnite\norder (7) implies a), b) and c) and the regularity condition (8). Eremenko\nproposed a new potential-theoretic method (see, for example, [48]) which\nﬁnally led to a proof of a simpler proof of Drasin’s theorem. The small\nramiﬁcation theorem in its present form stated above is proved in [44].\n\nThese results show that besides the defect relation, there is an additional\nrestriction on defects of functions of ﬁnite order: (7) implies that the number\nof deﬁcient values is ﬁnite and all defects are rational.\n\n12\n\n\nThere are other restrictions as well. Weitsman’s theorem [157] says that\n\nfor functions f of ﬁnite lower order\n\nδ(a, f )1/3 <\n\n.\n\n∞\n\nXa∈C\n\n(9)\n\nThe story of this theorem is described in Comments to Chapter VII (see p.\n576). Weitsman’s proof can actually be modiﬁed to produce an upper bound\ndepending only on the lower order of f .\n\nThe second restriction concerns functions of ﬁnite order having a defect\n\nequal to 1. Lewis and Wu proved that such functions satisfy\n\nδ(a, f )1/3−α <\n\n,\n\n∞\n\nXa∈C\n\nwith some absolute constant α > 0. Their proof gives α = 2−264, which is far\nfrom what is expected. (Lewis and Wu state their result for entire functions\nbut their proof applies to all functions with δ(a, f ) = 1 for some a.)\n\nExamples of entire functions of ﬁnite order with the property δ(an, f )\n\ncn\n(0, 1) are constructed in [45], but a large gap remains between\n\nfor some c\nthese examples and the result of Lewis and Wu.\n\n≥\n\n∈\n\nRecent research on value distribution meromorphic functions of the form\n\nck\n\n−\n\nz\n\n,\n\nzk\n\nX\n\nck|\n|\nzk|\n|\n\nX\n\n<\n\n∞\n\n(10)\n\nwas mainly concentrated on the functions with ck > 0. Such functions are\n(complex conjugate to) gradients of subharmonic functions of genus zero with\ndiscrete mass. The main conjecture is that every function of the form (10)\nhas zeros. This was proved in [50] under the additional assumption that\ninf ck > 0.\n\nChapter VI\n\nEntire functions whose zeros lie on (or are close to) ﬁnitely many rays\nwere intensively studied. Under certain conditions, one can estimate δ(0, f )\nfrom below, as in Corollary 4 on p. 350. The strongest results in this\ndirection belong to Hellerstein and Shea [91] and Miles [115]. One of the\nresults of [91] says that δ(0, f ) > Bq(θ1, ..., θn) for all entire functions of\ngenus q with zeros on the rays arg z\n\n1 when q\n\nθ1, ..., θq), and Bq →\n\n∈ {\n\n→ ∞\n\n13\n\n\n−\n\n(π2e−1 + o(1))/ ln q, q\n\nwhile the rays remain ﬁxed. In the case of one ray, they obtained Bq(θ) =\n1\n. For entire functions of inﬁnite order with\n→ ∞\nzeros on a ray, Miles [115] proved that N(r, 0, f )/T (r, f )\n→ ∞\navoiding an exceptional set of zero logarithmic density. However, it may\nhappen that δ(0, f ) = 0 for such functions, as Miles shows by an example\nconstructed in the same paper.\n\n0 as r\n\n→\n\nHellerstein and Shea [91] also considered meromorphic functions of ﬁnite\nη\nwn}\nη < π/6. For such functions, they obtained\n\norder whose zeros\narg wn −\nand\na sharp estimate of κ(f ) (deﬁnition on p. 285) from above.\n\nzn}\n{\nη, where 0\n| ≤\n\nlie in opposite sectors\n\narg zn| ≤\n\nand poles\n\n≤\n\nπ\n\n{\n\n|\n\n|\n\nFor entire functions with zeros on ﬁnitely many rays, there are relations\nbetween the order and lower order (see p. 344). There relations were further\ninvestigated in [117, 60] and [136].\n\nMiles [117] considers the class of meromorphic functions f whose zeros\nbelong to a ﬁnite union of rays X and poles belong to a ﬁnite union of rays\nY , where X\n, and such that the exponent of convergence of the union\nof zeros and poles is a given number q. He then produces a non-negative\ninteger p = p(q, X, Y ) such that\n\nY =\n\n∩\n\n∅\n\nlim\nr→∞\n\nT (r, f )\n\nrp =\n\n∞\n\nif\n\np > 0 and\n\nlim\nr→∞\n\nT (r, f )\nln r\n\n=\n\n∞\n\nif p = 0,\n\nand these growth estimates are sharp in the considered class. The integer p\ndepends in a subtle way on the arithmetical properties of the arguments of\nthe rays X and Y , and this integer is in general hard to compute or estimate.\nGleizer [60] considers entire functions with zeros on n rays. If n = 1 or\n[λ] + n, where [ ] is the integer part. This follows from\nλ can\n−\n3([λ] + 1). For\n\nn = 2, we have ρ\nTheorem 1.1, Chapter VI. However, if n = 3, then the diﬀerence ρ\nbe arbitrarily large. In this case, Gleizer proved that [ρ]\narbitrary n, Qiao [136] proved that ρ\n\n≤\nIn [59, 61], Gleizer extended Theorem 4.1 by taking into account not only\nthe order but the lower order in the sense of P´olya. He used Baernstein’s\nstar-function.\n\n4q−1([λ] + 1).\n\n≤\n\n≤\n\nThere has been remarkable progress in the problems considered in 5. The §\nconjecture of P´olya and Wiman stated on p. 417 was proved by Hellerstein\nand Williamson [92, 93]. If f is a real entire function such that all zeros of\nf f ′f ′′ are real then f belongs to the Laguerre–P´olya class. In [95] the same\nauthors with Shen classiﬁed all entire functions (not necessarily real) with the\n\n14\n\n\nproperty that f f ′f ′′ has only real zeros. The classiﬁcation of meromorphic\nfunctions with the property that all their derivatives have only real zeros was\nachieved by Hinkkanen [86, 87, 88, 89, 90].\n\nSheil-Small [144] proved a conjecture of Wiman (1911), that every real\nentire function of ﬁnite order with the property that f f ′′ has only real zeros\nbelongs to the Laguerre–P´olya class. Bergweiler, Eremenko and Langley [13]\nextended Sheil-Small’s result to functions of inﬁnite order. Then Langley\n[109] extended this result to the derivatives of higher orders: If f is a real\nentire function of inﬁnite order, with ﬁnitely many non-real zeros, then f (k)\nhas inﬁnitely many non-real zeros for every k 2.\n\nFor real entire functions of ﬁnite order with ﬁnitely many non-real zeros, that do not belong to the Laguerre–P´olya class, Bergweiler and Eremenko\n[12] proved that the number of non-real zeros of f (k) tends to inﬁnity as\nk\n. Together with Langley’s result, this conﬁrms another conjecture of\nP´olya (1943).\n\n→ ∞\n\n≥\n\nChapter VII\n\nThe inverse problem (as stated on p. 487) was completely solved by\nDrasin [25]. A simpliﬁed proof is given in [26]. The general idea is the same\nas in Chapter VII: quasiconformal surgery and a version of the theorem of Be-\nlinskii and Teichm¨uller are involved. However, unlike in Chapter VII, Drasin\ndoes not construct the Riemann surface spread over the sphere explicitly but\nuses a more ﬂexible technique.\n\nTheorem 8.1 in Chapter VII actually gives a complete solution of the\ninverse problem for ﬁnitely many deﬁcient values in the class of meromorphic\nfunctions of ﬁnite order. (This was not known in 1970 when the book was\nwritten. That condition 3 of this Theorem 8.1 is necessary follows from the\nsmall ramiﬁcation theorem above).\n\nOn the narrow inverse problem in the class of meromorphic functions of\nﬁnite order with inﬁnitely many deﬁciencies, there is the following result [42]:\n\nLet\n\na\n}\n\n{\n\nbe an arbitrary inﬁnite countable subset of C, and\n\nnumbers satisfying the following conditions:\n\nδn}\n\n{\n\npositive\n\n(i) δn < 1,\n(ii)\n(iii)\nThen there exists a meromorphic function f of (large) ﬁnite order such\n\nn δn < 2, and\nn δ1/3\nn <\n.\n\n∞\n\nP\nP\n\n15\n\n\nthat δ(an, f ) = δn, and f has no other deﬁcient values.\n\nThe order of this function depends on the quantities in the right hand\n\nsides of (i), (ii) and (iii).\n\nConditions (ii) and (iii) are necessary because of the small ramiﬁcation\ntheorem, and Weitsman’s theorem (see comments to Chapter V above). Con-\ndition (i) cannot be removed because of the Lewis and Wu theorem stated\nabove, but it is not known what the precise condition on δn is, if δ1 = 1.\n\nThe class of meromorphic functions with ﬁnitely many critical and asymp-\ntotic values which was used in Chapter VII to investigate the inverse problem\nis interesting independently of this application. Let us call this class S. The\nﬁrst general result on functions of this class belongs to Teichm¨uller, who\nproved that the second main theorem becomes an asymptotic equality for\nfunctions of this class:\n\nq\n\nXj=1\n\nm(r, aj, f ) + N1(r, f ) = 2T (r, f ) + Q(r, f ),\n\nwhere aj are all critical and asymptotic values.\n\nLangley [108] found that the growth of a function f\n\ntrary:\n\nS cannot be arbi-\n\n∈\n\nc(f ) := lim inf\nr→∞\n\nT (r, f )\nln2 r\n\n> 0.\n\nThis constant c(f ) can be arbitrarily small, but in the case that f has only\n√3/(2π) and this\nthree critical and asymptotic values, we have [49] c(f )\nis best possible. On the other hand, there are no restrictions from above on\nthe growth of functions of class S [113].\n\n≥\n\nClass S plays an important role in holomorphic dynamics (iteration of\nentire and meromorphic functions), see, for example, the survey [7]. In [23]\nan application of almost periodic ends is given. In [32] the method of Chapter\nVII is extended to a new class of Riemann surfaces which the authors call\n“Lindel¨oﬁan ends”. The corresponding functions have inﬁnitely many critical\nvalues and thus do not belong to the class S.\n\nAppendix.\n\nGovorov’s original proof of the Paley conjecture was a byproduct of his\nresearch on the Riemann Boundary problem with inﬁnite index [68]. His\n\n16\n\n\ntheorem was generalized to meromorphic functions by Petrenko, to subhar-\nmonic functions in Rn by Dahlberg, and to entire functions of several complex\nvariables by Khabubullin, see his survey [98].\n\nPetrenko introduced the following quantity which he called the “deviation\n\nof f from the point a”.\n\nβ(a, f ) = lim inf\nr→∞\n\nln+ M(r, (f\n\n−\nT (r, f )\n\na)−1)\n\n.\n\n(11)\n\n−\n−1 stands in the numerator instead of the L1 norm. Petrenko’s generaliza-\n\nThis diﬀers from the defect in one respect: the uniform norm of ln+\na\n|\ntion of Govorov’s theorem proved in the Appendix can be restated as:\n\nf (reiθ)\n\n|\n\nβ(a, f )\n\nπλ\n\n≤\n\n(12)\n\nC. This was the\nfor all meromorphic functions of lower order λ and all a\nstarting point of a study of deviations β(a, f ) by Petrenko and others. The\nresults obtained before 1978 are summarized in his book [134]. The main\ndiﬀerence between the theory of deviations and the theory of defects is the\nabsence of a ﬁrst main theorem: there is no simple relation between β(a, f )\nand solutions of the equation f (z) = a.\n\n∈\n\nWe only present a sample of the results. By analogy with defects, one\n\ncan expect that the set of exceptional values in the sense of Petrenko\n\nP (f ) :=\n\na\n\n{\n\n∈\n\nC : β(a, f ) > 0\n\n}\n\nfor every meromorphic function f , the\nis small. This is indeed the case:\nset P (f ) has zero logarithmic capacity; for functions of ﬁnite lower order it\nis at most countable (but may have the power of continuum for functions of\ninﬁnite lower order). The following analog of the Defect relation for functions\nof ﬁnite lower order was established by Marchenko and Shcherba [112]:\n\nβ(a, f )\n\n≤ (\n\nXa∈C\n\n1/2,\n2πλ,\nπλ csc πλ, λ < 1/2.\n\n≥\n\nλ\n\nMoreover, an analog of Weitsman’s theorem (see comments to Chapter V)\nholds: for functions f of ﬁnite lower order we have\n\nβ(a, f )1/2 <\n\n,\n\n∞\n\nXa∈C\n\n17\n\n\nand the exponent 1/2 is best possible. A version Baernstein’s spread relation\nalso holds with deviations instead of deﬁciencies [134]. It is worth mentioning\nhere that, according to Baernstein [4], the idea of introducing the star func-\ntion that led to the proof of the spread relation occurred under the inﬂuence\nof Petrenko’s proof of (12).\n\nThe inverse problem for deviations turned out to be simpler than the\ninverse problem for deﬁciencies. A complete solution for functions of ﬁnite\nan}\nof points and\norder is given in [42]: For every at most countable set\nβ1/2\nevery sequence of positive numbers βn satisfying the condition\n,\nn <\n∞\nthere exists a meromorphic function f of ﬁnite order such that β(an, f ) = βn\nand β(a, f ) = 0 for a /\n\nP\n\n{\n\n.\n\nIn general, there is no relation between the sets EN (f ) and P (f ): for every\npair (A, B) of at most countable subsets of C, there exists a meromorphic\nfunction f of any given non-zero order such that EN (f ) = A and P (f ) = B\n[64, 65]. On the other hand, if T (2r, f ) = O(T (r, f )) then P (f ) = EV (f )\n[41].\n\nan}\n\n∈ {\n\nBergweiler and Bock [10] found an analog of (12) for functions of inﬁnite\nlower order. The idea was to replace T (r, f ) in the denominator of (11) by\nA(r, f ). Notice that if one uses the Ahlfors deﬁnition of T (r, f ) then A(r, f ) =\ndT (r, f )/d ln r, for example, if T (r, f ) = rλ then A(r, f ) = λT (r, f ). Berg-\nweiler and Bock proved that for every meromorphic function f of order at\nleast 1/2 and every a\n\nC we have\n\n∈\n\nb(a, f ) := lim inf\nr→∞\n\nln+ M(r, (f\n\n−\nA(r, f )\n\na)−1)\n\nπ,\n\n≤\n\nand then Eremenko [46] established the following analog of the Defect Rela-\ntion:\n\nb(a, f )\n\n≤ (\n\nXa∈C\n\n2π,\n2π sin πλ, λ\n\nλ > 1/2,\n1/2\n\n,\n\n≤\n\nassuming that there are at least two values a with b(a, f ) > 0. It follows\nthat for every meromorphic function the set\nis at most\ncountable.\n\nC : b(a, f ) > 0\n\n∈\n\na\n\n}\n\n{\n\nEven Drasin’s theorem on the extremal functions for the defect relation\n\n(see Comments to Chapter V) has its analog for b(a, f ) [47]:\n\nIf f is of ﬁnite lower order and\n\nb(a, f ) = 2π\n\nXa∈C\n\n18\n\n\nthen the following limit exists\n\nlim\nr→∞\n\nln T (r, f )\nln r\n\n=\n\nn\n2\n\n,\n\nwhere n is an integer, and b(a, f ) = π/n or 0 for every a\n\nC.\n\n∈\n\n19\n",
  "reference": [
    "[1] Anderson, J. M.; Baernstein, Albert, II. The size of the set on which a meromorphic function is large. Proc. London Math. Soc.  36 (1978), no. 3, 518–539.  ",
    "[2] Baernstein, Albert, II. Proof of Edrei’s spread conjecture. Proc. London Math. Soc.  26 (1973), 418–434.  ",
    "[3] Baernstein, Albert, II. A generalization of the cos πρ theorem. Trans. Amer. Math. Soc. 193 (1974), 181–197.  ",
    "[4] Baernstein, Albert, II. How the ∗-function solves extremal problems. Proceedings of the International Congress of Mathematicians (Helsinki, 1978), pp. 639–644, Acad. Sci. Fennica, Helsinki, 1980.  ",
    "[5] Baernstein, Albert, II. Regularity theorems associated with the spread relation. J. Analyse Math. 31 (1977), 76-111.  ",
    "[6] Barth, K. F.; Brannan, D. A.; Hayman, W. K. The growth of plane harmonic functions along an asymptotic path. Proc. London Math. Soc.  37 (1978), no. 2, 363–384.  ",
    "[7] Bergweiler, Walter. Iteration of meromorphic functions. Bull. Amer. Math. Soc. (N.S.) 29 (1993), no. 2, 151–188  ",
    "[8] Bergweiler, W. On the zeros of certain homogeneous diﬀerential polynomials, Archiv der Math. 64 (1995), 199-202.  ",
    "[9] Bergweiler, W. Normality and exceptional values of derivatives, Proc. Amer. Math. Soc. 129 (2001), 121-129.  ",
    "[10] Bergweiler, Walter; Bock, Heinrich. On the growth of meromorphic functions of inﬁnite order. J. Anal. Math. 64 (1994), 327–336.  ",
    "[11] Bergweiler, W. and Eremenko, A. On the singularities of the inverse to a meromorphic function of ﬁnite order, Rev. Mat. Iberoamericana 11 (1995), 355-373.  ",
    "[12] Bergweiler, W; Eremenko, A. Proof of a conjecture of P´olya on the zeros of successive derivatives of real entire functions, To appear in Acta Math.  20  ",
    "[13] Bergweiler, W.; Eremenko, A.; Langley, J. K. Real entire functions of inﬁnite order and a conjecture of Wiman. Geom. Funct. Anal. 13 (2003), no. 5, 975–991.  ",
    "[14] Bergweiler, Walter; Langley, J. K. Multiplicities in Hayman’s alternative. J. Aust. Math. Soc. 78 (2005), no. 1, 37–57.  ",
    "[15] F. Br¨uggemann, Proof of a conjecture of Frank and Langley concerning zeros of meromorphic functions and linear diﬀerential polynomials, Analysis 12 no. 1/2 (1992), 5-30.  ",
    "[16] Chang, Kuan Heo. Asymptotic values of entire and meromorphic functions. Sci. Sinica 20 (1977), no. 6, 720–739.  ",
    "[17] Chen Zhen Hua, Normality of families of meromorphic functions with multiple valued derivatives, Acta Math. Sinica 30 (1987), 97-105.  ",
    "[18] Cherry, William; Ye, Zhuan. Nevanlinna’s theory of value distribution. The second main theorem and its error terms. Springer-Verlag, Berlin, 2001.  ",
    "[19] Chuang, C. T., On diﬀerential polynomials, in: Analysis of One Complex Variable, World Sci. Publishing, Singapore 1987, 12-32.  ",
    "[20] Chuang, Chi-Tai; Yang, Chung-Chun. Fix-points and factorization of meromorphic functions. Translated from the Chinese. World Scientiﬁc Publishing Co., Inc., Teaneck, NJ, 1990.  ",
    "[21] Clunie, J.G. On integral and meromorphic functions, J. London Math. Soc. 37 (1962), 17-27.  ",
    "[22] Clunie, J.G. On a result of Hayman, J. London Math. Soc. 42 (1967), 389-392.  ",
    "[23] Clunie, J.; Eremenko, A.; Rossi, J. on equilibrium points of logarithmic and Newtonian potentials. J. London Math. Soc.  47 (1993), no. 2, 309–320.  ",
    "[24] Csillag, P. ¨Uber ganze Funktionen, welche drei nicht verschwindende Ableitungen besitzen, Math. Ann. 110 (1935), 745-752.  21  ",
    "[25] Drasin, David. The inverse problem of the Nevanlinna theory. Acta Math. 138 (1976), no. 1-2, 83–151.  ",
    "[26] Drasin, David. On Nevanlinna’s inverse problem. Complex Variables Theory Appl. 37 (1998), no. 1-4, 123–143.  ",
    "[27] Drasin, David. Quasiconformal modiﬁcations of functions having deﬁciency sum two. Ann. of Math.  114 (1981), no. 3, 493–518.  ",
    "[28] Drasin, David. Proof of a conjecture of F. Nevanlinna concerning functions which have deﬁciency sum two. Acta Math. 158 (1987), no. 1-2, 1–94.  ",
    "[29] Drasin, David. The minimum modulus of subharmonic functions of order one and a method of Fryntov. J. London Math. Soc.  54 (1996), no. 2, 239–250.  ",
    "[30] Drasin, David. Meromorphic functions: progress and problems, Proc. Intl. Congr. Math., (Z¨urich, 1994) vol. 2, 828–835. Birkh¨auser, Basel, 1995.  ",
    "[31] Drasin, David; Shea, Daniel F. P´olya peaks and the oscillation of positive functions. Proc. Amer. Math. Soc. 34 (1972), 403–411  ",
    "[32] Drasin, David; Weitsman, Allen. Meromorphic functions with large sums of deﬁciencies. Advances in Math. 15 (1975), 93–126.  ",
    "[33] Edrei, Albert. Sums of deﬁciencies of meromorphic functions. J. Analyse Math. 14 1965 79–107  ",
    "[34] Edrei, Albert. Sum of deﬁciencies of meromorphic functions. J. d’Analyse Math. 19 (1967), 53–74.  ",
    "[35] Edrei, Albert. Solution of the deﬁciency problem for functions of small lower order. Proc. London Math. Soc.  26 (1973), 435–445.  ",
    "[36] Edrei, Albert; Fuchs, Wolfgang H. J. Asymptotic behavior of meromorphic functions with extremal spread. I. Ann. Acad. Sci. Fenn. Ser A I Math. 2 (1976), 67–111.  ",
    "[37] Edrei, Alberet; Fuchs, Wolfgang H. J. Asymptotic behavior of meromorphic functions with extremal spread. II. Ann. Acad. Sci. Fenn. Ser A I Math. 3 (1977), 141–168.  22  ",
    "[38] Eremenko, A. The growth of entire and subharmonic functions on asymptotic curves. (Russian) Sibirsk. Mat. Zh. 21 (1980), no. 5, 39–51, 189.  ",
    "[39] Eremenko, A. Meromorphic solutions of algebraic diﬀerential equations. (Russian) Uspekhi Mat. Nauk 37 (1982), no. 4, 53–82, 240. Correction: Uspekhi Mat. Nauk 38 (1983), no. 6, 177.  ",
    "[40] Eremenko A. Deviations of meromorphic functions of ﬁnite lower order. (Russian) Teor. Funktsi˘ı Funktsional. Anal. i Prilozhen. No. 40 (1983), 56–64.  ",
    "[41] Eremenko, A. Defects and deviations of ﬁnite-order meromorphic functions. (Russian) Dokl. Akad. Nauk Ukrain. SSR Ser. A 1985, no. 1, 18–21.  ",
    "[42] Eremenko, A. Inverse problem of the theory of distribution of values for ﬁnite-order meromorphic functions. (Russian) Sibirsk. Mat. Zh. 27 (1986), no. 3, 87–102, 223.  ",
    "[43] Eremenko, A. On the set of defect values of a ﬁnite-order entire function. (Russian) Ukrain. Mat. Zh. 39 (1987), no. 3, 295–299, 404.  ",
    "[44] Eremenko, A. Meromorphic functions with small ramiﬁcation. Indiana Univ. Math. J. 42 (1993), no. 4, 1193–1218.  ",
    "[45] Eremenko, A. A counterexample to the Arakelyan conjecture. Bull. Amer. Math. Soc. (N.S.) 27 (1992), no. 1, 159–164.  ",
    "[46] Eremenko, A. An analogue of the defect relation for the uniform metric. Complex Variables Theory Appl. 34 (1997), no. 1-2, 83–97.  ",
    "[47] Eremenko, A. An analogue of the defect relation for the uniform metric. II. Complex Variables Theory Appl. 37 (1998), no. 1-4, 145–159.  ",
    "[48] Eremenko, A. Value distribution and potential theory. Proceedings of the International Congress of Mathematicians, Vol. II (Beijing, 2002), 681– 690, Higher Ed. Press, Beijing, 2002.  ",
    "[49] Eremenko, A. Transcendental meromorphic functions with three singular values. Illinois J. Math. 48 (2004), no. 2, 701–709.  23  ",
    "[50] Eremenko, Alexandre; Langley, Jim; Rossi, John. On the zeros of meromorphic functions of the form f(z) = P∞ k=1 ak/(z − zk). J. Anal. Math. 62 (1994), 271–286.  ",
    "[51] Fedorov, M. A.; Grishin, A. F. Some questions of the Nevanlinna theory for the complex half-plane. Math. Physics, Analysis and Geometry, 1 (1998), 223–271.  ",
    "[52] Frank, G¨unter. Eine Vermutung von Hayman ¨uber Nullstellen meromorpher Funktionen. Math. Z. 149 (1976), no. 1, 29–36.  ",
    "[53] Frank, G. ¨Uber die Nullstellen von linearen Diﬀerentialpolynomen mit meromorphen Koeﬃzienten, Complex Methods on Partial Diﬀerential Equations, 39-48, Math. Res. 53, Akademie-Verlag, Berlin 1989.  ",
    "[54] Frank, G. and Hellerstein, S. On the meromorphic solutions of nonhomogeneous linear diﬀerential equations with polynomial coeﬃcients, Proc. London Math. Soc.  53 (1986), 407-428.  ",
    "[55] Frank, G¨unter; Weissenborn, Gerd. Rational deﬁcient functions of meromorphic functions. Bull. London Math. Soc. 18 (1986), no. 1, 29–33.  ",
    "[56] Fryntov, Alexander. A counterexample concerning the maximum and minimum of a subharmonic function. Proc. Amer. Math. Soc. 122 (1994), no. 1, 97–103.  ",
    "[57] Fryntov, Alexander; Rossi, John; Weitsman, Allen. On the longest arc relation for δ-subharmonic functions. Complex Variables Theory Appl. 34 (1997), no. 1-2, 99–108.  ",
    "[58] Fryntov, Alexander; Rossi, John; Weitsman, Allen. Circular means of ﬁne Green’s functions and the longest arc relation. Complex Variables Theory Appl. 37 (1998), no. 1-4, 211–224.  ",
    "[59] Gle˘ızer, E. V. Meromorphic functions with zeros and poles in small angles. (Russian) Sibirsk. Mat. Zh. 26 (1985), no. 4, 22–37, 203.  ",
    "[60] Gle˘ızer, E. V. The growth of entire functions with zeros on a system of rays. (Russian) Ukrain. Mat. Zh. 38 (1986), no. 3, 297–302, 404.  24  ",
    "[61] Gle˘ızer, E. V. Meromorphic functions with zeros and poles in small angles. II. (Russian) Sibirsk. Mat. Zh. 31 (1990), no. 2, 9–20, 223; translation in Siberian Math. J. 31 (1990), no. 2, 192–202  ",
    "[62] Gol’dberg, A. A. Meromorphic functions. Mathematical analysis, Vol. 10 (Russian), pp. 5–97. Akad. Nauk SSSR Vsesojuz. Inst. Nauˇcn. i Tehn. Informacii, Moscow, 1973.  ",
    "[63] Gol’dberg, A. A. Nevanlinna’s lemma on the logarithmic derivative of a meromorphic function. (Russian) Mat. Zametki 17 (1975), no. 4, 525–529.  ",
    "[64] Gol’dberg, A. A.; Eremenko, A.; Sodin, M. L. Exceptional values in the sense of R. Nevanlinna and in the sense of V. P. Petrenko. I. (Russian) Teor. Funktsi˘ı Funktsional. Anal. i Prilozhen. No. 47 (1987), 41–51; translation in J. Soviet Math. 48 (1990), no. 6, 648–655  ",
    "[65] Gol’dberg, A. A.; Eremenko, A.; Sodin, M. L. Exceptional values in the sense of R. Nevanlinna and in the sense of V. P. Petrenko. II. (Russian) Teor. Funktsi˘ı Funktsional. Anal. i Prilozhen. No. 4 (1987), 58–70; translation in J. Soviet Math. 49 (1990), no. 2, 891–899  ",
    "[66] Gol’dberg, A. A.; Grinˇstein, V. A. The logarithmic derivative of a meromorphic function. (Russian) Mat. Zametki 19 (1976), no. 4, 525–530.  ",
    "[67] Gol’dberg, A. A.; Levin, B. Ya.; Ostrovskii, I. V. Entire and meromorphic functions. Complex analysis, I, 1–193, 254–261, Encyclopaedia Math. Sci., 85, Springer, Berlin, 1997.  ",
    "[68] Govorov, N. V. Riemann’s boundary problem with inﬁnite index. Edited and with an introduction and an appendix by I. V. Ostrovski˘ı. Translated from the 1986 Russian original by Yu. I. Lyubarski˘ı. Birkhuser Verlag, Basel, 1994. xii+252 pp.  ",
    "[69] Gundersen, Gary G.; Hayman, Walter K. The strength of Cartan’s version of Nevanlinna theory. Bull. London Math. Soc. 36 (2004), no. 4, 433– 454.  ",
    "[70] Hayman ",
    "[1] in the old list.  ",
    "[71] Hayman, W. K. Picard values of meromorphic functions and their derivatives, Ann. of Math. 70 (1959), 9-42.  25  ",
    "[72] Hayman, W. K. On the Valiron deﬁciencies of integral functions of inﬁnite order. Ark. Mat. 10, 163–172. (1972).  ",
    "[73] Hayman, W. K. The minimum modulus of integral functions of order one, J. Analyse Math., 28 (1975), 171–212.  ",
    "[74] Hayman, W. K. On Iversen’s theorem for meromorphic functions with few poles. Acta Math. 141 (1978), no. 1-2, 115–145.  ",
    "[75] Hayman, W. K. An approximation theorem with applications to Iversen’s theorem. Aspects of contemporary complex analysis (Proc. NATO Adv. Study Inst., Univ. Durham, Durham, 1979), pp. 209–223, Academic Press, London-New York, 1980.  ",
    "[76] Hayman, W. K. On a meromorphic function having few poles but not tending to inﬁnity along a path. Ann. Polon. Math. 39 (1981), 83–91.  ",
    "[77] Hayman, Walter. Warings Problem f¨ur analytische Funktionen. Bayer. Akad. Wiss. Math.-Natur. Kl. Sitzungsber. 1984, 1–13 (1985).  ",
    "[78] Hayman, W. K.; Kjellberg, B. On the minimum of a subharmonic function on a connected set. Studies in pure mathematics, 291–322, Birkhuser, Basel, 1983.  ",
    "[79] Hayman, W. K. Subharmonic functions. Vol. 2. London Mathematical Society Monographs, 20. Academic Press, Inc. [Harcourt Brace Jovanovich, Publishers], London, 1989.  ",
    "[80] Hayman, W. K. Nevanlinna theory 1945–1995. XVIth Rolf Nevanlinna Colloquium, Eds.: Laine/Martio, Walter de Gryuyter and Co., Berlin, New York, 1996.  ",
    "[81] Hennekemper, W. ¨Uber die Werteverteilung von (f k+1)(k), Math. Z. 177 (1981), 375-380.  ",
    "[82] Hinchliﬀe, J.D. On a result of Chuang related to Hayman’s alternative, Comput. Methods Funct. Thy. 1 (2002), 293-297.  ",
    "[83] Hinchliﬀe, J.D. The Bergweiler-Eremenko theorem for ﬁnite lower order, Result. Math. 43 (2003), 121-128.  26  ",
    "[84] Ishizaki, K. Some remarks on results of Mues about deﬁciency sums of derivatives, Arch. Math. (Basel) 55 (1990), 374-379.  ",
    "[85] Hinkkanen, A. A sharp form of Nevanlinna’s second fundamental theorem. Invent. Math. 108 (1992), no. 3, 549–574.  ",
    "[86] Hinkkanen, A. Iteration and the zeros of the second derivative of a meromorphic function. Proc. London Math. Soc.  65 (1992), no. 3, 629–650  ",
    "[87] Hinkkanen, A. Reality of zeros of derivatives of meromorphic functions. Ann. Acad. Sci. Fenn. Math. 22 (1997), no. 1, 21–38  ",
    "[88] Hinkkanen, A. Zeros of derivatives of strictly non-real meromorphic functions. Ann. Acad. Sci. Fenn. Math. 22 (1997), no. 1, 39–74.  ",
    "[89] Hinkkanen, A. Iteration, level sets, and zeros of derivatives of meromorphic functions. Ann. Acad. Sci. Fenn. Math. 23 (1998), no. 2, 317–388  ",
    "[90] Hinkkanen, A. Zeros of derivatives of meromorphic functions with one pole. Complex Variables Theory Appl. 37 (1998), no. 1-4, 279–369.  ",
    "[91] Hellerstein, Simon; Shea, Daniel F. Minimal deﬁciencies for entire functions with radially distributed zeros. Proc. London Math. Soc.  37 (1978), no. 1, 35–55.  ",
    "[92] Hellerstein, Simon; Williamson, Jack. Derivatives of entire functions and a question of P´olya. Trans. Amer. Math. Soc. 227 (1977), 227–249  ",
    "[93] Hellerstein, Simon; Williamson, Jack. Derivatives of entire functions and a question of P´olya. II. Trans. Amer. Math. Soc. 234 (1977), no. 2, 497–503.  ",
    "[94] Hellerstein, Simon; Williamson, Jack. Entire functions with negative zeros and a problem of R. Nevanlinna. J. Analyse Math. 22 1969 233–267.  ",
    "[95] Hellerstein, Simon; Shen, Li Chien; Williamson, Jack. Reality of the zeros of an entire function and its derivatives. Trans. Amer. Math. Soc. 275 (1983), no. 1, 319–331.  ",
    "[96] Hyllengren, Anders. Valiron deﬁcient values for meromorphic functions in the plane. Acta Math. 124 1970 1–8.  27  ",
    "[97] Khabibullin, B. N. Growth of entire functions with prescribed zeros and representation of meromorphic functions. (Russian. ) Mat. Zametki 73 (2003), no. 1, 120–134; translation in Math. Notes 73 (2003), no. 1-2, 110–124  ",
    "[98] Khabibullin, B. N. The representation of a meromorphic function as the quotient of entire functions and Paley problem in C n: survey of some results. Mat. Fiz. Anal. Geom. 9 (2002), no. 2, 146–167.  ",
    "[99] Kondratyuk, A. A. Fourier series and meromorphic functions, L’viv, Vyshcha shkola, 1988.  ",
    "[100] Lang, Serge. Introduction to complex hyperbolic spaces. SpringerVerlag, New York, 1987.  ",
    "[101] Lang, Serge. Number theory. III. Diophantine geometry. Encyclopaedia of Mathematical Sciences, 60. Springer-Verlag, Berlin, 1991. xiv+296 pp.  ",
    "[102] Langley, J.K. On Hayman’s alternative, Mathematika 32 (1985), 139146.  ",
    "[103] Langley, J.K. Proof of a conjecture of Hayman concerning f and f ′′. J. London Math. Soc.  48 (1993), no. 3, 500–514.  ",
    "[104] Langley, J.K. On second order linear diﬀerential polynomials, Result. Math. 26 (1994), 51-82.  ",
    "[105] Langley, J.K. A lower bound for the number of zeros of a meromorphic function and its second derivative, Proc. Edinburgh Math. Soc. 39 (1996), 171-185.  ",
    "[106] Langley, J.K. The second derivative of a meromorphic function of ﬁnite order, Bulletin London Math. Soc. 35 (2003), 97-108.  ",
    "[107] Langley, J. K. The zeros of ff ′′ − b. Results Math. 44 (2003), no. 1-2, 130–140.  ",
    "[108] Langley, J. K. Critical values of slowly growing meromorphic functions, Comput. Methods Funct. Theory. 2 (2002), 539-547.  ",
    "[109] Langley, J. K. Nonreal zeros of higher derivatives of real entire functions of inﬁnite order, J. d’Analyse 97 (2005), 357-396.  28  ",
    "[110] Levin B. Ja. and Ostrovskii, I. V. The dependence of the growth of an entire function on the distribution of zeros of its derivatives. Sibirsk. Mat. Zh. 1 (1960) 427–455. English transl., AMS Transl.  32 (1963) 323–357.  ",
    "[111] Lewis, John L.; Wu, Jang-Mei. On conjectures of Arakelyan and Littlewood. J. Analyse Math. 50 (1988), 259–283.  ",
    "[112] Marchenko, I. I.; Shcherba, A. I. On the magnitudes of deviations of meromorphic functions. (Russian) Mat. Sb. 181 (1990), no. 1, 3–24; translation in Math. USSR-Sb. 69 (1991), no. 1, 1–24  ",
    "[113] Merenkov, S. Rapidly growing entire functions with three singular values, preprint, http://www.math.lsa.umich.edu∼merenkov/entire1.pdf  ",
    "[114] Miles, Joseph. Quotient representations of meromorphic functions. J. Analyse Math. 25 (1972), 371–388.  ",
    "[115] Miles, Joseph. On entire functions of inﬁnite order with radially distributed zeros. Paciﬁc J. Math. 81 (1979), no. 1, 131–157.  ",
    "[116] Miles, Joseph. Some examples of the dependence of the Nevanlinna deﬁciency upon the choice of origin. Proc. London Math. Soc.  47 (1983), no. 1, 145–176.  ",
    "[117] Miles, Joseph. On the growth of meromorphic functions with radially distributed zeros and poles. Paciﬁc J. Math. 122 (1986), no. 1, 147–167.  ",
    "[118] Miles, Joseph. A sharp form of the lemma on the logarithmic derivative. J. London Math. Soc.  45 (1992), no. 2, 243–254.  ",
    "[119] Miles, Joseph; Shea, Daniel F. An extremal problem in valuedistribution theory. Quart. J. Math. Oxford Ser.  24 (1973), 377–383.  ",
    "[120] Miles, Joseph; Shea, Daniel F. On the growth of meromorphic functions having at least one deﬁcient value. Duke Math. J. 43 (1976), no. 1, 171–186.  ",
    "[121] Mohonko A. Z. Characteristics of certain meromorphic functions. (Russian) Teor. Funkci˘ı Funkcional. Anal. i Priloˇzen. No. 14 (1971), 83–87.  ",
    "[122] Mues, E. ¨Uber eine Defektund Verzweigungsrelation f¨ur die Ableitung meromorpher Funktionen, Manuscripta Math. 5 (1971), 275-297.  29  ",
    "[123] Mues, E. ¨Uber die Nullstellen homogener Diﬀerentialpolynome, Manuscripta Math. 23 (1978), 325-341.  ",
    "[124] Mues, E. ¨Uber ein Problem von Hayman, Math. Z. 164 (1979), 239-259.  ",
    "[125] Mues E. and Steinmetz, N. The theorem of Tumura-Clunie for meromorphic functions, J. London Math. Soc.  23 (1981), 113-122.  ",
    "[126] Narasimhan, Raghavan. Un analogue holomorphe du th´eor`eme de Lindemann. Ann. Inst. Fourier 21 (1971), no. 3, 271–278.  ",
    "[127] F. Nevanlinna (see the old ref list).  ",
    "[128] Nevo, S., Pang, X. and Zalcman, L. Picard-Hayman behavior of derivatives of meromorphic functions with multiple zeros, Electron. Res. Announc. Amer. Math. Soc. 12 (2006), 37-43.  ",
    "[129] Osgood, Charles F. A number theoretic-diﬀerential equations approach to generalizing Nevanlinna theory. Indian J. Math. 23 (1981), no. 1-3, 1–15.  ",
    "[130] Osgood, Charles F. Sometimes eﬀective Thue-Siegel-Roth-SchmidtNevanlinna bounds, or better. J. Number Theory 21 (1985), no. 3, 347–389.  ",
    "[131] Osgood, Charles F. Simpliﬁed proofs of generalizations of the n-small function theorem. Analysis of one complex variable (Laramie, Wyo., 1985), 158–174, World Sci. Publishing, Singapore, 1987.  ",
    "[132] Pang Xuecheng, Bloch’s principle and normal criterion, Sci. China Ser. A 32 (1989), 782-791.  ",
    "[133] Pang Xuecheng, On normal criterion of meromorphic functions, Sci. China Ser. A  (1990), 521-527.  ",
    "[134] Petrenko, V. P. Growth of meromorphic functions (Russian) Izdat. pri Harkov. Gos. Univ. Izdat. Ob’ed. “Vyshcha shkola”, Kharkov, 1978.  ",
    "[135] P´olya, G. ¨Uber die Nullstellen sukzessiver Derivierten, Math. Z. 12 (1922), 36-60.  ",
    "[136] Qiao, Jianyong. Two problems in the value distribution theory. Acta Math. Sinica 11 (1995), 4, 365–371.  30  ",
    "[137] Ru, Min. Nevanlinna theory and its relation to Diophantine approximation. World Scientiﬁc Publishing Co., Inc., River Edge, NJ, 2001.  ",
    "[138] Rubel, Lee A. Entire and meromorphic functions. Springer-Verlag, New York, 1996.  ",
    "[139] Sauer, Andreas. Deﬁcient rational functions and Ahlfors’s theory of covering surfaces. Ark. Mat. 39 (2001), no. 1, 151–155.  ",
    "[140] Saxer, W. Sur les valeurs exceptionelles des d´eriv´ees successives des fonctions m´eromorphes, C.R. Acad. Sci. Paris 182 (1926), 831-3.  ",
    "[141] Saxer, W. ¨Uber die Picardschen Ausnahmewerte successiver Derivierten, Math. Z. 17 (1928), 206-227.  ",
    "[142] Shea, Daniel F. On the set where a meromorphic function is large. Complex analysis and its applications (Hong Kong, 1993), 95–106, Pitman Res. Notes Math. Ser., 305, Longman Sci. Tech., Harlow, 1994.  ",
    "[143] Shea, D.F. and Sons, L.R. Value distribution theory for meromorphic functions of slow growth in the disk, Houston Math. J. 12 (1986), 249-266.  ",
    "[144] Sheil-Small, T. On the zeros of the derivatives of real entire functions and Wiman’s conjecture. Ann. of Math.  129 (1989), no. 1, 179–193.  ",
    "[145] Sons, L.R. Value distribution for unbounded functions in the unit disc, Complex Var. Theory Appl. 7 (1987), 337-431.  ",
    "[146] Steinmetz, N. ¨Uber die Nullstellen von Diﬀerentialpolynomen, Math. Z. 176 (1981), 255-264.  ",
    "[147] Steinmetz, N. Eine Verallgemeinerung des zweiten Nevanlinnaschen Hauptsatzes, J. f¨ur die reine u. angewandte Mathematik 368 (1986), 134141.  ",
    "[148] Steinmetz, N. On the zeros of (f (p) + ap−1f (p−1) + . . .+ a0f)f, Analysis 7 (1987), 375-389.  ",
    "[149] Steinmetz, N. On the zeros of a certain Wronskian, Bull. London Math. Soc. 20 (1988), 525-531.  31  ",
    "[150] Ter-Israeljan, L. A. A meromorphic function of zero order with a nonasymptotic defect value. (Russian) Mat. Zametki 13 (1973), 195–206. English translation: Math. Notes 13 (1973), 116–123.  ",
    "[151] Tohge, K. Logarithmic derivatives of meromorphic or algebroid solutions of some homogeneous linear diﬀerential equation, Analysis (Munich) 19 (1999), 273-297.  ",
    "[152] Tumura, Y. On the extensions of Borel’s theorem and Saxer-Csillag’s theorem, Proc. Phys. Math. Soc. Japan  19 (1937), 29-35.  ",
    "[153] Vojta, Paul. Diophantine approximations and value distribution theory. Lecture Notes in Mathematics, 1239. Springer-Verlag, Berlin, 1987.  ",
    "[154] Wang, Y.F. On Mues’ conjecture and Picard values, Sci. China Ser. A 36 (1993), 28-35.  ",
    "[155] Wang Y.F. and Fang, M. Picard values and normal families of meromorphic functions with multiple zeros, Acta Math. Sinica New Ser. 14 (1998), 17-26.  ",
    "[156] Wang, Y.F., Yang, C.C. Yang, L. On the zeros of (f (k))nf − a, Kexue Tongbao 38 (1993), 2215-2218.  ",
    "[157] Weitsman, Allen. A theorem on Nevanlinna deﬁciencies. Acta Math. 128 (1972), no. 1-2, 41–52.  ",
    "[158] Weitsman, Allen. Meromorphic functions with maximal deﬁciency sum and a conjecture of F. Nevanlinna. Acta Math. 123 1969 115–139.  ",
    "[159] Yamanoi, Katsutoshi. Defect relation for rational functions as targets. With errata by the author. Forum Math. 17 (2005), no. 2, 169–189.  ",
    "[160] Yamanoi, Katsutoshi. The second main theorem for small functions and related problems. Acta Math. 192 (2004), no. 2, 225–294.  ",
    "[161] Yang, L. Precise estimate of total deﬁciency of meromorphic derivatives, J. d’Analyse Math. 55 (1990), 287-296.  ",
    "[162] Yang, Lo. Value distribution theory. Translated and revised from the 1982 Chinese original. Springer-Verlag, Berlin; Science Press, Beijing, 1993.  32  ",
    "[163] Zalcman, L. Normal families: new perspectives, Bull. Amer. Math. Soc. (N.S.) 35 (1998), 215-230.  ",
    "[164] Zhang Z.-L. and Li, W. Tumura-Clunie’s theorem for diﬀerential polynomials, Complex Variables 25 (1994), 97-105.  A. E.: Purdue University West Lafayette, IN 47907 USA  J. K. L.: University of Nottingham, NG 7 2RD U. K.  33 "
  ],
  "reference_content": [
    {
      "reference_num": "[1]",
      "reference_title": "The Size of the Set on Which a Meromorphic Function is Large",
      "reference_abstract": ""
    },
    {
      "reference_num": "[2]",
      "reference_title": "Proof of Edrei’s spread conjecture",
      "reference_abstract": ""
    },
    {
      "reference_num": "[5]",
      "reference_title": "Regularity theorems associated with the spread relation",
      "reference_abstract": ""
    },
    {
      "reference_num": "[6]",
      "reference_title": "The Growth of Plane Harmonic Functions Along an Asymptotic Path",
      "reference_abstract": "Proceedings of the London Mathematical SocietyVolume s3-37, Issue 2 p. 363-384 Articles The Growth of Plane Harmonic Functions Along an Asymptotic Path K. F. Barth, K. F. Barth Syracuse University, Syracuse, N. Y., 13210Search for more papers by this authorD. A. Brannan, D. A. Brannan Queen Elizabeth College, Camden Hill, London, W8 7AHSearch for more papers by this authorW. K. Hayman, W. K. Hayman Imperial College, Queens Gate, London, SW7 2AZSearch for more papers by this author K. F. Barth, K. F. Barth Syracuse University, Syracuse, N. Y., 13210Search for more papers by this authorD. A. Brannan, D. A. Brannan Queen Elizabeth College, Camden Hill, London, W8 7AHSearch for more papers by this authorW. K. Hayman, W. K. Hayman Imperial College, Queens Gate, London, SW7 2AZSearch for more papers by this author First published: September 1978 https://doi.org/10.1112/plms/s3-37.2.363Citations: 6AboutPDF ToolsRequest permissionExport citationAdd to favoritesTrack citation ShareShare Give accessShare full text accessShare full-text accessPlease review our Terms and Conditions of Use and check box below to share full-text version of article.I have read and accept the Wiley Online Library Terms and Conditions of UseShareable LinkUse the link below to share a full-text version of this article with your friends and colleagues. Learn more.Copy URL Share a linkShare onFacebookTwitterLinkedInRedditWechat Citing Literature Volumes3-37, Issue2September 1978Pages 363-384 RelatedInformation"
    },
    {
      "reference_num": "[7]",
      "reference_title": "Iteration of meromorphic functions",
      "reference_abstract": "This paper attempts to describe some of the results obtained in the iteration theory of transcendental meromorphic functions, not excluding the case of entire functions. The reader is not expected to be familiar with the iteration theory of rational functions. On the other hand, some aspects where the transcendental case is analogous to the rational case are treated rather briefly here. For example, we introduce the different types of components of the Fatou set that occur in the iteration of rational functions but omit a detailed description of these types. Instead, we concentrate on the types of components that are special to transcendental functions (Baker domains and wandering domains)."
    },
    {
      "reference_num": "[8]",
      "reference_title": "On the zeros of certain homogeneous differential polynomials",
      "reference_abstract": ""
    },
    {
      "reference_num": "[9]",
      "reference_title": "Normality and exceptional values of derivatives",
      "reference_abstract": "We show that a family $\\mathcal {F}$ of functions meromorphic in some domain is normal, if for all $f\\in \\mathcal {F}$ the derivative $fâ$ omits the value $1$ and if the values that $fâ$ can take at the zeros of $f$ satisfy certain restrictions. As an application we obtain a new proof of a theorem of Langley which classifies the functions $f$ meromorphic in the plane such that $f$ and $f''$ have no zeros."
    },
    {
      "reference_num": "[10]",
      "reference_title": "On the growth of meromorphic functions of infinite order",
      "reference_abstract": ""
    },
    {
      "reference_num": "[11]",
      "reference_title": "On the singularities of the inverse to a meromorphic function of finite order",
      "reference_abstract": "We give several applications of this theorem. For example we prove that if $f$ is a transcendental meromorphic function then $f'f^n$ with $n≥1$ takes every finite non-zero value infinitely often. This proves a conjecture of Hayman. The proof makes use of the iteration theory of meromorphic functions."
    },
    {
      "reference_num": "[13]",
      "reference_title": "Real entire functions of infinite order and a conjecture of Wiman",
      "reference_abstract": "We prove that if f is a real entire function of infinite order, then ff’’ has infinitely many non-real zeros. In conjunction with the result of Sheil-Small for functions of finite order this implies that if f is a real entire function such that ff’’ has only real zeros, then f is in the Laguerre-Pólya class, the closure of the set of real polynomials with real zeros. This result completes a long line of development originating from a conjecture of Wiman of 1911."
    },
    {
      "reference_num": "[15]",
      "reference_title": "PROOF OF A CONJECTURE OF FRANK AND LANGLEY CONCERNING ZEROS OF MEROMORPHIC FUNCTIONS AND LINEAR DIFFERENTIAL POLYNOMIALS",
      "reference_abstract": ""
    },
    {
      "reference_num": "[16]",
      "reference_title": "ASYMPTOTIC VALUES OF ENTIRE AND MEROMORPHIC FUNCTIONS",
      "reference_abstract": ""
    },
    {
      "reference_num": "[18]",
      "reference_title": "Nevanlinna’s Theory of Value Distribution: The Second Main Theorem and its Error Terms",
      "reference_abstract": "1. The First Main Theorem.- 2. The Second Main Theorem via Negative Curvature.- 3. Logarithmic Derivatives.- 4. The Second Main Theorem via Logarithmic Derivatives.- 5. Some Applications.- 6. A Further Digression into Number Theory: Theorems of Roth and Khinchin.- 7. More on the Error Term.- Glossary of Notation."
    }
  ]
}