{
  "title": "A on the interplay between arithmetic mean ideals, traces, lattices of operator ideals, and an infinite Schur-Horn majorization theorem",
  "article_id": "arXiv:0707.3271",
  "subject": [
    "Functional Analysis",
    "Operator Algebras"
  ],
  "abstract": "The work of Dykema, Figiel, Weiss, and Wodzicki on the structure of commutators showed that arithmetic means play an important role in the study of operator ideals, and we explored their role in a multipaper project which we survey in this article. We start by presenting the notions of arithmetic mean ideals and arithmetic mean at infinity ideals. Then we explore their connections with commutator spaces, traces, elementary operators, lattice and sublattice structure of ideals, arithmetic mean ideal cancellation properties of first and second order, and softness properties - a term that we introduced but a notion ubiquitous in the literature on operator ideals. Arithmetic mean closure of ideals leads us to investigate majorization for infinite sequences and this in turn leads us to an infinite Schur-Horn majorization theorem which extends theorems by A. Neumann, by Arveson and Kadison, and by Antezana, Massey, Ruiz and Stojanoff. We also list ten open questions that we encountered in the development of this material.",
  "content": "1. Introduction \nCommutator spaces (also known as commutator ideals) of operator ideals were charac-\nterized in [24] in terms of arithmetic mean operations and this led already in [24] to the\nnotion of two basic arithmetic mean ideals, the arithmetic mean closure and the arithmetic\nmean interior of an ideal, and to the notion of arithmetically mean stable ideals - those\nthat coincide with their commutator space and hence support no nonzero trace. Thus arith-\nmetic mean ideals have become an intrinsic part of the theory of operator ideals. To explore\ntheir structure and to ﬁnd how they relate to the existing theory of operator ideals and in\nparticular, how they contribute to it, was the goal of our program.\n\nThe ﬁrst results of this work were announced in PNAS-US [33] and then expanded and\n\ndeveloped in a series of papers [34]-[38].\n\nOur beginning question, explored in [34], was to ask “how many traces can a given ideal\nsupport.” To address it, we found that we ﬁrst needed both to investigate much more sys-\ntematically the structure of arithmetic mean ideals and to introduce formally the notion of\n“soft ideals.”\n\nFrom the start we discovered that, to study the two basic arithmetic mean ideals, we\nhad to expand our investigations by adding to the menagerie the smallest am-open ideal\n\nDate: April 3, 2007.\n1991 Mathematics Subject Classiﬁcation. Primary: 47B47, 47B10, 47L20, 15A51; Secondary: 46A45,\n\n46B45.\n\nKey words and phrases. operator ideals, arithmetic means, regular sequences, commutator spaces, com-\n\nmutator ideals, traces, lattices, cancellation, majorization, Schur-Horn Theorem.\n\n1\n\n \n \n \n \n \n \n\n2\n\nVICTOR KAFTAL AND GARY WEISS\n\ncontaining an ideal and the largest am-closed ideal contained by it. The latter, for instance,\nprovided a useful tool for the study of countably generated am-stable ideals.\n\n∞\n∞\n\nThe arithmetic mean is too crude for distinguishing ideals contained in the trace class L1:\nfor them what is required is the arithmetic mean at inﬁnity. The arithmetic mean at inﬁnity\n(am-\nfor short) has substantially diﬀerent properties from the arithmetic mean, e.g., the\nof a sequence can fail to satisfy the ∆1/2-condition whereas an important feature of\nam-\nthe arithmetic mean of a sequence is that it always satisﬁes this condition. The ensuing\ntheory of am-\nideals is considerably more complicated, but in large measure mirrors the\narithmetic mean case. This material is presented in Section 2 and was developed in [34] and\n[35].\n\n∞\n\nIn Section 3 we present “soft ideals” which are ubiquitous in the literature on operator\nideals and which we studied systematically in [35]. We show that many of the classical\nideals are soft and that keeping this in mind can add perspective and simplify the proofs\nof a number of results in the literature. Our interest in the notion of softness arose from\nthe interplay between softness properties and arithmetic mean operations, which provided\nthe main tool for our work on traces. We explore in this section this interplay and present\nseveral open questions.\n\nSection 5.2 is devoted to traces and based is on [34]. The question ”how many traces can\na given ideal support” asks about the codimension of the commutator space [I, B(H)] of an\nideal I. We were led by our work in [34] to the conjecture that\n\nI\n\ndim\n\n{\n[I, B(H)] ∈ (\n{\n\n1,\n0,\n\n∞}\n∞}\n\nwhen ω /\n∈\nwhen ω\n∈\n\nΣ(I)\nΣ(I)\n\n2, 1\nwhere ω := < 1, 1\n3,\n· · ·\nIn the case when ω /\n∞\n∈\nstable. In the process, we obtain results that can be applied to solve questions on elementary\noperators.\n\n> is the harmonic sequence and Σ(I) is the characteristic set of I.\n\nΣ(I), we show that the codimension is 1 precisely when I is am-\n\nAll ideals divide naturally into the classes:\n\n“small ideals,” (those contained in the lower stabilizer at inﬁnity of the principal ideal\n(ω), sta∞(ω), i.e., the ideal with characteristic set\n{\n“large ideals” (those that contain the upper stabilizer sta(ω) :=\ndirected union of the principal ideals (ω logm)) and\n“intermediate ideals” (all the remaining ideals)\n\n),\n∞}\nm=0(ω logm), a\n\nξnlogmn <\n\nc∗\no |\n\nP\n\nS\n\n∈\n\n∞\n\nξ\n\n•\n\n•\n\n•\n\nFor all intermediate ideals, the codimension of the commutator space is always inﬁnite. Then\nwe show that the above codimension conjecture holds for all soft ideals and present other\nsuﬃcient conditions for the codimension of the commutator space to be inﬁnite.\n\nSection 5 is based on [36], a study of the lattice structure of operator ideals focusing\nin particular on some distinguished sublattices of principal ideals. We investigate density\nproperties, i.e., when between two ideals each in one of two nested lattices lies another from\nthe smaller lattice. These properties are powerful tools for dealing with general ideals. We\nalso study representations of ideals as directed unions of countably generated ideals and of\nprincipal ideals.\n\nWe apply then some of these tools to problems on arithmetic mean “equality cancella-\nJ = I? And “inclusion cancellations”: when for\nI? The most interesting case is the\nIa ⇒\n\ntions”: when for an ideal I does Ja = Ia ⇒\nI or Ja ⊃\nan ideal I does Ja ⊂\n\nIa ⇒\n\n⊃\n\n⊂\n\nJ\n\nJ\n\n\nARITHMETIC MEAN IDEALS\n\n3\n\nb\n\nlatter and the answer is when I =\nwe show that\n1\np −\n\n1\np′ = 1. We show that the condition (ξ) =\n\nI. For I principal and not contained in the trace class\n) where\n\n(ωp) = (ωp′\n(ξ) is strictly stronger than regularity.\n\nI is principal as well and we prove that for for 0 < p < 1,\n\nSecond order cancellation properties are considerably diﬀerent and harder than ﬁrst order\nc\nJa = Ia does not hold\ncancellation properties. We found that the cancellation Ia2 = Ja2\nin general even if I and J are principal ideals, thus answering a question by M. Wodzicki.\nSuﬃcient conditions for this and for the two second order inclusion cancellations to hold are\ngiven in Section 6 in terms of the ”ratio of regularity,” r(ξa) := ξa2\n, where ξ is the generator\nξa\nof I. This material was developed in [37].\n\nd\n\n⇒\n\nb\n\nFinally, Section 7 focuses on majorization theory for inﬁnite sequences. The link with\noperator ideals is that the deﬁnition of am-closure of an ideal can be restated in terms of\nhereditariness (i.e., solidity) with respect to majorization. Our initial goal was to prove that\nam-closure for an ideal is equivalent to diagonal invariance, i.e., the property that for any\nﬁxed orthonormal basis, if an operator A belongs to the ideal then its main diagonal, E(A),\nalso belongs to the ideal. To prove this equivalence, we introduced the notions of block ma-\njorization and strong majorization of sequences and these, in turn, provided the tools and\nthe stimulus for proving an inﬁnite Schur-Horn majorization theorem (Theorem 7.12). The\nkey part of this theorem is that if ξ and η are monotone sequences decreasing to 0 and ξ is\nn\nj=1 ηj for every n is necessary and suﬃcient\nnot summable, then the condition\nfor diag ξ = E(U diag ηU ∗) for some unitary operator U. The material of Section 7 is based\nP\non [38] which is not yet in ﬁnal form but we expect it to be available by the time this survey\nis published.\n\nj=1 ξj ≤\n\nP\n\nn\n\nNo proofs are presented in this survey and many of the basic facts are stated without\nexplicit reference, but both proofs and further background information can be found easily\nin the respective citations.\n\nWe include herein ten questions that arose in this project. 2. Commutators, traces and arithmetic mean ideals \nThe natural domain of the usual trace T r on B(H) (with H a separable inﬁnite-dimensional\ncomplex Hilbert space) is the trace class ideal L1, but ideals of B(H) can support other traces.\nDeﬁnition 2.1. A trace τ on an ideal I is a unitarily invariant linear functional on I.\n\nIn this paper, traces are neither assumed to be positive nor faithful. (We refer the reader\nto [56] and the more recent [64] for results on positive traces.) All ideals are assumed to be\nproper and two-sided. All proper ideals contain the ﬁnite rank ideal F and the restriction of\nany trace to F is a scalar multiple cT r of the standard trace T r. Singular traces are those\nfor which c = 0 and nonsingular traces are those for which c\n\n= 0.\n\nRecall that commutators are operators [X, Y ] := XY\n\nY X and that [I, B(H)] denoting\nthe commutator space (also known as the commutator ideal ) of I and B(H) is deﬁned as the\nlinear span of commutators, XY\nY X, of operators X in I with operators Y in B(H) (and\nlikewise for [I, J]).\nSince UXU ∗\n\nI and every unitary\noperator U and since unitary operators span B(H), unitarily invariant linear functionals on\nan ideal I are precisely the linear functionals on I that vanish on [I, B(H)]. Thus traces can\n\n[I, B(H)] for every X\n\nX = [U, XU ∗\n\nU ∗X]\n\n−\n\n−\n\n−\n\n−\n\n∈\n\n∈\n\n6\n\n4\n\nVICTOR KAFTAL AND GARY WEISS\n\n[I,B(H)] , which is why\nbe identiﬁed with the elements of the linear dual of the quotient space\ncommutator spaces play such a central role in the study of traces. The structure of general\n[I, J] had been studied for several decades [30], [13], [50], [3], [58]-[61] and [40] (see also [62]\nfor other historical references). The introduction of cyclic cohomology in the early 1980’s\nby A. Connes and its linkage to algebraic K-theory by M. Wodzicki in the 1990’s provided\nadditional motivation for the complete determination of commutator ideal structure. (Cf.\n[18]-[20] and [63].)\n\nI\n\nClearly the commutator spaces of ideals are selfadjoint linear spaces and hence can be\ncharacterized via their selfadjoint elements and those (and more generally the normal oper-\nators in a commutator space) were characterized in [24] in terms of arithmetic means. An\nimportant feature is that membership in commutator spaces (noncommutative objects) is\nreduced to certain conditions on associated sequences and their arithmetic means (commu-\ntative objects).\n\nArithmetic means ﬁrst entered the analysis of [L2, L2] and [L1, B(H)] for a special case in\n[58] and [59] and for its full characterization in [40]. As the main result in [24] (Theorem 5.6)\nconclusively shows, arithmetic means are essential for the study of traces and commutator\nspaces in operator ideals.\n[24] also initiated a systematic study of ideals derived via the\narithmetic mean operations and in [33]-[37] we continued this study along with the arith-\nmetic mean at inﬁnity operations and the consequent parallel theory described below.\n\n∈\n\nWhen X\n\nK(H) (the ideal of compact operators on H), denote an ordered spectral\n>, i.e., a sequence of all the eigenvalues of\nsequence for X by λ(X) := < λ(X)1, λ(X)2,\n· · ·\nX (if any), repeated according to algebraic multiplicity, completed by adding inﬁnitely many\nzeroes when only ﬁnitely many eigenvalues are nonzero, and arranged in any order so that\nis nonincreasing. For any sequence λ = < λn >, denote by λa, λa∞ the sequences of\nλ(X)\n|\nits arithmetic (Cesaro) mean and arithmetic mean at inﬁnity, i.e.,\n\n|\n\nλa :=\n\n1\nn\n\n*\n\nn\n\n∞\n\nλj\n\n+\n\nn=1\n\nj=1\nX\n\n, and when λ\n\nℓ1,\n\n∈\n\nλa∞ :=\n\n1\nn\n\n*\n\n∞\n\n∞\n\nλj\n\n.\n\n+\n\nn=1\n\nj=n+1\nX\n\nA constant theme in the theory of operator ideals is its connection to the theory of sequence\nspaces. Calkin [15] established a correspondence between the two-sided ideals of B(H) and\nthe characteristic sets, i.e., the positive cones of c∗\no (the collection of sequences decreasing to\n0) that are hereditary (solid under pointwise order) and invariant under ampliations\n\nc∗\no ∋\n\nξ\n\n→\n\nDmξ := < ξ1, . . . , ξ1, ξ2, . . . , ξ2, ξ3, . . . , ξ3,\n\n>\n\n· · ·\n\n→\n\nwhere each entry ξi of ξ is repeated m-times. The order-preserving lattice isomorphism\nX\nI\nwhere s(X)\nΣ(I) maps each ideal to its characteristic set Σ(I) :=\n= (X ∗X)1/2 repeated\ndenotes the sequence of s-numbers of X, i.e., all the eigenvalues of\naccording to multiplicity, arranged in decreasing order, and completed by adding inﬁnitely\nc∗\no, if I is the\nmany zeroes if X has ﬁnite rank. Conversely, for every characteristic set Σ\nwhere diag ξ is the diagonal matrix with entries ξ1, ξ2, . . . ,\nideal generated by\nthen we have Σ = Σ(I).\n\ns(X)\nX\n\ndiag ξ\n\nΣ\n}\n\n⊂\n\n∈\n\n∈\n\n|\n|\n\n{\n\n{\n\n}\n\nI\n\nξ\n\n|\n\n|\n\nFor ideals I, J, the ideals I + J, IJ = JI and I : J are, respectively, the ideal of sums\nof operators from I and J, the ideal generated by all products of operators from I and J\n(single products will do [24, Lemma 6.3]), and the ideal of all operators whose products with\n\n\nARITHMETIC MEAN IDEALS\n\n5\n\nall operators in J are in I. In terms of characteristic sets,\n\nΣ(I + J) = Σ(I) + Σ(J)\n\n(from s2n+1(A + B)\n\nsn(A) + sn(B) [29]),\n\n≤\n\nΣ(IJ) =\n\nξ\n\n{\n\n∈\n\nc∗\no |\n\nξ\n\n≤\n\nηζ for some η\n\nΣ(I), ζ\n\nΣ(J)\n\n}\n\n∈\n\n∈\n\n(hence IJ is a commutative operation), and\n\nΣ(I : J) =\n\nc∗\no |\nA special case of [24, Theorem 5.6] (see also [ibid, Introduction]) characterizing all com-\nmutator ideals [I, J] and yielding the important identity [I, J] = [IJ, B(H)], is the charac-\nterization of the normal elements of the commutator space [I, B(H)]:\n\nξ Σ(J)\n\nΣ(I)\n\n⊂\n\n∈\n\n}\n\n{\n\nξ\n\n.\n\nTheorem 2.2. [24, Theorem 5.6] Let X\n∈\nany ordered spectral sequence λ(X). Then X\nξ\n\nΣ(I).\n\n∈\n\n∈\nTwo important consequences are:\n\nI be a normal operator in a proper ideal I with\nξ for some\n\n[I, B(H)] if and only if\n\nλ(X)a| ≤\n\n|\n\n(i) The introduction in [24] of arithmetic mean ideals to characterize [I, B(H)]+, the positive\npart of [I, B(H)].\n(ii) The standard trace T r extends from F to I if and only if diag ω /\n∈\nsequence ω := < 1, 1\n\nI where the harmonic\n\n>.\n\nThe action of arithmetic means on sequences indeed leads naturally to an action on op-\nerator ideals. The four basic arithmetic mean ideals called respectively the pre-arithmetic\nmean, arithmetic mean, pre-arithmetic mean at inﬁnity, and arithmetic mean at inﬁnity\nof I are aI, Ia, a∞I, Ia∞ (see [24, Section 2.8(v)-(vi)] and [34, Deﬁnition 4.6]), and their\ncharacteristic sets are deﬁned as:\n\n2, 1\n3,\n\n· · ·\n\nΣ(aI) :=\n\nξ\n\n{\n\n∈\n\nc∗\no |\n\nξa ∈\n\nΣ(I)\n\n}\n\nΣ(Ia) :=\n\nΣ(a∞I) :=\n\nξ\n\n{\n\n∈\n\nξ\n\n{\n∈\n(ℓ1)∗\n\n|\n\nΣ(Ia∞) :=\n\nξ\n\nc∗\no |\n\nξ = O(ηa) for some η\n\nc∗\no |\nξa∞ ∈\nξ = O(ηa∞) for some η\n\nΣ(I)\n\n}\n\n(deﬁned only for I\n\n=\n\n0\n\n)\n\n}\n\n{\n\nΣ(I\n\nL1)\n\n.\n\nΣ(I)\n\n}\n\n∈\n\n∈\n\n{\nNotice that in this paper c∗\no and (ℓ1)∗ denote the positive cones of monotone nonincreasing\nsequences in co and (ℓ1)+ and not the duals of those spaces. A special case of the main result\nof [24], Theorem 2.2 above, restricted to positive operators, can be reformulated in terms of\nanalog [34, Corollary 6.2(i)]:\narithmetic mean ideals and another consequence is the am-\n\n∈\n\n∩\n\n}\n\n∞\n\nTheorem 2.3.\n(i) For every proper ideal I: [I, B(H)]+ = (aI)+\n(ii) For every ideal I\n\nL1 (or more generally if ω /\n∈\n\n⊂\n\nΣ(I)): (F + [I, B(H)])+ = (a∞I)+\n\nAn immediate and interesting consequence is that both [I, B(H)]+ and (F + [I, B(H)])+\nB). Later we shall see that so also is (L1 +\n\nare hereditary (solid relative to the order A\n[I, B(H)])+ and ask about general (J + [I, B(H)])+.\n\n≤\n\n6\n\n6\n\nVICTOR KAFTAL AND GARY WEISS\n\n.\n\n2.1. Stability, stability at inﬁnity and stabilizers\nAn important consequence of Theorems 2.2 is that I = [I, B(H)] if and only if I = aI. It is\neasy to show that I = aI if and only if I = Ia. And similarly, though not exactly, for the\nam-\n\ncase:\n\n∞\n\nDeﬁnition 2.4. An ideal I is called arithmetically mean stable (am-stable for short) if and\nonly if I = aI if and only if I = Ia if and only if I = [I, B(H)].\n\nAn ideal I is called arithmetically mean at inﬁnity stable (am-\n∞\nI = Ia∞ if and only if L1 ⊃\n\nonly if I = a∞I if and only if L1 ⊃\nCorollary 4.10 and Theorem 6.6].\n\nstable for short) if and\nI = F + [I, B(H)] [34,\n\nAm-stable ideals are precisely the ideals that do not support any nonzero trace, and over\nthe years a considerable amount of eﬀort has been invested in determining which ideals are\nstable: [30], [29], [58], [59], [61], [2], [4], [5] and [56] listed chronologically. Am-stability for\nmany classical ideals was also studied in [24, Sections 5.11–5.27].\n\n∈\n\n∈\n\nOf particular interest are principal ideals. If A\n\nK(H), let ξ := s(A) be the s-number\nsequence of A, then A and diag ξ generate the same principal ideal, which we will denote by\n(ξ). It is easy to see that (ξ) = (η) if and only if ξ = O(Dmη) and η = O(Dm′ξ) for some\nm, m′\nN. ξ is said to satisfy the ∆1/2-condition condition if D2ξ = O(ξ) (if and only if\nN). If (ξ) = (η) and ξ satisﬁes the ∆1/2-condition condition, then\nDmξ = O(ξ) for every m\nso does η and ξ\nξa are called “regular” and have been studied in\nconnection with principal ideals since Gohberg and Krein [29, p.143 (14.12)]. Reformulated\nin terms of am-stability therefore, a sequence ξ is regular if and only if the principal ideal\n(ξ) is am-stable. Principal ideals that are am-\nstable are characterized in Theorem 2.14\nbelow.\n\nη. Sequences for which ξ\n\n∞\n\n≍\n\n≍\n\n∈\n\nEvery ideal I is contained in the smallest am-stable ideal containing it, which we call the\n∞\nm=0 Iam, and contains a largest (possibly zero) am-stable\n∞\nm=0 amI. It follows that there is\n\nupper am-stabilizer of I, sta(I) :=\nideal which we call the lower am-stabilizer of I, sta(I) :=\nno largest proper am-stable ideal and the smallest nonzero am-stable ideal is\n\nS\n\n∞\n\nT\n\n∞\n\nsta(F ) = sta((ω)) = sta(L1) :=\n\n(ω)am =\n\n(ω logm)\n\n[34, Proposition 4.18].\n\nm=0\n[\n\nm=0\n[\n\nL1\n\n⊃\n\nSimilarly every ideal contains a largest am-\nstablilizer of I, sta∞(I) :=\n∞\ncontained in L1 and hence in\n\n∩\n\n∞\nm=0 am∞(I). Notice that every am-\n\nstable ideal, which we call the lower am-\nstable ideal must be\n\n∞\n\n∞\n\nsta∞(K(H)) = sta∞((ω)) = sta∞(L1) =\n\nm=0 am∞(L1) =\n∩\nwhere L(σ logm) is the Lorentz ideal with characteristic set\n[34, Proposition 4.18]. For ideals I contained in sta∞(L1), the smallest am-\nP\ncontaining I is its upper am-\n\nstabilizer sta∞(I) :=\n\nc∗\no |\n\nL(σ logm)\n\n∞\nm=0\n\n∩\nξ\n\n∈\n\n{\n\n∞\n\n∞\nm=0(Iam∞).\n\n∞\n\nL1,\nξnlogmn <\n\n⊂\n\nThe ideals sta(L1) and sta∞(L1) naturally divide all the ideals into three classes (see [34,\nIntroduction]): the “small ideals,” those contained in sta∞(L1), the “large ideals,” those\ncontaining sta(L1), and the “intermediate ideals,” those that are neither. This provides a\nuseful perspective from which to attack the codimension conjecture for traces (see Section\n4.3).\n\n∞}\nstable ideal\n\n∞\n\n∪\n\n\nARITHMETIC MEAN IDEALS\n\n7\n\nOf special importance in [24] and herein is the principal ideal (ω). Elementary compu-\nif and only if\nΣ(I). An immediate but important consequence of Theorem 2.2 which is used often\n[I, B(H)].\n\ntations show that Fa = (L1)a = (ω) and that a(ω) = L1. Hence aI\nω\nthroughout [34] is that ω\n\n[I, B(H)] if and only if F\n\n=\n\n∈\n\n}\n\n{\n\n0\n\nΣ(I) if and only if L1 ⊂\n\n∈\n\n⊂\n\n2.2. Am-closure and am-interior\n[24] deﬁned for every ideal I two further arithmetic mean ideals, the arithmetic-mean closure\nI − := a(Ia) and the arithmetic mean interior I o := (aI)a which together with the ideals Ia\nand aI we call “ﬁrst order arithmetic mean ideals”. Both the am-closure and am-interior\noperations are idempotent and it is natural to call am-closed (resp., am-open) those ideals\nthat coincide with their am-closure, i.e., I = I − (resp., am-interior, i.e., I = I o). Thus I o is\nthe largest am-open ideal inside I and I − is the smallest am-closed ideal containing I. (We\ndo not mean to imply a full topological structure as, for instance, the union of am-open ideals\ncan even fail to be an ideal.) Many of the classical sequence space ideals in the literature are\nam-closed. Am-closed ideals also play an important role in the study of single commutators\n[24, Section 7]. The smallest am-closed ideal is the trace class L1 and the smallest am-open\nideal is (ω). There are no proper largest am-closed or am-open ideals.\n\nIt is easy to see that an ideal I is am-open (resp., am-closed) if and only if I = Ja (resp.,\n\nI = aJ for some ideal J and that the following “ﬁve chain of inclusions” holds:\n\naI\n\nI o\n\nI\n\n⊂\n\n⊂\n\n⊂\n\nI −\n\n⊂\n\nIa.\n\nIn particular, notice that I contains the am-closed ideal aI and is contained in the am-open\nideal Ia. Several problems we encountered early in the study of am-ideals required us to\nﬁnd an answer to the dual questions: Is there a largest am-closed ideal contained in I, and\nis there a smallest am-open ideal containing I? Both questions have an aﬃrmative answer\nwhich sheds interesting light on the structure of am-ideals.\n\n2.3. Am-closed ideals\nFor the ﬁrst question, a moment’s reﬂection shows that it is equivalent to asking whether\nthe sum of two am-closed ideals is am-closed. To answer it, we needed some tools from\nmajorization theory (see also Section 7). From the deﬁnition of I − we see that\n\n.\n\n.\n\nΣ(I −) = Σ(a(Ia))\n\nξ\n\n∈\n\n⇔\n\nξa ∈\n\nn\n\nΣ(Ia)\n\n⇔\nn\n\nfor every n,\n\n⇔\n\nξj ≤\n\nj=1\nX\n\nj=1\nX\n\nηa for some η\n\nξa ≤\nηj for some η\n\nΣ(I)\n\n∈\n\nΣ(I)\n\n∈\n\nThe last condition is called majorization and we denote it by ξ\nη (for ﬁnite sequences\nit is more common to call it weak majorization and to use a diﬀerent notation). Thus an\nideal is am-closed if and only if it is hereditary (i.e., solid) under the majorization order.\nMarkus [45, Lemma 3.1] proved that ξ\nη if and only if there is a substochastic matrix P\n(i.e., a matrix with non-negative entries with row and column sums bounded by 1) for which\nξ = P η. This was the key tool in proving the theorem:\n\n≺\n\n≺\n\nTheorem 2.5. [35, Theorem 2.9] (I + J)− = I − + J − for all ideals I, J. In particular, the\nsum of two am-closed ideals is am-closed.\n\n6\n\n8\n\nVICTOR KAFTAL AND GARY WEISS\n\nAs a consequence, the collection of all the am-closed ideals contained in an ideal I is\n\ndirected and hence its union is an ideal which we symbolize by\n\nI− :=\n\nJ\n\nJ\n\n{\n\n|\n\n⊂\n\nI and J is an am-closed ideal\n\n.\n\n}\n\nI− can be easily shown to be am-closed, and hence it is the largest am-closed ideal contained\nin I. When I is countably generated we can say more:\n\n[\n\nTheorem 2.6. [35, Theorem 2.9] If I is a countably generated ideal, then I− = aI.\n\nThis theorem provides a quick and elementary proof of a result that required some eﬀort\n\neven in the case of principal ideals [2, Theorem 3.11]:\n\nTheorem 2.7. [35, Theorem 2.11] A countably generated ideal is am-closed if and only if it\nis am-stable.\n\n2.4. Am-open ideals\nWe were led to a completely diﬀerent path while exploring the question of whether there is\na smallest am-open ideal I oo containing a given ideal I or, equivalently, whether the inter-\nsection of a family of am-open ideals is necessarily am-open. These questions arise naturally\nin trying to identify the am-interior of an ideal. From the deﬁnition of I o we see that\nξ\nΣ(I). This led us to ask whether\nthere is a smallest average that dominates ξ and hence a smallest am-open ideal that contains\n(ξ). The answer is yes and to provide it we need to employ the upper and lower monotone\nnondecreasing and monotone nonincreasing envelopes of a real-valued sequence φ (see [24,\nSection 2.3]):\n\nΣ(I o) = Σ((aI)a) if and only if ξ\n\nηa for some ηa ∈\n\n≤\n\n∈\n\nund φ :=\n\nmax\ni≤n\n\nφi\n\n,\n\nlnd φ :=\n\nφi\n\ninf\ni≥n\n\n,\n\nuni φ :=\n\nE\n\nD\n\nE\nLemma 2.8. [35, Lemma 2.14] For every ξ\n(i) (ξ)o = (ω lnd ξ\nω )\n(ii) (ω und ξ\n\nD\n\nc∗\no,\n\n∈\n\nω ) is the smallest am-open ideal containing (ξ).\n\nsup\ni≥n\n\nD\n\nφi\n\n,\n\nlni φ :=\n\nE\n\nmin\ni≤n\n\nφi\n\n.\n\nD\n\nE\n\nIn fact, ω und ξ\n\nωψ where ψ is the smallest concave sequence that dominates und ξ\nω\nand then it follows that ωψ is the smallest average dominating ξ. In contrast, it is true that\nω lnd ξ\nω and that ωφ\nξ, but unless ξ is itself an average, ωφ is smallest only in the O-sense.\nis an average and ωφ\n\nωφ where φ is the smallest concave sequence that dominates 1\n\n2 lnd ξ\n\nω ≍\n\nω ≍\n\nThis lemma leads to a number of useful consequences.\n\n≤\n\nξ\n\n{\n\nc∗\no |\n\nTheorem 2.9. [35, Section 2] For every ideal I:\nω und ξ\nc∗\n(i) Σ(I o) =\nξ\no |\n(ii) Intersections of am-open ideals are am-open.\n(iii) I oo :=\n{\n(iv) Σ(I oo) =\n≤\n{\nT\n(v) For all I, J, (I + J)oo = I oo + J oo and I o + J o\n\nI and J is am-open\n}\nω und η\nξ\n\nω for some η\n\n⊃\nc∗\no |\n\nΣ(I)\n\n|\n∈\n\nω ∈\n\nJ\nξ\n\n=\n\n∈\n\n∈\n\n∈\n\nJ\n\n}\n\n{\n\nξ\n\nω lnd η\n\nω for some η\n\n≤\n\nΣ(I)\n\n.\n\n}\n\n∈\n\nis the smallest am-open ideal containing I.\n\nΣ(I)\n\n.\n\n⊂\n\n}\n(I + J)o. The inclusion can be proper.\n\n2.5. Arithmetic mean at inﬁnity ideals\nFor an ideal I contained in the trace-class, the ﬁrst order arithmetic mean ideals are always\ntrivial: aI = I o = 0, I − = L1, and Ia = (ω) but there is a theory of am-\nideals that\nsomewhat mirrors the theory of am-ideals.\n\n∞\n\nTheorem 2.10. [35, Section 3]\n\n.\n\n.\n\n\nARITHMETIC MEAN IDEALS\n\n9\n\n(i) (I + J)−∞ = I −∞ + J −∞ for all ideals I, J.\nclosed ideals is am-\n(ii) The sum of two am-\n(iii) I−∞ :=\n(iv) If I is a countably generated ideal, then I−∞ = a∞I.\n(v) A countably generated ideal is am-\n\n∞\nI and J is am-\n\nclosed.\n\n∞\n\n∞\n\nS\n\n⊂\n\nJ\n\nJ\n\n{\n\n|\n\nclosed is the largest am-closed ideal contained in I.\n\nclosed if and only if it is am-\n\nstable.\n\n∞\n\n∞\n\nWhile the statements are similar to those of the am-case, the techniques employed in the\nproofs are substantially diﬀerent. For instance, the proof of (i) depends on a w∗-compactness\nargument rather than the Markus based matricial one used in Theorem 1.5.\n\nThe characterization of am-\n\n∞\n\nopen ideals depends on the following lemma:\n\nLemma 2.11. [35, Lemma 3.7] For every principal ideal I, the following are equivalent.\n(i) I is am-\n∞\n(ii) I = (ηa∞) for some η\n(iii) I = (ξ) for some ξ for which ξ\n\n(ℓ1)∗.\n\nopen.\n\n∈\n\nc∗\no.\n\nω ∈\n\n2\n\nψ.\n\n2 D 1\n\n(ii) consist in showing that if ψ is the largest convex\n\nThe crux of the proof of (iii)\n⇒\nsequence pointwise dominated by ξ\nω , then 1\n\nξ\nω ≤\nTheorem 2.12. [35, Section 3] For every ideal I:\n(i) Σ(I o∞) =\nΣ(se(ω))\nΣ(I\nse(ω))\n∩\nopen.\n(ii) Intersections of am-\n(iii) I oo∞ :=\nis the smallest am-\n∩\n{\n(iv) Σ(I oo∞) =\nc∗\nΣ(I\nω for some η\no |\nT\n(v) I oo∞ + J oo∞ = (I + J)oo∞ and I o∞ + J o∞\n(I + J)o∞ for any two ideals I and J and\nthe inclusion can be proper.\n\nω uni ξ\nξ\nξ\n{\nwhere the operation se(ω) is deﬁned below.\nopen ideals are am-\n\nopen ideal containing I.\nse(ω))\n\nω for some η\n\nJ\n⊂\n}\nω uni η\n\n∞\nse(ω)\nη\n\nc∗\no |\n\nω lni η\n\n∈\n⊂\n\n∞\n∩\n\n|\n∈\n\nω ∈\n\nΣ(I)\n\nJ\nξ\n\n∞\n\n≤\n\n≤\n\n=\n\n∈\n\n∈\n\n∈\n\n(cid:8)\n\n(cid:9)\n\n}\n\n{\n\n}\n\nI\n\nξ\n\n.\n\n|\n\nA further substantial diﬀerence from the am-case is due to the fact that, while for any\nc∗\nξa, in the\no the sequence ξa always satisﬁes the ∆1/2 condition and also ξ\ncase neither of these facts hold (see [34, Example 4.5]). In fact the two conditions are\n\n≤\n\n∈\n\nsequence ξ\nam-\nrelated.\n\n∞\n\nProposition 2.13. [34, Corollary 4.4] Let ξ\n∈\n(i) If ξ satisﬁes the ∆1/2-condition, so does ξa∞.\n(ii) ξa∞ satisﬁes the ∆1/2-condition if and only if ξ = O(ξa∞).\n\n(ℓ1)∗.\n\nIt is not surprising and relatively simple to show that if ξ\n\n(ξ)a∞ = (ξa∞)\n⊂\n[34, Lemma 4.7], and hence if ξa∞ = O(ξ) then (ξ) = (ξ)a∞, i.e., (ξ) is am-\nstable. The\nopposite implication, however, is non-trivial. By analogy with the am-case, call regular at\ninﬁnity a sequence ξ\n\n(ℓ1)∗ for which (ξ) = (ξ)a∞.\n\n∞\n\n∈\n\n(ℓ1)∗, then (ξ)\n\n∈\n\n(ℓ1)∗, then the following conditions are equivalent.\n\nTheorem 2.14. [34, Theorem 4.12] If ξ\n(i) ξ is regular at inﬁnity.\n(ii) ξa∞ = O(ξ)\n(iii) There are constants C > 0 and p > 1 for which ξn ≤\n(iv) ξa∞ is regular at inﬁnity.\n\n∈\n\nC( m\n\nn )pξm for all integers n\n\nm.\n\n≥\n\nExplicitly, the principal ideal (ξ) is am-\n\nstable if and only if ξa∞ = O(ξ).\n\n∞\n\n\n10\n\nVICTOR KAFTAL AND GARY WEISS\n\nCondition (ii) strengthens [24, Corollary 5.19] and [64, Corollary 5.6] by eliminating the\nneed for ampliations, i.e., replacing the condition ξa∞ = O(Dmξ) for some m by the condition\nξa∞ = O(ξ).\n\nCondition (iii) says that α(ξ) <\n−\nξ (see [24]) which can be deﬁned as\n\n1 where α(ξ) is the Matuszeswka index of the sequence\n\nα(ξ) = inf\n\nγ\n\n{\n\nC > 0 such that ξn ≤\n\nC\n\n| ∃ 3. Softness properties of operator ideals \nn\nm\n\nγ\n\n(cid:17)\n\n(cid:16)\n\nξm for all n\n\n.\n\nm\n}\n\n≥\n\n3.1. Deﬁnitions\nIn [35, Section 4] we studied soft ideals ﬁrst introduced in [33, Section 4] and [34, Section\n4], motivated in part by Dixmier’s implicit use of softness to construct the so-called Dixmier\ntrace [22].\n\n.\n\nDeﬁnition 3.1. The soft interior of an ideal I is the product se I := IK(H), i.e., the ideal\nwith characteristic set\n\nΣ(se I) =\n\nξ\n\n{\n\n∈\n\nc∗\no |\n\nξ\n\n≤\n\nαη for some α\n\nc∗\no, η\n\n∈\n\nΣ(I)\n\n.\n\n}\n\n∈\n\nThe soft cover of an ideal I is the quotient sc I := I : K(H), i.e., the ideal with characteristic\nset\n\n∈\nAn ideal is called soft-edged if se I = I and soft-complemented if sc I = I.\nA pair of ideals I\n\nJ is called a soft pair if se J = I and sc I = J.\n\n∈\n\n∈\n\n{\n\nΣ(sc I) =\n\nξ\n\nαξ\n\nΣ(I) for all α\n\n.\n\nc∗\no}\n\nc∗\no |\n\n⊂\n\nSoft-complemented and soft-edged ideals share many common properties. Collectively, we\ncall them soft ideals. The terminology we introduced is motivated by the fact that I is soft-\nΣ(I). Analogously,\nedged if and only if, for every ξ\nΣ(I), one has η = o(ξ) for\nan ideal I is soft-complemented if and only if, for every ξ\nsome η\n\nΣ(I), one has ξ = o(η) for some η\n\nc∗\no \\\n\nΣ(I).\n\n∈\n\n∈\n\n∈\n\nThe soft-interior se I and the soft-cover sc I are, respectively, the largest soft-edged ideal\nsc I\ncontained in I and the smallest soft-complemented ideal containing I. The pair se I\nis the generic example of what we call a soft pair. Many classical ideals, i.e., ideals whose\ncharacteristic set generates a classical sequence space, turn out to be soft and form natural\nsoft pairs as discussed below.\n\n⊂\n\nc∗\no \\\n\n∈\n\nTo prove soft-complementedness of an ideal we often found it convenient to prove instead\n\na stronger property which we call strong soft-complementedness [35, Proposition 4.5].\n\nDeﬁnition 3.2. An ideal I is said to be strongly soft-complemented (ssc for short) if for\nN\nevery countable collection of sequences\nsuch that ξ\n\nc∗\nΣ(I) there is a sequence of indices nk ∈\no \\\n} ⊂\nη(k)\nfor all k and for all 1\ni\n\nΣ(I) whenever ξ\n\nnk.\n\ni\n\nη(k)\n{\nc∗\no and ξi ≥\n\n∈\n\n≤\n\n≤\n\n6∈\n\n3.2. Classical ideals\nCountably generated ideals.\n\n.\n\nProposition 3.3. [35, Proposition 4.6]\n(i) Countably generated ideals, in particular, principal ideals, are strongly soft-complemented\nand hence soft-complemented.\n(ii) A principal ideal (ξ) is soft-edged if and only if ξ = o(Dmξ) for some m.\n\n\nARITHMETIC MEAN IDEALS\n\n11\n\nBanach ideals are ideals that are complete with respect to a symmetric norm (see for\ninstance [24, Section 4.5]) and were called uniform-cross-norm ideals by Schatten [53], sym-\nmetrically normed ideals by Gohberg and Krein [29], and symmetric norm ideals by other\nauthors. Recall that the norm of I induces on the ﬁnite rank ideal F (or, more precisely,\non S(F ), the associated space of sequences of co with ﬁnite support) a symmetric norm-\ning function φ, and the latter permits one to construct the so-called minimal Banach ideal\nS(o)\nφ = cl(F ) contained in I (the closure taken in the norm of I) and the maximal Banach\nideal Sφ containing I where\nξ\nΣ\n\nSφ\nS(o)\nφ\n(cid:0)\n(cid:1)\nφ\n|\nIf I is a Banach ideal, the ideals S(o)\nφ and Sφ can be obtained from I through a “soft”\n(cid:1)\noperation, i.e.,\n\nφ(ξ) := sup φ\nSφ\n\nξ1, ξ2, . . . , ξn, 0, 0, . . .\ni\n\nh\nξn, ξn+1, . . .\n(cid:0)\n\nc∗\no |\nΣ\n\nξ\n(cid:8)\n\n∞\n\n→\n\n<\n\n=\n\n=\n\nΣ\n\n∈\n\n∈\n\n(cid:9)\n\n(cid:8)\n\n(cid:9)\n\n0\n\n(cid:1)\n\n(cid:1)\n\n(cid:0)\n\n(cid:0)\n\n(cid:0)\n\n(cid:1)\n\ni\n\nh\n\n.\n\nProposition 3.4. [35, Proposition 4.7]\nIf I is a Banach ideal, then S(o)\nexample of a soft pair, and Sφ is ssc. In particular, se I and sc I are also Banach ideals.\n\nφ = se I and Sφ = sc I, the embedding S(o)\n\nSφ is a natural\n\nφ ⊂\n\nRecall that in the notations of [24] and [35], Gohberg and Krein [29] showed that the\ninduces a complete norm on the am-closure (ξ)−\n\nsymmetric norming function φ(η) := sup ηa\nξa\nof the principal ideal (ξ) and for this norm,\n\ncl(F ) = S(o)\n\ncl(ξ)\nThe fact that Sφ is soft-complemented was obtained in [52, Theorem 3.8], but Salinas proved\nonly that (in our notations) se Sφ ⊂\nφ [52, Remark 3.9]. Varga reached the same conclu-\nsion in the case of the am-closure of a principal ideal with a non-trace class generator [56,\nRemark 3].\n\nφ ⊂\n\nS(o)\n\n⊂\n\nSφ = (ξ)−.\n\nφ ⊂\n\nThe fact that S(o)\n\nSφ is always a soft pair yields immediately the equivalence of parts\n\n(a)–(c) in [52, Theorem 2.3] without considering norms and hence establishes (d) and (e).\nThe same fact can also be used to obtain an elementary proof that (ξ) = cl(ξ) if and only\nif ξ is regular [35, Proposition 4.9]. This was proven by Allen and Shen [2, Theorem 3.23]\nusing Salinas’ results [52] on (second) K¨othe duals and by Varga [56, Theorem 3] and is a\nspecial case of [24, Theorem 2.36].\n\nThe fact that S(o)\n\nφ = se Sφ brings a further consequence. As remarked in [24, Section 4.9],\n\nSφ is am-closed. By Proposition 3.14 below, S(o)\n\nφ is also am-closed.\n\n{\n\n∞\nξ\n∈\n\n) with M(0) = 0, then the small Orlicz ideal L(o)\n\nOrlicz ideals. Recall from [24, Sections 2.37 and 4.7] that if M is a monotone nondecreas-\ning function on [0,\nM is the ideal with\nand the Orlicz ideal LM is the\nc∗\ncharacteristic set\no |\nideal with characteristic set\n\n∞\nn M(tξn) <\nProposition 3.5. [35, Proposition 4.11] Let M be a monotone nondecreasing function on\n[0,\nThe fact that L(o)\nideals.\n\nLM forms a soft pair can simplify proofs of some properties of Orlicz\nIndeed, together with [34, Proposition 3.4] that states that for an ideal I, se I is\n\nM is soft-edged, LM is ssc, and L(o)\n\nn M(tξn) <\nc∗\nξ\no |\n{\nP\n\n) with M(0) = 0. Then L(o)\n\nLM is a soft pair.\n\nfor some t > 0\n\nfor all t > 0\n\nM ⊂\n\nM ⊂\n\nP\n\n∞\n\n∞\n\n∈\n\n}\n\n}\n\n.\n\n\n12\n\nVICTOR KAFTAL AND GARY WEISS\n\nsc I, and combined with [35,\nam-stable if and only if sc I is am-stable if and only if Ia ⊂\nLemma 4.16] it yields an immediate proof of the following results in [24]: the equivalence of\n(a), (b), (c) in Theorem 4.21 and hence the equivalence of (a), (b), (c) in Theorem 6.25, the\nequivalence of (b), (c), and (d) in Corollary 2.39, the equivalence of (b) and (c) in Corollary\n2.40, and the equivalence of (a), (b), and (c) in Theorem 3.21.\n\nLorentz ideals. If φ is a monotone nondecreasing nonnegative sequence satisfying the ∆2-\ncondition, i.e., sup φ2n\n, then in the notations of [24, Sections 2.25 and 4.7] the Lorentz\nφn\nideal L(φ) corresponding to the sequence space ℓ(φ) is the ideal with characteristic set\n\n∞\n\n<\n\nΣ(L(φ)) :=\n\nkℓ(φ) :=\nA special case of Lorentz ideal is the trace class L1 which corresponds to the sequence φ =\nand the sequence space ℓ(φ) = ℓ1.\n\nξn(φn+1 −\n\nφn) <\n\nn\nX\n\n∞\n\n(cid:27)\n\n(cid:26)\n\n∈\n\nξ\n\nξ\n\n.\n\nc∗\no | k\n\nn\ni\n\nh\n\nProposition 3.6. [35, Proposition 4.12] If φ be a monotone nondecreasing nonnegative se-\nquence satisfying the ∆2-condition, then L(φ) is both soft-edged and strongly soft-complemented.\nIn particular, L1 is both soft-edged and soft-complemented.\n\nK¨othe duals\n\nProposition 3.7. [35, Proposition 4.13] Let I be a soft-complemented ideal and let X\n)N. Then the ideal with characteristic set Σ(I) : X is soft-\nbe a nonempty subset of [0,\ncomplemented. In particular, K¨othe duals are soft-complemented.\n\n∞\n\nThe K¨othe dual, I :=\n\nen\n\n× of the singleton\n\nstrongly soft-complemented [35, Example 4.15].\n\n{h\n\ni}\n\nen\n\n{h\n\ni}\n\n, is soft-complemented but is not\n\nIdempotent ideals are ideals for which I = I 2. Notice that an ideal is idempotent if and\nonly if I = I p for some positive p\n\n= 0, 1, if and only if I = I p for all p > 0.\n\nProposition 3.8. [35, Proposition 4.17] Idempotent ideals are soft-edged and soft-complemented.\n\nThe remarks following [35, Proposition 5.3] show that idempotent ideals may fail to be\nstrongly soft-complemented.\n\nMarcinkiewicz ideals are the pre-arithmetic means of principal ideals, and we consider\nalso their am-\nanalogs. That these ideals are strongly soft-complemented follows from the\nfollowing proposition combined with Proposition 3.3(i).\n\n∞\n\nProposition 3.9. [35, Proposition 4.18] The pre-arithmetic mean and the pre-arithmetic\nmean at inﬁnity of a strongly soft-complemented ideal are strongly soft-complemented.\n\nIn particular, Marcinkiewicz ideals are strongly soft-complemented.\n\n3.3. Operations on soft ideals\nIn applying “softness” properties of operator ideals it is often essential to know which oper-\nations preserve softness. In some cases, the answer comes from an elementary computation,\ne.g.,\n\n.\n\nProposition 3.10. [35, Proposition 5.1, Example 5.2]\nFor every collection of ideals\n\nΓ\n\nIγ, γ\n\n:\n\n{\n\n∈\n\n}\n\n6\n\nARITHMETIC MEAN IDEALS\n\n13\n\nγ se Iγ ⊃\nse(\nγ sc Iγ = sc(\nT\nT\n\nγ Iγ). If Γ is inﬁnite, the inclusion can be proper.\nγ Iγ)\n\n(i)\n(ii)\nIn particular, the intersection of soft-complemented ideals is soft-complemented. However,\nthe intersection of an inﬁnite countable strictly decreasing chain of principal ideals is never\nstrongly soft-complemented [35, Proposition 5.3]\n\nT\nT\n\nEven more elementary is the fact that the se operation distributes for sums: se(I + J) =\nK(H)(I + J) = se I + se I. Thus we found surprisingly challenging the analogous question\nabout the “sc” operation. We were only able to obtain:\n\nTheorem 3.11. [35, Theorem 5.7] The sum of an ssc ideal and a countably generated ideal\nis ssc and hence soft-complemented.\n\nWe do not know if these conditions can be relaxed:\n\nQuestion 1. Is the sum of two ssc ideals ssc? Is it soft-complemented? Is the sum of a\nsoft-complemented ideal and a countably generated ideal soft-complemented?\n\nIn dealing with the codimension question for traces (see next section) we heavily depended\non commutation relations between “soft operations” and arithmetic mean operations and\narithmetic mean at inﬁnity operations.\n\n⊂ a(sc I)\n(se I)a\n\nTheorem 3.12. [35, Theorem 6.1] Let I be an ideal.\n(i) sc aI\n(i′) sc aI = a(sc I) if and only if ω\n6∈\n(ii) se Ia ⊂\n(ii′) se Ia = (se I)a if and only if I =\n(iii) sc Ia ⊃\n(iv) se aI\n(iv′) se aI = a(se I) if and only if ω\n\n(sc I)a\n⊃ a(se I)\n\nΣ(se I).\n\nΣ(sc I)\n\n6⊂ L1\n\nΣ(I)\n\nΣ(I)\n\nor I\n\n\\\n\n{\n\n}\n\n0\n\n6∈\n\n\\\n\nAs a consequence, and essential for the next section is the fact that se I is am-stable if\nand only if so is sc I and both are implied by (but not equivalent to) the am-stability of I\nand both can be linked to the following condition involving the commutator space of I:\n\nProposition 3.13. [34, Proposition 4.20, 3.4] Let I be an ideal. Then se I\nif and only if\n(i) se I is am-\n(ii) se I is am-stable in the case that ω\nAlso, se I is am-\n\nstable in the case that ω /\n∈\nΣ(I)\n\nstable (resp., am-stable) if and only if I is am-\n\nΣ(I)\n\n∞\n\n∈\n\n∞\n\nstable (resp., am-stable).\n\n∞\n\nF + [I, B(H)]\n\n⊂\n\nThe “missing” reverse inclusion of Theorem 3.12(iii) is an open question and it is equiva-\n\nlent to a number of other questions listed below:\n\nQuestion 2. Let I be an ideal.\n\n(i) Is (or under what condition(s)) sc Ia = (sc I)a?\n(i′) Is (or under what condition(s)) sc I − = (sc I)−?\n\nEquivalently, is the am-closure of a soft-complemented ideal also soft-complemented?\n\n(ii) Is (or under what condition(s)) (sc I)a soft-complemented?\n\n\n14\n\nVICTOR KAFTAL AND GARY WEISS\n\n(ii′) Is (or under what condition(s)) (sc I)− soft-complemented?\n\nFurther results linking softness properties and arithmetic mean properties are\n\nProposition 3.14. [35, Corollaries 6.7, 6.5]\n(i) Let I be soft-complemented. Then so are aI, I o, and I−. Let I be soft-edged. Then so\nare aI, I o, and I −; Ia is soft-edged if and only if either I =\n6⊂ L1; I oo is soft-edged\nif and only if either I =\nor I\n(ii) Let I be am-closed. Then so are sc I and se I. Let I be am-open. Then sc I is am-open\nwhile se I is am-open if and only if I\n\n= (ω).\n\n(ω).\n\nor I\n\n6⊂\n\n}\n\n{\n\n}\n\n{\n\n0\n\n0\n\nSimilar results and similar open question (but as usual with somewhat more complicated\nconditions and proofs) hold for arithmetic mean at inﬁnity operations (see [35, Section 6]). 4. Traces and the codimension conjecture \nThe ﬁrst major question we investigated in our study of arithmetic mean operator ideals\nin [34] was : “How many nonzero traces can an ideal support?” Because traces on an ideal I\nare the unitarily invariant linear functionals on I and their unitary invariance is equivalent\nto their vanishing on [I, B(H)], they can be identiﬁed with the elements of the linear dual\nof the quotient space\n\n[I,B(H)] . Our work in [34] led us to the following question:\n\nI\n\nQuestion 3. Is the following true for all ideals I?\n\ndim\n\nI\n\n{\n[I, B(H)] ∈ (\n{\n\n1,\n0,\n\n∞}\n∞}\n\nwhen ω /\n∈\nwhen ω\n∈\n\nΣ(I)\nΣ(I).\n\nWe conjecture that the answer to this question is aﬃrmative and we will present in Section\n4.3 some evidence to support this conjecture. It was precisely to investigate this conjecture\nand related questions that we developed the tools presented in the two preceding sections.\n\n4.1. Trace extensions, hereditariness, and the uniqueness of traces\nIt is well-known that the restriction of a trace on a nonzero ideal I to the ideal F of ﬁnite\nrank operators must be a (possibly zero) scalar multiple of the standard trace T r. In other\nwords, every trace on a nonzero ideal is a trace extension of some scalar multiple of T r on\nF .\n\n.\n\nDeﬁnition 4.1. A trace vanishing on F is called singular, and nonsingular otherwise.\n\nDixmier [22] provided the ﬁrst example of a (positive) singular trace. Its domain is the\n\nam-closure, (η)− = a(ηa), of a principal ideal (η)\n\nse(η)a.\n\n⊂\n\nTheorem 2.2 yields a complete characterization of ideals that support a nonsingular trace,\n[24, Introduction, Application 3 of\n\nnamely, those ideals that do not contain diag ω (cf.\nTheorem 5.6] and also [23]). Generalizing this argument proves the following:\n\nProposition 4.2. [34, Proposition 5.3] Let I and J be ideals and let τ be a trace on J. Then\nτ has a trace extension to I + J if and only if\n\n∈\nMoreover, the extension is unique if and only if I\n\n⊂ {\n\n∩\n\nJ\n\n[I, B(H)]\n\nX\n\nJ\n\n|\n\n⊂\n\nτ (X) = 0\n\n.\n\n}\n\nJ + [I, B(H)].\n\n6\n\nARITHMETIC MEAN IDEALS\n\n15\n\nΣ(I) if and only if T r extends from L1 to L1 + I if and only if T r\n\nIn particular, ω /\n∈\nextends from F to I.\n\nFurther consequences of [24] (see Theorem 2.3 above) are\n\nProposition 4.3. [34, Proposition 5.5] Let I be an ideal for which ω /\n∈\n\n(L1 + [I, B(H)])+ = L+\n1 .\n\nΣ(se I). Then\n\nIn particular, (L1 + [I, B(H)])+ is hereditary for every ideal I.\n\nCorollary 4.4. [34, Corollary 6.2] Let I\n}\nΣ(I), then (F + [I, B(H)])+ = (a∞I)+.\n(i) If ω /\n∈\nΣ(I), then (F + [I, B(H)])+ = (aI)+.\n(ii) If ω\n∈\n(iii) (F + [I, B(H)])+ is hereditary (i.e., solid).\n\n=\n\n{\n\n0\n\nbe an ideal.\n\nAn ideal I supports a unique nonzero trace (up to scalar multiplication) precisely when\ndim I\nΣ(I) support some non-singular trace. The next\ntheorem which is a consequence of Corollary 4.4 tells us that this trace is unique precisely\nwhen the ideal is am-\n\n[I,B(H)] = 1. All the ideals for which ω /\n∈\n\nstable.\n\n∞\n\nis an ideal where ω /\n∈\n\nΣ(I), then the following\n\n0\n\n}\n\n{\n\n=\n\nTheorem 4.5. [34, Theorem 6.6] If I\nare equivalent.\n(i) I supports a nonzero trace unique up to scalar multiples.\nL1 and every trace on I is a scalar multiple of T r.\n(ii) I\n⊂\n(iii) dim I\n[I,B(H)] = 1\n(iv) I = F + [I, B(H)]\n(v) I\n⊂\n(vi) I is am-\n\n|\nstable, i.e., I = a∞I.\n\nL1 and [I, B(H)] =\n\nT r X = 0\n\nX\n\n∈\n\n{\n\n}\n\nI\n\nWhat if ω\n\nΣ(I)? We know that if I is am-stable, then it supports no nonzero trace.\n\nBut could it support a unique trace? Equivalently:\n\n∞\n\n∈\n\nQuestion 4. If (ω)\n\nI\n\n⊂\n\n= [I, B(H)], must dim I\n\n[I,B(H)] > 1?\n\nAs mentioned in the introduction, a principal ideal (ξ) supports no nonzero trace precisely\nwhen ξ is regular and Theorem 4.5 shows that it supports a unique nonzero trace precisely\nwhen (ξ) = a∞(ξ), or equivalently, when (ξ) = (ξ)a∞ = (ξ)a∞, which by Theorem 2.7, is\nequivalent to ξa∞ = O(ξ). A similar characterization of principal ideals supporting a unique\ntrace was obtained in [64, Corollary 5.6].\n\nSo far, we know that [I, B(H)]+, (F + [I, B(H)])+, and (L1 + [I, B(H)])+ are always\nhereditary. Of course, if J is an ideal that either contains or is contained in the commutator\nspace [I, B(H)], then (J + [I, B(H)])+ must be also hereditary.\n\nQuestion 5. Is (J + [I, B(H)])+ hereditary for all pairs of ideals I and J? If not, when is it?\n\n4.2. Applications to elementary operators, and problems of Shulman\nPropositions 4.2 and 4.3 ﬁnd natural applications to questions on elementary operators.\n\n.\n\n6\n6\n6\n\n16\n\nIf Ai, Bi ∈\n\nVICTOR KAFTAL AND GARY WEISS\n\nB(H), then the B(H)-map\n\nB(H)\n\nT\n\n∋\n\n→\n\nn\n\n∆(T ) :=\n\nAiT Bi\n\ni=1\nX\n\nis called an elementary operator and its adjoint B(H)-map is ∆∗(T ) :=\ni T B∗\ni .\nElementary operators include commutators and intertwiners and hence their theory is con-\nnected to the structure of commutator spaces. The Fuglede-Putnam Theorem [28], [51]\nstates that for the case ∆(T ) = AT\nT B where A, B are normal operators, ∆(T ) = 0\nimplies that ∆∗(T ) = 0. Also for n = 2, Weiss [60] generalized this further to the case\n, i = 1, 2, are separately commuting families of normal operators by\nAi}\nwhere\n{\nL2 and\nL2 implies ∆∗(T )\nproving that ∆(T )\nk2. (This is also a con-\nk2 =\nsequence of Voiculescu’s [57, Theorem 4.2 and Introduction to Section 4] but neither Weiss’\nnor Voiculescu’s methods seem to apply to the case n > 2.) In [55] Shulman showed that for\nn = 6, ∆(T ) = 0 does not imply ∆∗(T )\n\nBi}\n∈\n\ni=1 A∗\n\n∆∗(T )\n\n∆(T )\n\nand\n\nP\n\n−\n\n∈\n\n{\n\nk\n\nk\n\nL2.\n\nn\n\nIf we impose some additional conditions on the families\n\nand T , we can extend\n\n∈\n\nthese implications to arbitrary n past the obstruction found by Shulman.\n\n,\n\nAi}\n\n{\n\nBi}\n\n{\n\nAssume that\nators and let T\n\nAi}\n,\n{\nB(H).\n∈\nDeﬁne the following ideals:\n\nBi}\n\n{\n\n, i = 1, . . . , n, are separately commuting families of normal oper-\n\nn\n\nL := (\n\n(AiT )(Bi))2, L∗ := (\n\ni=1\nX\nn\n\n(A∗\n\ni T )(Bi))2,\n\nn\n\ni=1\nX\nn\n\nR := (\n\n(Ai)(T Bi))2, R∗ := (\n\n(Ai)(T B∗\n\ni ))2 and\n\ni=1\nX\nI∆,T := L\n\nL∗\n\nR\n\n∩\n\n∩\n\n∩\n\ni=1\nX\nn\n\nR∗, S = (\n\n(AiT Bi))\n\nL1/2\n\n∩\n\n∩\n\nR1/2\n\ni=1\nX\n\nwhere (X) denotes the principal ideal generated by the operator X and MN (resp., M + N)\ndenotes the product (resp., sum) of the ideals M, N. Then I∆,T and S are either\n, B(H),\nor a principal ideal.\n\n}\n\n{\n\n0\n\nProposition 4.6. [34, Proposition 5.7] If ω /\n∈\n∆(T )\n\n∆∗(T )\n\nL2 and\n\n∈\n\nk\n\nA suﬃcient condition independent of T that insures that ω /\n∈\nn\nω1/4\ni=1(s(Ai) + s(Bi))).\n= O(\nn\ni=1 s(Ai)) or the condition ω1/2\n= O(\n\nSo also is the condition ω1/2\n\nL2 implies\n\nΣ(I∆,T ), then ∆(T )\nk2.\nΣ(I∆,T ) is\n\nk2 =\n\n∆∗(T )\n\n∈\n\nk\n\nP\n\nP\n\n= O(\n\nn\ni=1 s(Bi)).\n\nP\n\nAnother application of Propositions 4.2 and 4.3 is to a problem of Shulman.\n\nn\nLet ∆(T ) =\ni=1 AiT Bi be an elementary operator where the operators Ai and Bi are not\nassumed to be commuting or normal. Shulman showed that the composition ∆∗(∆(T )) = 0\ndoes not imply ∆(T ) = 0 and conjectured that this implication holds under the additional\nL1. In the case that the ideal S is “not too large” we can prove\nassumption that ∆(T )\n∈\nthe implication without making this assumption.\n\nP\n\nProposition 4.7. [34, Proposition 5.8] If ω /\n∈\n∆(T )\n\nk2 = T r T ∗∆∗(∆(T )).\n\nL2 and\n\n∆(T )\n\n∈\n\nk\n\nΣ(S), then ∆∗(∆(T ))\n\nL1 implies that\n\n∈\n\n6\n6\n6\n\nARITHMETIC MEAN IDEALS\n\n17\n\nIn particular, if ∆∗(∆(T )) = 0 then ∆(T ) = 0.\nThe key tools used in both propositions are the hereditariness of (L1 + [I, B(H)])+ estab-\nlished in Proposition 4.3 and the fact that [I, J] = [IJ, B(H)], which was established in [24].\nThe latter fact was also recently similarly used in [27].\n\n4.3. Commutator spaces with inﬁnite codimension\nIn this section we present some conditions under which [I, B(H)] has inﬁnite codimension\nin I. Our key technical result is:\n\n.\n\nTheorem 4.8. [34, Theorem 7.1] If I and J are ideals and se J\nJ+[I,B(H)]\nF +[I,B(H)] has uncountable dimension.\n\n6⊂\n\nF + [I, B(H)] then\n\nSo, if we take J = I, we see that if se I\n\n[I,B(H)] has uncountable\nF + [I, B(H)] is equivalent to the am-stability of se I for\nstability of se I for the case when\nΣ(I) [34, Proposition 4.20]. As a consequence, recalling that sta(L1) is the smallest\nstable ideal, we obtain the following.\n\ndimension. The condition se I\nthe case when ω\nω /\n∈\nam-stable ideal and that sta∞(L1) is the largest am-\n\nΣ(I) [34, Proposition 3.4] or the am-\n\nF + [I, B(H)], then\n\n∞\n\n6⊂\n\n⊂\n\n∈\n\nI\n\n∞\n\nbe an ideal. Then\n\nI\n\n[I,B(H)] has uncountable\n\nTheorem 4.9. [34, Theorem 7.2] Let I\ndimension if any of the following conditions hold.\n(i) I\n(ii) I\n(iii) I\n\nsta∞(L1) and se I is not am-\nsta(L1) and se I is not am-stable.\nsta∞(L1) and I\n\nsta(L1).\n\nstable.\n\n∞\n\n=\n\n{\n\n}\n\n0\n\n⊂\n⊃\n6⊂\n\n6⊃\n\nIn particular, we see that for “intermediate ideals” , [I, B(H)] always has inﬁnite codi-\n\nmension and that for “soft ideals” the codimension conjecture always holds:\n\nCorollary 4.10. If I is a soft-edged or soft-complemented ideal, then\n\ndim\n\nI\n[I, B(H)]\n\nis\n\n1 or uncountable\n0 or uncountable\n\n(\n\nif ω /\n∈\nif ω\n∈\n\nΣ(I)\nΣ(I).\n\nIn particular, dim (ω)\nideals are, but is not am-stable since ω\n\n[(ω),B(H)]\n\nωa is not regular.\n\n6≍\n\nis uncountable since (ω) is soft-complemented as all principal\n\nFurther consequences and extensions are:\n\nbe an ideal. Then\n\nI\n\n[I,B(H)] has uncountable dimension if any\n\n=\n\nCorollary 4.11. Let I\nof the following conditions hold.\n(i) I\n(ii) I\n\nsta(L1) and I\n⊂\nsta∞(L1) and J\n\nJ but I\n\n{\n\n}\n\n0\n\n6⊃\n6⊂\n\n6⊂\nI but sta(J)\n\nsta∞(J) for some soft-complemented ideal J.\nI for some soft-edged ideal J.\n\n⊂\n\n6⊂\n\nOne case of interest is when I or J are the trace class L1, which is both soft-edged and\n\nsoft-complemented.\n\nCorollary 4.12. Let I be a nonzero ideal. Then\n(i)\n\ndim\n\nI + [L1, B(H)]\n[L1, B(H)]\n\nis\n\n1\nuncountable\n\nif I\nif I\n\n(\n\n⊂ a∞(L1)\n6⊂ a∞(L1)\n\n6\n6\n\n18\n\n(ii)\n\nVICTOR KAFTAL AND GARY WEISS\n\ndim\n\nL1 + [I, B(H)]\n[I, B(H)]\n\n(iii) If ω /\n∈\n\nΣ(I) then\n\n0\n1\nuncountable\n\nis \n\n\nif ω\n∈\nif ω\n∈\nif ω /\n∈\n\nΣ(I)\nΣ(I)\nΣ(I)\n\nΣ(I)\n\n\\\n\n\n\nis\n\ndim\n\nI\n\n0\nuncountable\n\nif I\nif I\n\n⊂\n6⊂\n\nL1\nL1\n\n.\n\nL1 + [I, B(H)]\n\n(\n\n∩\nI, then there are uncountably many linearly independent extensions of\n\nI\nIn particular, if L1 6⊂\nT r from L1 to I.\nRemark 4.13. Dixmier proved in [22] that the am-closure of a principal ideal, (η)− = a(ηa),\nse(η)a (i.e., η = o(ηa), which is equivalent to (ηa)2n\n1\nfor which (η)\n2 ) supports a positive\n⊂\nIn [24, Section 5.27 Remark 1] it was noted that Dixmier’s construction\nsingular trace.\nwhere cl denotes the closure in the principal\ncan be used to show that dim\n∞\nideal norm. Corollary 4.10 shows that dim (η)−\n[(η)−,B(H)] is uncountable follows from the weaker\nhypothesis ηa 6\n\n= O(η), i.e., η is not regular.\n\n(η)−\ncl[(η)−,B(H)] =\n\n(ηa)n →\n\nAnother case where we can prove that [I, B(H)] has inﬁnite codimension (we do not know\nif uncountable) is the following. Its proof is unrelated to the proof of Theorem 4.8 but is\nmore combinatorial in nature.\n\nCorollary 4.14. [34, Corollary 7.9] Let I be an ideal for which there exists a nonsummable\nsequence ξ\nΣ(I) there\nis an associated m\n\nΣ(I) and a monotone sequence of indices\n\nso that for every χ\n. 0. Then dim I \npk}\n\n∈\n\n∈\n\n{\n\nN for which ( χ\nξa\n\n[I,B(H)] =\n\n∞\nThis result and the unusual property for the ideal I originates from\n\n∈\n\n)mpk →\n\nTheorem 4.15. [34, Theorem 7.8] For every am-stable principal ideal J\nideal I with se J\n\nJ for which dim I\n\n, yet se I and hence I are am-stable.\n\nthere is an\n\n=\n\n}\n\n{\n\n0\n\nI\n\n[I,B(H)] =\n\n∞\n\n⊂\n5. B(H) lattices\n\n⊂\n\n.\n\n5.1. Lattice density\nMany aspects of operator theory implicitly (and sometimes explicitly) involve the structure\nof the lattice L of all operator ideals and of its distinguished sublattices, like the lattice PL\nof all principal ideals. For instance, one basic question due to Brown, Pearcy and Salinas [14]\nwas whether or not the ideal of compact operators K(H) was the sum of two proper ideals.\nThis was settled aﬃrmatively in [11] for any proper ideal strictly larger than F (the ideal of\nﬁnite rank operators) using the continuum hypothesis and the techniques employed led to\nthe set-theoretic concept of groupwise density that has proved useful in point-set topology\nand abelian group theory [9], [10], [47]. Other work by Salinas (e.g., [52]) studied increasing\nor decreasing nests of special classes of symmetric norm ideals (Banach ideals). Furthermore,\nmany of the questions on the structure of arithmetic mean ideals depend on properties of\noperator ideal lattices, particularly various lattices of principal ideals.\n\nOperator ideals form a lattice L with inclusion as partial order and intersection as meet\nand sum as join. Since, for any ξ, η\n(η) = (min(ξ, η)) and (ξ) + (η) = (ξ + η),\n∩\nthe collection of all principal ideals forms a sublattice which we denote by PL. Since the\n\nc∗\no, (ξ)\n\n∈\n\n6\n\nARITHMETIC MEAN IDEALS\n\n19\n\nintersections and sums of two am-stable ideals are easily seen also to be am-stable, the\ncollection of all am-stable principal nonzero ideals forms a lattice that we denote by SPL.\ncase which lattice we denote by S∞PL. Similarly, the collection\nAnd likewise for the am-\nof all nonzero principal ideals having a generator sequence that satisﬁes the ∆1/2-condition\nforms a lattice denoted by ∆1/2PL.\n\n∞\n\nLattices may have gaps: a nested pair of ideals in the lattice, I ( J, between which there\nis no ideal in the lattice. In fact, given any principal ideal (ξ), an easy maximality argument\nprovides us with an ideal I ( (ξ) that forms a gap under (ξ). On the other hand, there\ncannot be any gap above (ξ), i.e., (ξ) ( J. We describe this fact by saying that PL is upper\ndense but not lower dense in L according to the following deﬁnition.\nDeﬁnition 5.1. For two nested lattices L′\n⊂\nL′′ provided that between every pair of ideals I\nlies another ideal in the smaller lattice L′.\n\nL′′, L′ is upper dense (resp., lower dense) in\nL′′ with I ( J (resp., J ( I)\n\nL′ and J\n\n∈\n\n∈\n\nMany questions on operator ideals can be reduced to questions on lattice density. Together\nwith the upper density of PL in L, the following three theorems that are the technical core\nof [36], provided the tools we need for applications to arithmetic mean ideals.\nTheorem 5.2. [36, Theorem 3.9] ∆1/2PL is upper and lower dense in PL.\nTheorem 5.3. [36, Theorem 3.10] SPL is upper and lower dense in PL.\nTheorem 5.4. [36, Theorem 3.13] S∞PL is upper and lower dense in PL.\n\nA key property used in the proofs is the following Potter-type condition characterizing\nn )poξm for some 0 < C\na regular sequence ξ: ξn ≥\nm\n[24, Theorem 3.10 and Remark 3.11]. A similar key role is taken by the characterization\nm given\nof an\n[34, Theorem 4.12].\n\n-regular sequence ξ: ξn ≤\n\n1, 0 < po < 1 and all n\n\nn )poξm for some C\n\n1, po > 1 and all n\n\nC( m\n\nC( m\n\nSince PL is upper but not lower dense in L, immediate consequences of Theorems 5.2,\n\n∞\n\n≥\n\n≥\n\n≥\n\n≤\n\n5.3, and 5.4 are:\n\nCorollary 5.5.\n(i) PL, ∆1/2PL, SPL, and S∞PL are upper dense in L but they all have lower gaps in L.\n(ii) PL, ∆1/2PL, SPL, and S∞PL have no gaps.\n\nOther consequences of the same theorems and the Potter-type conditions already men-\n\ntioned are:\n\nCorollary 5.6.\n(i) Every principal ideal is contained in a principal ideal from SPL, and if it is strictly larger\nthan F it contains a principal ideal in S∞PL that is strictly larger than F .\n(ii) A principal ideal (η) contains a principal ideal in ∆1/2PL if and only if ωp = O(η) for\nsome p > 0; it contains a principal ideal in SPL if and only if ωp = O(η) for some 0 < p < 1;\nand it is contained in a principal ideal in S∞PL if and only if η = O(ωp) for some p > 1.\n\nWe can reformulate some of these results in terms of traces. By Corollary 5.6(i), every\nprincipal ideal I is contained in a principal ideal J with no nonzero traces; thus no nonzero\ntrace on I can extend to a trace on J. Alternatively, by Corollary 5.6(ii), if a principal ideal I\nis suﬃciently large to contain (ωp) for some 0 < p < 1, then (ωp) = [(ωp), B(H)]\n[I, B(H)]\nand hence every trace on I must necessarily vanish on (ωp). More generally, by employing\n\n⊂\n\n\n20\n\nVICTOR KAFTAL AND GARY WEISS\n\nrepeatedly Theorem 5.3 and [36, Proposition 3.17], every am-stable principal ideal is the ﬁrst\nideal of an increasing (or decreasing) countable chain of principal ideals where every odd\nnumbered ideal is am-stable and hence has no nonzero trace, and every even numbered ideal\nsupports inﬁnitely many nonzero traces, that is, its space of traces is inﬁnite-dimensional\n([34, Theorem 7.5] and [35, Proposition 4.6(i)]).\n\nThe am-\n\n∞\n\ncase is similar.\n\n5.2. Unions of principal ideals\nBasic questions on intersections and unions of ideals from a certain lattice play a natural\nrole in the subject. Salinas and others investigated intersections and unions of ideals related\nto various classes of mainly Banach ideals (e.g., see [14], [52]). We used Corollary 5.6 and\ndensity Theorems 5.2-5.4 to determine intersections and unions of various classes of principal\nideals. Then we investigated questions on representing ideals as unions of chains of principal\nor countably generated ideals.\n\n.\n\nAn immediate consequence of Corollary 5.6 is:\n\nCorollary 5.7.\n(i)\n\n(ωp) =\n\np>0\nT\n\nL\n\nPL\n\nL∈∆1/2\nT\n\nIn the case of Banach ideals or their powers we can obtain more:\n\n(ii)\n\n(ωp) =\n\nL\n\n0<p<1\nT\n\nL∈SPL\nT\n\n(iii)\n\n(ωp) =\n\np>1\nS\n\nL\n\nL∈S∞PL\nS\n\nProposition 5.8. [36, Proposition 4.3]\n(i) Let I = J p for some p > 0 and some Banach ideal J. Then I =\n(ii) For a Banach ideal I, I is am-stable if and only if I =\n(iii) For a Banach ideal I, I is am-\n\n{\nstable if and only if I =\n\nL\n\n∞\n\nL\n{\nSPL\nS\nL\n\n∆1/2PL\n∈\nI\nL\n.\n}\n|\n⊂\nS∞PL\nL\n\n∈\n{\n\n∈\n\nI\n\n.\n\n}\n\n⊂\n\n|\n\nL\n\nI\n\n.\n\n}\n\n⊂\n\n|\n\nS\n\nWhile every ideal is the union of principal ideals, a diﬀerent and natural question is: which\nideals are the union of an increasing chain of principal ideals? A partial answer is given by\nthe following proposition.\n\nS\n\nProposition 5.9. [36, Proposition 4.4]\nAssuming the continuum hypothesis, the following hold.\n(i) All ideals are unions of increasing chains of countably generated ideals.\n(ii) An ideal I is the union of an increasing chain of principal ideals if for every countably\ngenerated ideal J\n\nI there is a principal ideal L with J\n\nI.\n\nL\n\n⊂\n\n⊂\n\n⊂\n\n[36, Corollary 4.5] shows that Banach ideals and more generally e-complete ideals, i.e.,\npowers of Banach ideals (see [24, Section 4.6]), satisfy the condition in part (ii) of the above\nproposition.\n\nNeither the e-completeness condition in the corollary nor the condition in part (ii) of the\nproposition are necessary and we do not know whether or not the continuum hypothesis or\nsomething stronger than the usual axioms of set theory is required for Proposition 5.9.\n\nClearly, an ideal is the union of a countable increasing chain of principal ideals if and\n∞\nonly if it is countably generated. But which ideals cannot be the union I =\nk=1Jk of a\ncountable increasing chain of ideals Jk ( I? Salinas showed in [52, Theorem 7.4] that every\nminimal Banach ideal I, i.e., an ideal I = S(o)\nφ given by a symmetric norming function φ,\nhas this property. Maximal Banach ideals may fail this property: e.g., consider any principal\nam-stable ideal. Conversely, maximal Banach ideals, i.e., ideals Sφ given by a symmetric\n\n∪\n\n\nARITHMETIC MEAN IDEALS\n\n21\n\nnorming function φ, cannot be the intersection of a countable decreasing chain of norm ideals\nthat properly contain them [52, Corollary 7.8]. To the best of our knowledge not much more\nprogress has been achieved since then on this line of questions.\n\n∞\n\n5.3. Applications to ﬁrst order arithmetic mean ideals\nWhile in general the ﬁrst order arithmetic mean ideals can be am-stable without the ideal\nI being am-stable, e.g., the examples mentioned at the end of Section 5.3 (and likewise for\nam-\n\nideals), principal ideals are more “rigid.”\n\nFirst order arithmetic mean ideals are investigated in [24] and [33]-[35] and the density\n\ntheorems of Section 3 provide further information for the principal ideal cases.\n\nTheorem 5.10. [36, Theorem 5.1]\nLet I be a nonzero principal ideal. Then am-stability of the following ideals are equivalent:\nI, I oo, Ia and I −, and also aI, I o and I− provided the latter three are nonzero.\nNotice that for any ideal I that does not contain (ω) (resp., L1), aI = I o =\n(resp.,\nis am-stable while in both cases I is not, the conditions in the last\nI− =\ncorollary that Ia, I o and I− are nonzero is essential. Some of the implications in Theorem\n5.10 depend on Proposition 5.12 below.\n\n). Since\n\n{\n\n}\n\n}\n\n}\n\n{\n\n{\n\n0\n\n0\n\n0\n\n⊂\n\n⊂\n\nI o∞\n\nI, a∞I\n\ncase. The ﬁrst is that if I\n\nThere are two main diﬀerences in the am-\n\n, then\nunlike the am-case, a∞I is never zero, and in lieu of the two chains of inclusions, we have\nL1 ⊂\nIa∞.\na∞I\n(See [34, Proposition 4.8(i)-(i′)] and remarks following both [35, Corollary 3.8 and Proposition\n3.14].) The second is that if I is principal, then I o∞, I oo∞ and Ia∞ are either principal or\nthey coincide with se(ω) [34, Lemma 4.7], [35, Lemma 3.9, Lemma 3.16]. Consequently, as\nse(ω) is not am-stable, when I is principal, if any of the ideals I o∞, I oo∞ or Ia∞ is am-stable,\nthen it is principal as well.\n\n∞\nI −∞\n\nIa∞, and I\n\n{\nI oo∞\n\nse(ω)\n\nI−∞\n\nI, I\n\n⊂\n\n⊂\n\n⊂\n\n⊂\n\n⊂\n\n=\n\n∩\n\n∩\n\n}\n\n0\n\nTheorem 5.11. [36, Theorem 5.2] Let I\nof the following ideals is equivalent: I, a∞I, I o∞, I−∞, I oo∞, Ia∞, and I −∞.\n\nbe a principal ideal. Then am-\n\n=\n\n}\n\n{\n\n0\n\nstability\n\n∞\n\nThe fact that a sequence ξ\n\nc∗\no is regular if and only if ξa is regular has been proved in a\nnumber of diﬀerent ways (see [24, Remark 3.11] for a discussion). The analogous result for\n-regularity [34, Theorem 4.12] is quite hard and was one of the main results in that paper.\n\n∈\n\n∞\nBoth facts are also immediate consequences of Theorems 5.10 and 5.11.\n\nIt is useful in the study of ﬁrst order cancellations to note that Theorem 5.10 does not ex-\ntend beyond principal ideals. In fact, in [36, Examples 5.4-5.5] we ﬁnd a countably generated\nideal N which is not am-stable but for which aN = N o = N− = sta((ω)) is am-stable and a\ncountably generated ideal L which is not am-stable but for which La = L− = Loo = sta((ω))\nis am-stable.\n\nQuestion 6. Find am-\n\n∞\n\nanalogs for N and L, or prove otherwise.\n\n5.4. First order cancellation properties\nI? It is immediate\nWhich ideals I have the cancellation property that Ja ⊂\nto verify that the answer is: all am-closed ideals. Similarly, the ﬁrst order cancellations\n\nIa ⇒\n\n⊂\n\nJ\n\n.\n\n.\n\n6\n6\n\n22\n\nVICTOR KAFTAL AND GARY WEISS\n\n⊂\n\n⇒\n\naI\nI\ncase [36, Lemma 5.13].\n\nJ characterize the am-open ideals, and analogous results hold for the am-\n\n⊂ aJ\nAs a consequence, if I is a countably generated ideal that is not am-stable, it is not am-\nclosed by Theorem 2.7 and hence there is some ideal J\nIa. But then\nL := I + J ) I with La = Ia + Ja = Ia. In other words, equality cancellation does not hold\nwhen I is not am-stable.\n\nI for which Ja ⊂\n\n∞\n\n6⊂\n\nAt an early stage of this project, Ken Davidson and the second named author found a\ndirect constructive proof of this fact for the case of principal ideals or, equivalently, that\nthere is a principal ideal J ) I with J − = I −. The same result was obtained earlier by Allen\nand Shen [2] by diﬀerent methods.\n\nNotice that if I is principal and not am-stable, then it may be impossible to ﬁnd an ideal\nJ ( I such that Ja = Ia. A counterexample is constructed in [36, Example 6.3]. The same\npositive and negative results hold in the am-\n\n∞\nThe question of whether for a countably generated ideal I there exists an ideal J ) I\nwith with aJ = aI is considerably harder even when we assume that I is principal and it\nrequires a direct constructive proof. We ﬁrst notice that the condition aJ = aI is equivalent\nto J o = I o. The answer for principal ideals is given by;\n\ncase.\n\nProposition 5.12. [36, Proposition 6.5]\n(i) Let (ρ)\n(η(1)) and (η(2)) with (η(1)) possibly zero, such that\n\n=\n\n}\n\n{\n\n0\n\nbe a principal ideal that is not am-stable. Then there are two principal ideals\n\n(η(1)) ( (ρ) ( (η(2)),\n\n(η(1))oo = (ρ)o,\n\nand (ρ)oo = (η(2))o.\n\n(ii) Let (ρ)\n0\n}\nideals (η(1)) and (η(2)) such that\n\n=\n\n{\n\nbe a principal ideal that is not am-\n\nstable. Then there are two principal\n\n∞\n\n(η(1)) ( (ρ) ( (η(2)),\n\n(η(1))oo∞ = (ρ)o∞,\n\nand (ρ)oo∞ = (η(2))o∞.\n\nThis proposition was the key for proving some of the implications in Theorems 5.10 and\n\n5.11 presented above and also the following theorem.\n\nbe a principal ideal and let J be an arbitrary ideal. Then the following are\n\n0\n\n}\n\n{\n\nTheorem 5.13. [36, Theorem 6.7]\n(A) Let I\n=\nequivalent.\n(i) I is am-stable\n(ii) aJ = aI (or, equivalently, J o = I o) implies J = I\n(iii) Ja = Ia (or, equivalently, J − = I −) implies J = I\n(B) Let I\n=\nequivalent.\n(i) I is am-\n(ii) a∞J = a∞I (or, equivalently, J o∞ = I o∞) implies J = I.\n(iii) Ja∞ = Ia∞ (or, equivalently, J −∞ = I −∞) implies J = I\n\nstable\n\n∞\n\n{\n\n}\n\n0\n\nbe a principal ideal and let J be an arbitrary ideal. Then the following are\n\nSimilar cancellation properties hold for the identities J oo = I oo, J− = I− and for the am-\ncase.\n\n∞\n\nThe examples mentioned at the end of Section 5.3 show that the ﬁrst order equality\nIndeed,\n\ncancellations of Theorem 5.13 can fail for countably generated am-stable ideals.\n\n6\n6\n6\n6\n\naN = N− is am-stable yet\n\nARITHMETIC MEAN IDEALS\n\n23\n\nN = aN and N− = (N−)−\nSimilarly, La = Loo is am-stable yet La = La2 does not imply L = La and Loo = (Loo)oo does\nnot imply L = Loo.\n\naN = a2N\n\nN = N−.\n\n6⇒\n\n6⇒\n\n⊃\n\nFirst order inclusion cancellations occur naturally in the study of operator ideals. We have\nseen that two of the inclusion cancellations characterize am-open and am-closed ideals (and\nIa\nsimilarly for the am-\nimply J\n\ncase. Another cancellation question, “for which ideals I does Ja ⊃\n\nI?” has an interesting origin and an answer that we also found interesting.\n\n∞\n\nIts origin is the still open question from [24, Section 7]: If the class [J, B(H)]1 of single\ncommutators of operators in J with operators in B(H), contains a ﬁnite rank operator with\nnonzero trace, must J\n\n(√ω)?\nIt was shown in [24, Theorem 7.3] only that then J −\n\n(√ω) = (√ω)a, so it was natural\nto ask whether this result was enough, namely, whether (√ω) satisﬁed this cancellation\nproperty. To obtain the answer (negative), we deﬁne for any ideal I the “greatest lower\nbound,”\n\n⊃\n\n⊃\n\nI for this cancellation, namely:\nIa}\n\nJa ⊃\n\nI :=\n\nJ\n\n|\n\nDeﬁnition 5.14.\nb\n\n{\nI when I is principal and show that it is itself principal.\nWe can explicitly identify\nT\nDeﬁnition 5.15. For ξ\nξ := < (ξa)ν(ξ)n >.\n\nℓ1, let ν(ξ)n := min\n\ni=1 ξi ≥\n\nnξ1}\n\n∈\nb\n\nc∗\no\n\nN\n\n∈\n\nb\n\nk\n\n{\n\n\\\n\n|\n\nk\n\nand deﬁne\n\nP\n\nξ is asymptotic to < n\n\nThen\nb\nℓ1.\nTheorem 5.16. [36, Theorem 6.14] Let ξ\nb\nc∗\no, then for every ε > 0, ηn ≥\n(i) If ηa ≥\n(ii) For every ρ\nΣ((\n\nξ1 > and moreover\n\nξ)), there is an η\n\nν(ξ)n\n\nc∗\no\n\n∈\n\n\\\n\nξa and η\n∈\nc∗\no\n\\\n\n∈\n\n∈\n\nε)\n\n(1\n−\nc∗\no for which ηa ≥\nb\n\nξn for n suﬃciently large.\n\nξa and ρ /\n∈\n\nΣ((η)).\n\nAs a consequence we identify\n\nI for all principal ideal I and in particular, for all ideals\n\n(ωp).\n\nb\n\nCorollary 5.17. [36, Corollary 6.15] Let 0\n\n= ξ\n\nb\n\nCorollary 5.18. [36, Corollary 6.16]\n(i)\n\nc∗\no, then\n\n(ξ) =\n\n∈\n\nc\n\nF\nξ)\n(\n(\n\nb\n\nfor ξ\n∈\nfor ξ /\n∈\n\nℓ1\nℓ1\n\nF\n(< n\n(ω)p = \n(ω)p′\n\n\nd\n\nen >)\n\nfor p > 1\nfor p = 1\nfor 0 < p < 1, where 1\n\n1\np′ = 1\n\np −\n\n(ii)\n\n(ω)p is am-stable if and only if 0 < p < 1\n2.\n\n\n\nSo, in particular \\(ω)1/2 = (ω): in other words, knowing that J −\nd\nthat J\n\n(ω).\n\n(ω)1/2 only guarantees\n\n⊃\n\nNotice that by deﬁnition,\n\n(ξ), but as the case of (ω)1/2 illustrates, the inclusion can\nbe proper even when ξ is regular, i.e., when (ξ) is am-stable. As the following proposition\nshows, the inclusion is certainly proper when (ξ)\n\n= F is not am-stable.\n\n(ξ)\n\n⊂\n\nc\n\n⊃\n\n6\n6\n\n24\n\nVICTOR KAFTAL AND GARY WEISS\n\nProposition 5.19. [36, Proposition 6.17]\n\nIf F\n\n= (ξ) =\n\n(ξ) with\n\n0\n\n{\n\n= ξ\n\n} 6\n\nThere are principal ideals I =\nc\n\nc∗\no, then (ξ) = (ξ)a.\n\n∈\nI with I\n\n= F .\n\nExample 5.20. [36, Example 6.18] Let ξj = 1\n\nb\n\nk for j\n\n((k\n\n∈\n\n−\n\n1)!, k!]. Then (ξ) =\n\n(ξ).\n\nThus the condition ξ\n\n≍\n\nξ is strictly stronger than regularity.\n\nc\n\n|\n\n{\n\nJa∞ ⊃\n\nI can be extended naturally to the am-\nb\n\nWhile the deﬁnition of\nIa∞}\nJ\nb\nT\nQuestion 7. If I = (ξ), is\nsimilar to the one in Deﬁnition 5.15 and with similar properties?\n\n, we have not analyzed its properties.\n\ncase by setting\n\nI ∞ :=\n\n∞\n\nb\n\nI ∞ principal? If yes, is there an expression for its generator 6. Second order arithmetic means in operator ideals \nb\n\nSecond order arithmetic mean cancellations are considerably more complex even for prin-\ncipal ideals and are the focus of [37]. The questions we addressed there are: which conditions\non an ideal I guarantee that the following second order arithmetic mean inclusion cancella-\ntions and equality cancellation hold for arbitrary J?\nIa\nJa ⊂\nIa\nJa ⊃\nJa = Ia\n\nIa2\n(i) Ja2\nIa2\n(ii) Ja2\n(iii) Ja2 = Ia2\n\n⊂\n⊃\n\n⇒\n⇒\n⇒\n\nThe ﬁrst natural “test” question, posed by M. Wodzicki arising from work in [24], is\nwhether equality cancellation (iii) holds automatically for all pairs of principal ideals. Re-\nformulated in terms of the s-number sequences ξ and η of the generators of the two principal\nηa2 of the sequences of the second\nideals, the question asks whether the equivalence ξa2\nηa of the ﬁrst order means.\norder arithmetic means always implies the equivalence ξa ≍\n\nThe answer to this question is negative and is one of the main results of [37].\n\n≍\n\n= Ia.\n\nExample 6.1. [37, Example 4.3] There exists principal ideals J\nJa 6\nConstruction. Set δk = e− Pk−1\n\nfor k > 1, ξ1 = η1 = 1, and deﬁne\n\np=1 p2\n\nI for which Ja2 = Ia2 but\n\n⊂\n\nand\n\nξj := e−k2\n\nδk for mk < j\n\nmk+1\n\n≤\n\nηj :=\n\nke−k2δk\ne−k2δk\n\n(\n\nfor mk < j\nfor [ek2mk] < j\n\n≤\n\n[ek2mk]\n\nmk+1.\n\n≤\n\nwhere mk+1 > [ek2mk] is chosen suﬃciently large so to insure that (ηa2)mk+1 ≤\nThen\n\n(1 + 1\n\nk )e−k2δk.\n\n(ξa2)nk\n\n(ηa2)nk\n\nδk ∼\n\nδk ∼\n\nk2e−k2\n\nwhile\n\n(ξa)nk\n\nδk ∼\n\n2e−k2\n\nand\n\n(ηa)nk\n\nδk ∼\n\nke−k2\n\n.\n\n6\n6\n\nARITHMETIC MEAN IDEALS\n\n25\n\nLet J := (ξ) and I := (η), then J\n\nI, Ja2 = Ia2 but Ja 6\nThe intuition behind the construction of this example led to the notion of the ratio of\nregularity sequence r(ξ) := ξa\nfor a nonincreasing sequence ξ\nco (see [37, Section 3]) and\nξ\nthen, indirectly, to the other results in [37].\n\n= Ia.\n\n⊂\n\n∈\n\n(cid:3)\n\nNotice that in general the ratio of regularity ξa\n\nξ has downward variations bounded by\nn+1, but it can vary abruptly upwards because the ratio\ncan be arbitrarily large. This is not the case, however, if ξ itself is an\n\nn+1rn + 1\n\nn\n\nthe inequality rn+1 ≥\nr(ξ)n+1\nξn\nr(ξ)n ≥\nξn+1\naverage. Indeed r(ηa)n+1 < (1 + 1\n\nn\nn+1\n\nn )r(ηa)n for all n and all η. Moreover,\n\n1\n\nr(ηa)n ≤\n\n≤\n\nlog n\n\nfor all n > 1 and all η.\n\n≍\n\n1) and when it is “maximal,” (i.e. r(ηa)\n\nThe two “extremal cases” of the ratio of regularity of an average are thus when it is bounded\n(i.e., r(ηa)\nlog). The ﬁrst case occurs precisely\nwhen ηa is regular (if and only if η is regular). The second case is equivalent to what we call\nthe exponential ∆2-condition sup\nm\n\n∞\nSomewhat to our surprise, we found that either extremal cases for η are suﬃcient, in the\n\n[37, Proposition 3.11].\n\nm2(ηa)m2\nm(ηa)m\n\n≍\n\n<\n\nprincipal ideal case, for the equality cancellation in (iii) to hold:\n\nlog or η\n\n≍\n\n≍\n\nηa, and let J be an arbitrary ideal.\n\nTheorem 6.2. [37, Theorem 4.8]\n(i) Let I = (η) be principal ideal, let r(ηa)\nThen Ja2 = Ia2\n(ii) Let I be an ideal such that for every ξ\nr(ηa)\n\nJa = Ia.\n\nlog or η\n\n⇒\n\n≍\n\n≍\n\n∈\n∈\nη and let J be an arbitrary ideal. Then Ja2 = Ia2\n\n≤\nJa = Ia.\n\nΣ(I) there is some η\n\nΣ(I), ξ\n\nη, for which\n\n⇒\n\nb\n\nAs mentioned at the end of Section 5.4 the condition η\n\nηa.\nWe do not know if the weaker condition η\nηa might also suﬃce in part (ii) of Theorem\n≍\n6.2. Some partial negative evidence comes from the fact that for general ideals (even count-\nably generated ideals), arithmetic mean stability is not suﬃcient for the ﬁrst order equality\ncancellation to hold, and the counterexample is the ideal L presented after Theorem 5.13.\nHowever, L itself is not the arithmetic mean of an ideal, i.e., it is not am-open, so that it\ndoes not provide a counterexample to second order equality cancellation.\n\nη is strictly stronger than η\n\n≍\n\n≍\n\nb\n\nQuestion 8.\n\n≍\n\n(i) Would the condition η\n(ii) What is a necessary condition for the principal ideal case?\nWhile we do not know if these two conditions, η regular or r(ηa)\n\nηa be suﬃcient in part (ii) of Theorem 6.2?\n\nlog, are necessary for\nthe equality cancellation in (iii) to hold, we know that they are too strong for the inclusion\ncancellation in (i). Indeed a weaker suﬃcient condition for (i) is that r(ηa) is equivalent to\na monotone sequence.\n\n≍\n\nTheorem 6.3. [37, Theorem 4.5]\n(i) Let I = (η) be principal ideal, let r(ηa) be equivalent to a monotone sequence and let J be\nIa.\nJa ⊂\nan arbitrary ideal. Then Ja2\nη, for\n(ii) Let I be an ideal such that for every ξ\n∈\nwhich r(ηa) is equivalent to a monotone sequence and let J be an arbitrary ideal. Then\nJa2\n\nΣ(I) there is some η\n\nΣ(I), ξ\n\nIa.\n\nIa2\n\nIa2\n\n⇒\n\n⊂\n\n≤\n\n∈\n\n⊂\n\nJa ⊂\n\n⇒\n\n\n26\n\nVICTOR KAFTAL AND GARY WEISS\n\nOn the other hand, the two conditions, η regular or r(ηa)\n\nlog, are too weak for the\ninclusion cancellation in (ii). Indeed, the principal ideal generated by the regular sequence\nω1/2 does not satisfy the inclusion cancellation in (ii).\n\n≍\n\nExample 6.4. [37, Example 4.7] There exists a principal ideal (ξ) for which (ω1/2)a2\nbut for which (ω1/2)a 6⊂\n\n(ξ)a.\n\n(ξ)a2\n\n⊂\n\nA suﬃcient condition for the inclusion cancellation in (ii) is:\n\nTheorem 6.5. [37, Theorem 4.6]\n(i) Let I = (η) be a principal ideal, let r(ηa)\nJa ⊃\nThen Ja2\n(ii) Let I be an ideal such that for every ξ\nη and let J be an arbitrary ideal. Then Ja2\nr(ηa)\n\nlog or η\n\nlog or η\n\nIa.\n\nIa2\n\n⇒\n\n⊃\n\n≍\n\n≍\n\n∈\n\nb\n\nΣ(I) there is some η\n\n≍\n\n≍\n\nη, and let J be an arbitrary ideal.\n\n∈\nIa2\n\n⊃\n\nΣ(I), ξ\nJa ⊃\n\n⇒\n\nη, for which\n\n≤\nIa.\n\nQuestion 9. Find necessary conditions, at least for the principal ideal case, for the inclusion\ncancellations (i) and (ii) to hold.\n\nb\n\nBy the fact that if η satisﬁes the exponential ∆2-condition then ηap satisﬁes the exponential\nN [36, Corollary 3.12], Theorems 6.2, 6.3, and 6.5 have a partial\n\n∆2-condition for every p\nextension to higher order arithmetic means.\n\n∈\n\nTheorem 6.6. Let p\no-sequence in the characteristic set Σ(I) of an ideal\nI is dominated by some η in its characteristic set that satisﬁes the pth order exponential\nIap+1 implies\n∆2-condition sup\nm\n\n, then Jap+1 = Iap+1 implies Jap = Iap, Jap+1\n\nm2(ηap )m2\nm(ηap )m\n\nN. If every c∗\n\n⊂\n\n<\n\n∈\n\nJap\n\nIap, andJap+1\n\n⊂\n\n⊃\n\n∞\nIap+1 implies Jap\n\nIap.\n\n⊃\n\nThe theory of arithmetic mean at inﬁnity ideals, in many instances mirrors that of arith-\n\nmetic mean ideals. We have not investigated second order am-\n\ncancellations.\n\n∞\n\nQuestion 10. What is the corresponding theory for second order am-\n\ncancellations?\n\n∞ 7. The Schur-Horn majorization theorem and am-closed ideals \n7.1. Motivations and deﬁnitions\nGiven an ideal I, ξ\nmeans that\nsequences is called majorization.\n\n∈\nn\nj=1 ξj =\n\nP\n\nP\n\nΣ(I −) if and only if ξa ≤\n\nηa\nn\nj=1 ηj for all n and this relation between (monotone non-increasing)\n\nΣ(I). The inequality ξa ≤\n\nηa for some η\n\n∈\n\n.\n\nMore precisely, in the traditional terminology introduced by Hardy, Littlewood, and P´olya\n\n(see [31]),\n\nDeﬁnition 7.1. Let ξ, η\nξ is said to be weakly majorized by η if\naddition,\n\n(RN )+ and let ξ∗, η∗ denote their monotone rearrangement, then\nN. If, in\n\nj=1(ξ∗)j ≤\nj=1(η∗)j, then ξ is said to be majorized by η.\n\nj=1(η∗)j for all 1\n\nj=1(ξ∗)j =\n\n≤\n\n≤\n\n∈\n\nn\n\nN\n\nN\n\nn\n\nn\n\nP\n\nP\n\nP\n\nMajorization theory arose during the early part of the 20th century from a number of\napparently unrelated topics: inequalities involving convex functions (Hardy, Littlewood, and\nP´olya [31]), wealth distribution (Lorenz [44]), convex combinations of permutation matrices\n\nP\n\n\nARITHMETIC MEAN IDEALS\n\n27\n\n(Birkhoﬀ [8]), and more central to our interests [38], doubly stochastic matrices (Hardy, Lit-\ntlewood, and P´olya [31]) and the relation established between eigenvalue lists and diagonals\nof selfadjoint matrices by the Schur-Horn Theorem:\n\nTheorem 7.2. [54, Schur], [32, Horn]) Let ξ, η\nonly if there is a selfadjoint N\n\n(RN )+. Then ξ is majorized by η if and\nN matrix A having eigenvalue list η and diagonal entries ξ.\n\n∈\n\n×\n\nFor inﬁnite sequences “equality at the end” has no obvious meaning beyond the summable\ncase. We provide in the deﬁnition below a condition that generalizes this notion for possibly\nnonsummable inﬁnite sequences which we call strong majorization. We use the following\nterminology and to simplify notations we introduce it directly for c∗\n\no sequences.\n\nDeﬁnition 7.3. Let ξ, η\n\n∈\n\nc∗\no, then we say that\nη) if\n\nn\n\nj=1 ξj ≤\nξ is majorized by η (denoted by ξ\nξ is strongly majorized by η (denoted by ξ 4 η) if ξ\nP\n≺\nξ is block majorized by η (denoted by ξ\n≺b η) if ξ\n≺\nsome subsequence N\n\n≺\n\n.\n\nnk ↑ ∞\n\n∋\n\n(ℓ1)∗ then we say that\n\nn\nj=1 ηj for every n\nη and limn\nP\nnk\nj=1 ξj =\nη and\nP\n\nN;\n∈\nj=1(ηj −\n\nn\n\nξj) = 0;\nnk\nj=1 ηj for\n\nP\n\nP\n\n∈\nj=n ξj ≤\nξ is majorized at inﬁnity by η (denoted by ξ\nn\nξ is strongly majorized at inﬁnity by η (denoted by ξ 4∞ η) if ξ\n\n∞ η) if\n\nP\n\nN;\n\n≺\n\n∞\n\n∈\n∞\nj=1 ξj =\n\n∞\nj=1 ηj.\n\nP\n∞ η and\n\n≺\n\n∞\nj=n ηj for every\n\n•\n•\n•\n\nLet ξ, η\n\n•\n\n•\n\nP\n\nImmediate consequences of Deﬁnition 7.3 are:\nξ 4 η\n\nP\n\nξ\n\n≺b η\n\n⇒\n(ℓ1)∗ then ξ 4 η\n\nξ\n\nη,\n\n∞\n\n≺\n\n⇒\n\nξ\n\n≺\n\n⇔\n\nη and\n\nif η\n\n∈\n\n∞\n\nξj =\n\nηj,\n\nj=1\nX\n\nj=1\nX\n\nand\n\n∞\n\n∞\n\nif\n\nξj =\n\nj=1\nX\n\nj=1\nX\n\nηj <\n\n,\n\n∞\n\nthen η\n\n∞ ξ\n\n≺\n\nη.\n\nξ\n\n≺\n\n⇔\n\nΣ(I −) (resp., Σ(I −∞) precisely if ξ\n\nThus ξ\nis am-closed (resp., am-\nmajorization order (resp., majorization at inﬁnity order).\n\nΣ(I) and I\n≺\nclosed) precisely when Σ(I) is hereditary (i.e., solid) under the\n\n∞ η) for some η\n\nη (resp., ξ\n\n∞\n\n≺\n\n∈\n\n∈\n\nThus majorization at inﬁnity for summable sequences, i.e., “tail majorization,” that has\nbeen introduced and studied also for ﬁnite sequences, has a particular relevance for us.\nBlock-majorization can be seen as a way to bring to bear on inﬁnite sequences the results\nof ﬁnite majorization theory, in particular the Schur-Horn Theorem, but we have discovered\nthat it plays also a relevant role on its own.\n\n7.2. Why “strong” majorization?\nBeyond the obvious reason that for summable sequences the relation 4 is indeed equivalent\nto majorization with “equality at the end,” the relation 4 satisﬁes the following proper-\nties that characterize “equality at the end” for the ﬁnite sequence case and is somewhat\nreminiscent of density properties discussed earlier in Section 5.3.\n\n.\n\nTheorem 7.4. [38, Theorem 5.4] Let ξ, η\nη.\n(i) There is a ζ\n\nc∗\no for which ξ 4 ζ\n\nc∗\no and ξ\n\nη.\n\n≺\n\n∈\n\n∈\n\n≤\n\n\n28\n\nVICTOR KAFTAL AND GARY WEISS\n\n(ii) There is a ρ\n\nc∗\no for which ξ\n\nρ 4 η.\n\n≤\n\n∈\n\nTheorem 7.5. [38, Theorem 5.7] If ξ, η\n(i) ξ 4∞ ζ\n(ii) ξ\n\nη for some ζ\nρ 4∞ η for some ρ\n\nc∗\no;\nc∗\no.\n\n≤\n\n∈\n∈\n\n≤\n\n(ℓ1)∗ and ξ\n\n∞ η, then\n\n≺\n\n∈\n\nThe key tool in the proofs of these results was the following:\n\nc∗\no and ξ\n\nProposition 7.6. [38, Proposition 5.2]\nIf ξ, η\n∈\n(i) For every m\n(ii) There is ζ\n(iii) There is ρ\n\n≺\nN,\n1 (ηj −\n∈\nc∗\no for which ξ\nP\nc∗\no for which ξ\n\nn\n\n{\n\nn\n\nξj)\n|\n≺b ζ\nρ\n≤\n\n≥\nη.\n≤\n≺b η.\n\n∈\n∈\n\nm\n}\n\nη, then the following conditions are equivalent.\n\nattains a minimum.\n\nand an analogous but more complicated result helped us handle the ”tail condition” [38,\nProposition 5.6].\n\n7.3. Inﬁnite majorization and stochastic matrices\nSince Hardy, Littlewood, and P´olya [31], stochastic matrices played a key role in majorization\nη (resp., ξ 4 η -using\ntheory. They proved that for ﬁnite monotone sequences ξ and η, ξ\nthe notations of our paper, not the original notations of Hardy, Littlewood, and P´olya) if\nand only if ξ = P η for some substochastic (resp., doubly stochastic) matrix P . These are\n1 (resp.,\nmatrices with non-negative entries, where all the rows and columns have sums\n= 1). Closer to our interest, the key step in the proof of the Schur-Horn theorem was to show\nthat if ξ 4 η then ξ = Qη for some orthostochastic matrix Q, i.e., a matrix Qij = (Uij)2 for\nsome orthogonal matrix U (unitary with real entries). Notice that it is then an elementary\ncomputation to show that diag ξ = E(U diag η U ∗) where E(X) denotes the main diagonal\nof a matrix X.\n\n≺\n\n≤\n\n.\n\nMajorization for inﬁnite sequences has received over the years only a moderate amount of\nattention. In a not nearly as well-known article as it deserves, in 1964 Markus [45, Lemma\n3.1] extended to the inﬁnite case part of the Hardy, Littlewood, and P´olya theorem, by\nshowing that if ξ, η\nη if and only if ξ = Qη for some substochastic matrix Q.\nAlthough he did not adopt this terminology, his proof was based on iterations of T-transforms\n(see [38, Section 4] for details).\n\nc∗\no, then ξ\n\n≺\n\n∈\n\nIn fact, with a slight tightening of his construction, it is easy to see that when ξn > 0\nfor all n, then the construction associates canonically with ξ\nη a substochastic matrix\nQ(ξ, η) for which ξ = Q(ξ, η)η and as Markus had already remarked, the matrix Q(ξ, η) is\nrow-stochastic (all the rows have sum equal to 1). What was, however, much less trivial to\nshow was\n\n≺\n\nc∗\nη. Then\no with ξn > 0 for every n and ξ\nTheorem 7.7. [38, Theorem 3.4] Let ξ, η\nQ(ξ, η) is co-isometry stochastic, i.e., Q(ξ, η)ij = (W (ξ, η)ij)2 and W (ξ, η) is a co-isometry\nwith real entries.\n\n≺\n\n∈\n\nThe co-isometry W (ξ, η) too is canonical and completely determined by a sequence\n\nwhere mk ∈\n(see [38] for details). We further have:\n\nN are the size of the T-transform matrices and 0 < tk ≤\n\nmk, tk}\n1 the convex coeﬃcients\n\n{\n\nTheorem 7.8. [38, Theorem 3.3] Let ξ\nThen the following are equivalent.\n(i) ξ 4 η\n\n≺\n\nη for some ξ, η\n\n∈\n\nc∗\no with ξn > 0 for every n.\n\n\nARITHMETIC MEAN IDEALS\n\n29\n\n(ii) W (ξ, η) is an orthogonal matrix.\n(iii)\n\nmk = 1\n\n=\n\n.\n\n}\n\n∞\n\ntk |\n\n{\nP\n\nCorollary 7.9. [38, Corollary 3.13] Let ξ\nThen the following are equivalent.\n(i) ξ\n≺b η\n(ii) W (ξ, η) is the direct sum of ﬁnite orthogonal matrices.\n(iii) The set\n\nis inﬁnite.\n\nmk = tk = 1\n\n≺\n\nk\n\nη for some ξ, η\n\n{\n\n|\n\n}\n\nc∗\no with ξn > 0 for every n.\n\n∈\n\nTheorem 7.8 shows that if ξ 4 η then ξ = Qη for some orthostochastic matrix Q, namely\n4 η where ξ = Qη\nQ = Q(ξ, η). We found an example of an nonsummable ξ with ξ\nfor some Q\n= Q(ξ, η) orthostochastic [38, Example 2.12 ]. It turned out that this example\nwas “generic” (see Theorem 7.11 below). The key step in the proof was the following “splice”\nlemma:\n\nη but ξ\n\n≺\n\nLemma 7.10. [38, Lemma 4.2] Let ξ, η\nThen there is a partition of N in two sequences\nξ′ :=\n, η′ :=\nξ and η, then ξ′ 4 η′ and ξ′′\n\nξn(2)\nj }\nη′′ but ξ′′\n\n{\nηn(2)\n{\nj }\n4 η′′ and ξ′′\n\nηn(1)\nj }\n\nξn(1)\nj }\n\n, η′′ :=\n\n, ξ′′ :=\n\n∈\n\n{\n\n{\n\n{\n\nc∗\no and assume that ξ\nn(1)\nj }\n\n(ℓ1)∗.\n4 η and ξ\nη but ξ\nwith n(1)\n1 = 1, so that if\nare the corresponding subsequences of\n\n≺\nn(2)\nj }\n\nand\n\n6∈\n\n{\n\n≺\n\n(ℓ1)∗.\n\n6∈\n\nThen a direct sum argument yields\n\nTheorem 7.11. [38, Theorem 4.3]\nIf ξ, η\nQ.\n\n(ℓ1)∗, then ξ\n\nc∗\no and ξ\n\n≺\n\n∈\n\n6∈\n\nη if and only if ξ = Qη for some orthostochastic matrix\n\nwhich in turns is the key for our inﬁnite dimensional Schur-Horn majorization theorem:\n\n∈\n\nc∗\no. Then the following conditions are equivalent.\nK(H)+ with s(A) = η and s(E(A)) = ξ.\n\nTheorem 7.12. [38, Theorem 4.4]\nLet ξ, η\n∈\n(i) There is an A\n(ii) diag ξ = E(U diag ηU ∗) for some unitary operator U.\n(iii) ξ = Qη for some orthostochastic matrix Q.\nIf ξ\n∈\n(ivS) ξ 4 η\nIf ξ\n(ivNS) ξ\n\n(ℓ1)∗, then conditions (i)-(iii) are equivalent to\n\n(ℓ1)∗, then conditions (i)-(iii) are equivalent to\n\nη.\n\n6∈\n\n≺\n\nThe nonsummable case is new. The summable case is an extension of the similar result\n\nby Arveson and Kadison [7, Theorem 4.1].\n\nThere has been a resurgence of interest in various aspects of the Schur-Horn Theorem\nand in particular its convexity formulation in terms of groups. The important paper by\nKonstant [43] was extended to inﬁnite dimensions by Block, Flaschka, and Ratiu [12] and\nby A. Neumann [48]. Neumann did also extend in part the connection between majorization\ntheory (but for more general sequences) and diagonal of matrices, and further work in this\ndirection was obtained by Antezana, Massey, Ruiz, and Stojanoﬀ [6].\n\nThere is fairly little overlap between our results and those in [48] and [6]. While we\nfocus on individual operators with prescribed eigenvalue list and diagonal, the cited papers\ndeal with norm closures of classes of such operators. Some connections and diﬀerences are\nexplored in [38, Section 6].\n\n6\n6\n6\n6\n\n30\n\nVICTOR KAFTAL AND GARY WEISS\n\n7.4. Applications to operator ideals\nThe properties of majorization for inﬁnite sequences developed above permit to obtain the\nfollowing characterization of the am-closure (resp., am-\n\nclosure) of an ideal.\n\n.\n\n∞\n\nc∗\no. Then the following conditions are equivalent.\n\n∈\n\n∈\n≺\n\nΣ(I).\nΣ(I).\n\nTheorem 7.13. [38, Theorem 6.1]\nLet I be an ideal and let ξ\nΣ(I −).\n(i) ξ\n(ii) ξ\nη for some η\n∈\n(ii′) ξ 4 η for some η\n∈\n(iii) ξ = P η for some η\n(iii′) ξ = Qη for some η\n(iv) diag ξ = E(L diag η L∗) for some η\n∈\n(iv′) diag ξ = E(U diag η U ∗) for some η\n∈\nL1, then the above conditions are further equivalent to\nIf I\n⊃\n(ii′′) ξ\n≺b η for some η\n∈\n(iii′) ξ = Qη for some η\n∈\n(iv′′) diag ξ = E(U diag η U ∗) for some η\northogonal matrices.\n\n∈\n∈\n\n∈\n\nΣ(I) and some substochastic matrix P .\nΣ(I) and some orthostochastic matrix Q.\n\nΣ(I).\nΣ(I) and some block orthostochastic matrix Q.\n\nΣ(I) and some contraction L.\nΣ(I) and some orthogonal matrix U.\n\nΣ(I) and some matrix U direct sum of ﬁnite\n\nL1 be an ideal and let ξ\n\n(ℓ1)∗. Then the\n\n∈\n\n⊂\n\n∈\n≺\n\nTheorem 7.14. [38, Theorem 6.6] Let I\nfollowing conditions are equivalent\nΣ(I −∞)\n(i) ξ\n(ii) ξ\n∞ η for some η\n(ii′) ξ 4∞ η for some η\n(ii′′) η 4 ξ for some η\n(iii) P ξ\n∈\n(iii′) Qξ\n∈\n(iv) E(V diag ξ V ∗)\n(iv′) E(U diag ξ U ∗)\n\n∈\n∈\nΣ(I).\n\nΣ(I).\nΣ(I).\n\n∈\n\n∈\n∈\n\nΣ(I) for some column stochastic matrix P .\nΣ(I) for some block orthostochastic matrix Q.\nI for some isometry V .\nI for some matrix U direct sum of ﬁnite orthogonal matrices.\n\nAs a consequence, if we let D denote the masa of diagonal operators (for the given or-\n\nthonormal basis), we have:\nCorollary 7.15. For every ideal I, E(I) = I −\n\nand hence\n\nD.\n\n∩\n\nCorollary 7.16. An ideal I is am-closed if and only if E(I)\n\nI.\n\n⊂\n\nThe latter property was called diagonal invariance in [58] and it can be viewed as a\nSφ for every\n\ngeneralization of [29, Theorem 4.2, Chapter III] which proves that E(Sφ)\nmaximal Banach ideal Sφ, where φ is the generating symmetric norming function.\n\n⊂\n\nTheorem 7.13 provides a further characterization of am-closed ideals:\n\nCorollary 7.17. Let I be an ideal. Then the following are equivalent:\n(i) I is am-closed.\n(ii) Σ(I) is invariant under substochastic matrices, in the sense that if ξ\nsubstochastic matrix, then (P ξ)∗\n(iii) Σ(I) is invariant under orthostocastic matrices and hence under any of the follow-\ning classes of (sub)stochastic matrices: row-stochastic, column-stochastic, doubly stochastic,\nisometry stochastic, co-isometry stochastic, unitary stochastic.\nIf I\n\nL1, then the above conditions are also equivalent to:\n\nΣ(I), where * denotes monotone rearrangement.\n\nΣ(I) and P is a\n\n∈\n\n∈\n\n⊃\n\n\n(iv) Σ(I) is invariant under block stochastic matrices.\n\nARITHMETIC MEAN IDEALS\n\n31\n\nWithout the condition I\n\nL1, (iv) does not imply (i), e.g., F is invariant under block\nstochastic matrices but it is not am-closed. More generally, in [35] we have shown that every\nam-closed ideal must contain L1.\n\n⊃\n\nInvariance under various classes of substochastic matrices can be seen as an (inﬁnite)\nconvexity property of the ideal and the following will make this clearer. Kendall introduced\nin [42] a topology on the space of boundedly row and column summable inﬁnite real matrices\nwith respect to which the set of doubly stochastic matrices is precisely the closed convex\nhull of the set of permutation matrices and used it to prove that the extreme points of the\nset of doubly stochastic matrices are the permutation matrices.\n\nThe class of inﬁnite convex combinations of permutation matrices\n∞\n\n∞\n\nC :=\n\n{\n\nj=1\nX\n\ntjΠj |\n\nΠj permutation matrix, 0\n\n1,\n\ntj ≤\n\n≤\n\ntj = 1\n\n}\n\nj=1\nX\n\n0\n\n}\n\n{\n\n∩\n\nK(H) =\n\nis strictly smaller than the class of doubly stochastic matrices. This can be seen for instance\nby noticing that C\nwhile it is possible to ﬁnd a Hilbert-Schmidt doubly\nstochastic matrix [16]. More interestingly, invariance of a characteristic set Σ(I) of an ideal\nideal I under C does not imply invariance of Σ(I) under the class of doubly stochastic\nIndeed, it elementary to see that If I is a Banach ideal\nmatrices, i.e., am-closure of I.\nthen Σ(I) is invariant under C and yet there are Banach ideals that are not am-closed, for\nexample the closure cl(ξ) of a principal ideal ξ for ξ irregular and nonsummable [56] (see\nalso discussion after Proposition 3.4). It is worth noticing that this counterexample is not a\nsoft ideal, and this seemingly unrelated fact turns out to be quite relevant as we see in the\nnext proposition,\n\nLet class B denote the following class of block substochastic matrices:\n∞\n\n∞\n\nB :=\n\ntjΠj |\n⊕\n\n{\n\nj=1\nX\n\nΠj ﬁnite permutation matrix, 0\n\n1,\n\ntj ≤\n\n≤\n\ntj = 1\n\n.\n\n}\n\nj=1\nX\n\nProposition 7.18. [38, Theorem 6.9] Let I be an ideal.\n(i) If Σ(I) is invariant under C, then I\n(ii) If I is soft-edged or soft-complemented, and Σ(I) is invariant under B, then I is invariant\nunder block stochastic matrices.\n(iii) If I is soft-edged or soft-complemented and Σ(I) is invariant under C, then I is am-closed.\n\nL1 and Σ(I) is invariant under B.\n\n⊃\n\n[1] Albeverio, S., Guido, D., Ponosov, A., and Scarlatti, S., Singular traces and compact operators, J. Funct.\n\nAnal. 137(2) (1996), pp. 281–302.",
  "reference": [
    "[1] Albeverio, S., Guido, D., Ponosov, A., and Scarlatti, S., Singular traces and compact operators, J. Funct. Anal. 137 (1996), pp. 281–302. ",
    "[2] G. D. Allen and L. C. Shen, On the structure of principal ideals of operators. Trans. Amer. Math. Soc. 238 (1978), 253–270. ",
    "[3] Anderson, J., Commutators of compact operators, J. Reine Angew. Math. 291 (1977), pp. 128–132. ",
    "[4] Anderson, J. and Vaserstein, L. N., Commutators in ideals of trace class operators, Indiana University Mathematics Journal 35  (1986), pp. 345–372. ",
    "[5] Anderson, J., Commutators in ideals of trace class operators. II, Indiana University Mathematics Journal 35  (1986), pp. 373–378. ",
    "[6] Antezana, J., Massey, P., Ruiz, M, and Stojanoﬀ, D., The Schur-Horn Theorem for operators and frames with prescribed norms and frame operator, Preprint. ",
    "[7] Arveson, W., and Kadison, R. V., Diagonals of self-adjoint operators. Preprint.  32 VICTOR KAFTAL AND GARY WEISS  ",
    "[8] Birkhoﬀ, G., Tres observaciones sobre el algebra lineal, Univ. Nac. Tucuman Rev. Ser. A  (1946) 147-151 ",
    "[9] Blass, A., Applications of superperfect forcing and its relatives, Set Theory and its Applications, Lecture Notes in Mathematics 1401, Springer-Verlag (1989), 18-40. ",
    "[10] Blass, A., Groupwise density and related cardinals, Arch. Math. Logic 30 (1990) 1-11. ",
    "[11] Blass, A., and Weiss, G., A Characterization and Sum Decomposition of Operator Ideals, Trans. Amer. Math. Soc. 246 (1978), 407-417. ",
    "[12] Block, A. M., Flaschka, H., and Ratiu, T. S., A Schur-Horn-Konstant convexity theorem for the diﬀeomorphism group of the annulus, Invent. Math. 113 no 3, (1993), 511-529. ",
    "[13] Brown, A. and Pearcy, C., Structure of commutators of operators, Ann. of Math.  82 (1965), pp. 112– 127. ",
    "[14] Brown, A., Pearcy, C., and Salinas, N., Ideals of compact operators on Hilbert space, Trans. Amer. Math. Soc. 18 (1971), 373–384. ",
    "[15] Calkin, J. W., Two-sided ideals and congruences in the ring of bounded operators in Hilbert space, Ann. of Math.  42 (1941), pp. 839–873. ",
    "[16] Chance, M. and Weiss, G., private communication, 2002. ",
    "[17] Connes, A., Non Commutative Geometry, San Diego Academic Press, 1994. ",
    "[18] Connes, A., Noncommutative diﬀerential geometry Part I, the Chern character in K-homology, Inst. Hautes Etudes Sci., Bures-Sur-Yvette, 1982. ",
    "[19] Connes, A., Noncommutative diﬀerential geometry Part II, de Rham homology and noncommutative algebra, Inst. Hautes Etudes Sci., Bures-Sur-Yvette, 1983. ",
    "[20] Connes, A., Noncommutative diﬀerential geometry, Inst. Hautes ´Etudes Sci. Publ. Math. 62 (1985), pp. 257–360. ",
    "[21] Dixmier, J., Les alg`ebres d’op´erateurs dans l’espace hilbertien (Alg`ebres de von Neumann), Cahiers scientiﬁques, fasc. 25, Gauthier-Villars, Paris, 1957. ",
    "[22] Dixmier, J., Existence de traces non normales, C. R. Acad. Sci. Paris S´er. A-B 262 (1966), pp. A1107– A1108. ",
    "[23] Dykema, K., Weiss, G., and Wodzicki, M., Unitarily invariant trace extensions beyond the trace class, Complex analysis and related topics (Cuernavaca, 1996), Oper. Theory Adv. Appl. 114 (2000), pp. 59– 65. ",
    "[24] Dykema, K., Figiel, T., Weiss, G., and Wodzicki, M., The commutator structure of operator ideals, Adv. Math., 185/1 pp. 1–79. ",
    "[25] Dykema, K. J. and Kalton, N. J., Spectral characterization of sums of commutators. II, J. Reine Angew. Math. 504 (1998), pp. 127–137. ",
    "[26] Dykema, K. J. and Kalton, N. J., Sums of commutators in ideals and modules of type II factors Ann. Inst. Fourier (Grenoble) 55 3 (2005), pp. 931–971. ",
    "[27] Feldman, I., Krupnik, N., Markus, A. On the connection between the indices of a block operator matrix and of its determinant, Operator Theory: Advances and Applications 1, Birka¨user Verlag Basel/Switzerland (2006), pp. 1–17. ",
    "[28] Fuglede, B., A commutativity theorem for normal operators, Proc. Nat. Acad. Sci. U. S. A. 36 (1950), pp. 35–40. ",
    "[29] Gohberg, I. C. and Kre˘ın, M. G., Introduction to the theory of linear nonselfadjoint operators. American Mathematical Society (1969). ",
    "[30] Halmos, P. R., Commutators of operators. II, Amer. J. Math. 76 (1954), pp. 191–198. ",
    "[31] Hardy, G. H., Littlewood, J. E. and P´olya, G., Inequalities. 2d ed. Cambridge University Press, 1952. ",
    "[32] Horn, A. Doubly stochastic matrices and the diagonal of a rotation matrix. Amer. J. Math. 76 (1954), 620-630. ",
    "[33] Kaftal, V. and Weiss, G., Traces, ideals, and arithmetic means, Proc. Natl. Acad. Sci. USA 99  (2002), pp. 7356–7360. ",
    "[34] Kaftal, V. and Weiss, G., Traces on operator ideals and arithmetic means, preprint. ",
    "[35] Kaftal, V. and Weiss, G., Soft ideals and arithmetic mean ideals, IEOT, to appear. ",
    "[36] Kaftal, V. and Weiss, G., The B(H) lattices, density and arithmetic mean ideals, preprint. ",
    "[37] Kaftal, V. and Weiss, G., Second Order Arithmetic Means in Operator Ideals, J. Operators and Matrices (OAM), to appear.  ARITHMETIC MEAN IDEALS 33  ",
    "[38] Kaftal, V. and Weiss, G., Majorization for inﬁnite sequences, an extension of the Schur-Horn Theorem, and operator ideals, preprint. ",
    "[39] Kalton, N. J., Unusual traces on operator ideals, Math. Nachr. 134 (1987), pp. 119–130. ",
    "[40] Kalton, N. J., Trace-class operators and commutators, J. Funct. Anal. 86 (1989), pp. 41–74. ",
    "[41] Kalton, N. J., Spectral characterization of sums of commutators I, J. Reine Angew. Math. 504 (1998), pp. 115–125. ",
    "[42] Kendall, D., On inﬁnite doubly-stochastic matrices and Birkhoﬀ’s problem 111, Journal London Math. Soc, 35 (1960), 81-84. ",
    "[43] Konstant, B., On convexity, the Weyl group and the Iwasawa decomposition, Ann. Sci. ´Ecole Norm. Sup. 4 6 (1973), 413-455. ",
    "[44] Lorenz, M. O., Methods of measuring concentration of wealth, J. Amer. Statist. Assoc, 9 (1905), 209-219. ",
    "[45] A. S. Markus, The eigenand singular values of the sum and product of linear operators. Uspekhi Mat. Nauk 4 (1964), 93–123. ",
    "[46] Marshall, A. W. and Olkin, I., Inequalities: Theory of Majorization and its Applications, Academic Press Inc. [Harcourt Brace Jovanovich Publishers], Mathematics in Science and Engineering 143 (1979). ",
    "[47] Mildenberger, H., Groupwise dense families, Arch. Math. Logic 40 (2001), no. 2, pp. 93–112. ",
    "[48] Neumann, A., An inﬁnite-dimensional generalization of the Schur-Horn convexity theorem. Jour. Funct. Anal., 161 , 1999, 418-451. ",
    "[49] Ostrowski, A. M. , Sur quelques applications des fonctions convexes et concaves au sens the I. Schur J. Math. Pures Appl. ",
    "[9], 31, (1952), 253-292. ",
    "[50] Pearcy, C. and Topping, D., On commutators in ideals of compact operators, Michigan Math. J. 18 (1971), pp. 247–252. ",
    "[51] Putnam, C. R., On normal operators in Hilbert space, Amer. J. Math. 73 (1951), pp. 357–362. ",
    "[52] N. Salinas, Symmetric norm ideals and relative conjugate ideals. Trans. Amer. Math. Soc. 138 (1974), 213–240. ",
    "[53] Schatten, R., Norm ideals of completely continuous operators, Ergebnisse der Mathematik und ihrer Grenzgebiete, Neue Folge, Heft 27 , Berlin, Springer-Verlag, 1960. ",
    "[54] Schur, I., ¨Uber eine Klasse von Mittlebildungen mit Anwendungen auf der Determinantentheorie, Sitzungsber. Berliner Mat. Ges., ( 22), (1923), 9-29. ",
    "[55] Shul’man, V. S., Linear equations with normal coeﬃcients, Dokl. Akad. Nauk SSSR 270  (1983), pp. 1070–1073. ",
    "[56] Varga, J., Traces on irregular ideals, Proc. Amer. Math. Soc. 107 3 (1989), pp. 715–723. ",
    "[57] Voiculescu, D., Some results on norm-ideal perturbations of Hilbert space operators II, J. Operator Theory 5 (1981), pp. 77–100. ",
    "[58] Weiss, G., Commutators and Operators Ideals, dissertation (1975), University of Michigan Microﬁlm. ",
    "[59] Weiss, G., Commutators of Hilbert-Schmidt operators. II, IEOT 3  (1980), pp. 574–600. ",
    "[60] Weiss, G., An extension of the Fuglede commutativity theorem modulo the Hilbert-Schmidt class to operators of the form P MnXNn, Trans. Amer. Math. Soc. 278  (1983), pp. 1–20. ",
    "[61] Weiss, G., Commutators of Hilbert-Schmidt operators. I, IEOT 9  (1986), pp. 877–892. ",
    "[62] Weiss, G., B(H)-commutators: a historical survey. Recent advances in operator theory, operator algebras, and their applications, 307–320, Oper. Theory Adv. Appl., 153, Birkhauser, Basel, 2005. ",
    "[63] Wodzicki, M., Algebraic K-theory and functional analysis, First European Congress of Mathematics, Vol. II (Paris,1992) 120 (1994), pp. 485–496. ",
    "[64] Wodzicki, M., Vestigia investiganda, Mosc. Math. J. 4 (2002), pp. 769–798.  University of Cincinnati, Department of Mathematics, Cincinnati, OH, 45221-0025, USA E-mail address: victor.kaftal@math.uc.edu  E-mail address: gary.weiss@math.uc.edu "
  ],
  "reference_content": [
    {
      "reference_num": "[1]",
      "reference_title": "Singular Traces and Compact Operators",
      "reference_abstract": "We give a necessary and sufficient condition on a positive compact operatorTfor the existence of a singular trace (i.e. a trace vanishing on the finite rank operators) which takes a finite non-zero value onT. This generalizes previous results by Dixmier and Varga. We also give an explicit description of these traces and associated ergodic states onl∞(N) using tools of non standard analysis in an essential way."
    },
    {
      "reference_num": "[2]",
      "reference_title": "On the Structure of Principal Ideals of Operators",
      "reference_abstract": "This paper considers various types of principal ideals generated by single compact operators on a separable Hilbert space. In particular, necessary and sufficient condtions that a principal ideal be normable are given. Relations between principal ideals and duals of Lorentz and Orlicz spaces are also given. All conditions are expressed using the singular numbers of the operator."
    },
    {
      "reference_num": "[3]",
      "reference_title": "Commutators of compact operators",
      "reference_abstract": "In [4] Pearcy and Topping initiated the study of additive commutators of compact operators on Hilbert space and asked if each projection of rank one has this form. In [3] Brown and Schochet raised a more general question. Suppose H is an algebra of operators that contains the trace class operators and is commutative modulo the trace class operators. If A and B are elements of H and A is compact, then does the commutator [A,B] = AB – BA have trace 0? (This question arose from an attempt to generalize certain results obtained by Brown [2], Section 3, in the case where H is also a *-algebra."
    },
    {
      "reference_num": "[6]",
      "reference_title": "The Schur-Horn theorem for operators and frames with prescribed norms and frame operator",
      "reference_abstract": "Let $\\mathcal H$ be a Hilbert space. Given a bounded positive definite operator $S$ on $\\mathcal H$, and a bounded sequence $\\mathbf{c} = \\{c_k \\}_{k \\in \\mathbb N}$ of nonnegative real numbers, the pair $(S, \\mathbf{c})$ is frame admissible, if there exists a frame $\\{ f_k \\}_{k \\in \\mathbb{N}} $ on $\\mathcal H$ with frame operator $S$, such that $\\|f_k \\|^2 = c_k$, $k \\in \\mathbb {N}$. We relate the existence of such frames with the Schur-Horn theorem of majorization, and give a reformulation of the extended version of Schur-Horn theorem, due to A. Neumann. We use this to get necessary conditions (and to generalize known sufficient conditions) for a pair $(S, \\mathbf{c})$ to be frame admissible."
    },
    {
      "reference_num": "[7]",
      "reference_title": "Diagonals of self-adjoint operators",
      "reference_abstract": ""
    },
    {
      "reference_num": "[10]",
      "reference_title": "Groupwise density and related cardinals",
      "reference_abstract": "We prove several theorems about the cardinal $$\\mathfrak{g}$$ associated with groupwise density. With respect to a natural ordering of families of nond-ecreasing maps fromω toω, all families of size $$< \\mathfrak{g}$$ are below all unbounded families. With respect to a natural ordering of filters onω, all filters generated by $$< \\mathfrak{g}$$ sets are below all non-feeble filters. If $$\\mathfrak{u}< \\mathfrak{g}$$ then $$\\mathfrak{b}< \\mathfrak{u}$$ and $$\\mathfrak{g} = \\mathfrak{d} = \\mathfrak{c}$$ . (The definitions of these cardinals are recalled in the introduction.) Finally, some consequences deduced from $$\\mathfrak{u}< \\mathfrak{g}$$ by Laflamme are shown to be equivalent to $$\\mathfrak{u}< \\mathfrak{g}$$ ."
    },
    {
      "reference_num": "[11]",
      "reference_title": "A characterization and sum decomposition for operator ideals",
      "reference_abstract": "Let <inline-formula content-type=\"math/mathml\"> <mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" alttext=\"upper L left-parenthesis upper H right-parenthesis\"> <mml:semantics> <mml:mrow> <mml:mi>L</mml:mi> <mml:mo stretchy=\"false\">(</mml:mo> <mml:mi>H</mml:mi> <mml:mo stretchy=\"false\">)</mml:mo> </mml:mrow> <mml:annotation encoding=\"application/x-tex\">L(H)</mml:annotation> </mml:semantics> </mml:math> </inline-formula> be the ring of bounded operators on a separable Hubert space. Assuming the continuum hypothesis, we prove that in <inline-formula content-type=\"math/mathml\"> <mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" alttext=\"upper L left-parenthesis upper H right-parenthesis\"> <mml:semantics> <mml:mrow> <mml:mi>L</mml:mi> <mml:mo stretchy=\"false\">(</mml:mo> <mml:mi>H</mml:mi> <mml:mo stretchy=\"false\">)</mml:mo> </mml:mrow> <mml:annotation encoding=\"application/x-tex\">L(H)</mml:annotation> </mml:semantics> </mml:math> </inline-formula> every two-sided ideal that contains an operator of infinite rank is the sum of two smaller two-sided ideals. The proof involves a new combinatorial description of ideals of <inline-formula content-type=\"math/mathml\"> <mml:math xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" alttext=\"upper L left-parenthesis upper H right-parenthesis\"> <mml:semantics> <mml:mrow> <mml:mi>L</mml:mi> <mml:mo stretchy=\"false\">(</mml:mo> <mml:mi>H</mml:mi> <mml:mo stretchy=\"false\">)</mml:mo> </mml:mrow> <mml:annotation encoding=\"application/x-tex\">L(H)</mml:annotation> </mml:semantics> </mml:math> </inline-formula>. This description is also used to deduce some related results about decompositions of ideals. Finally, we discuss the possibility of proving our main theorem under weaker assumptions than the continuum hypothesis and the impossibility of proving it without the axiom of choice."
    },
    {
      "reference_num": "[13]",
      "reference_title": "Structure of Commutators of Operators",
      "reference_abstract": ""
    },
    {
      "reference_num": "[14]",
      "reference_title": "Ideals of compact operators on Hilbert space.",
      "reference_abstract": ""
    },
    {
      "reference_num": "[15]",
      "reference_title": "Two-Sided Ideals and Congruences in the Ring of Bounded Operators in Hilbert Space",
      "reference_abstract": "The developments of the present paper center around the observation that the ring B of bounded everywhere defined operators in Hilbert space contains non-trivial two-sided ideals.' This fact, which has escaped all but oblique notice in the development of the theory of operators, is of course fundamental from the point of view of algebra and at the same time differentiates 93 sharply from the ring of all linear operators over a unitary space with finite dimension number. As examples of two-sided ideals in 93 we may mention here the class of all operators A such that J(A), the range of A, has a finite dimension number, the class of all operators of Hilbert-Schmidt type,2 and the class fT of all totally continuous operators. Except for the ideal (0), every two-sided ideal in 93 contains the first ideal mentioned, and except for the ideal J3 itself, every twosided ideal in 93 is contained in the ideal f. Moreover, on the basis of the special spectral properties of the self-adjoint members of sJ, it is possible to characterize every two-sided ideal in ?B very simply in terms of the spectra of its nonnegative self-adjoint elements; for both the formulation and the proof of this result, which together with the facts mentioned above is discussed in ?1, the author is indebted to J. v. Neumann. The restriction of our attention to those ideals in if which are two-sided is basic for the points which we wish to develop; the two-sidedness compensates for the absence of commutativity in 93 in such a way as to permit the construction of quotient rings by the standard methods of abstract algebra.3 These rings, which are of course homomorphs of B with respect to addition and multiplication, are also homomorphs of. @ with respect to the operation *, and exhibit all of the formal properties of matrix algebras. This is established in ?2, and there also various properties of the associated congruences in gB are discussed. The remainder of the paper deals solely with the quotient ring @/{, where fJ is the ideal of totally continuous operators, and the associated congruence in i3. For essentially topological reasons, this is the only one of the quotient rings in"
    }
  ]
}